zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
/*
 * Copyright 2025-2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_CLOCK_H_
#define _FSL_CLOCK_H_

#include "fsl_common.h"

/*! @addtogroup clock */
/*! @{ */

/*! @file */

/*******************************************************************************
 * Configurations
 ******************************************************************************/

/*! @brief Configure whether driver controls clock
 *
 * When set to 0, peripheral drivers will enable clock in initialize function
 * and disable clock in de-initialize function. When set to 1, peripheral
 * driver will not control the clock, application could control the clock out of
 * the driver.
 *
 * @note All drivers share this feature switcher. If it is set to 1, application
 * should handle clock enable and disable for all drivers.
 */
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL))
#define FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL 0
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#ifndef SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY
#define SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY (1000000000UL)
#endif

/*! @name Driver version */
/*@{*/
/*! @brief CLOCK driver version 1.1.0. */
#define FSL_CLOCK_DRIVER_VERSION (MAKE_VERSION(1, 1, 0))
/*! @} */

/*! @name FREQME-based frequency measurement configuration (set via Kconfig, or override before including this header) */
/*@{*/
/*! @brief Reference clock scaling exponent used by CLOCK_Measure*Freq().
 *
 * One measurement counts target-clock edges during 2^REF_SCALE reference
 * cycles. With the 24 MHz crystal reference this gives ~2.73 ms per
 * measurement and 24 MHz / 2^16 = 366 Hz resolution. Valid range 0..24
 * (enforced at compile time); values above 24 could overflow the 31-bit
 * result counter with a 2 GHz target and 24 MHz reference
 * (2 GHz / 24 MHz * 2^25 > 2^31). */
#ifndef FSL_CLOCK_FREQME_REF_SCALE
#ifdef CONFIG_FSL_CLOCK_FREQME_REF_SCALE
#define FSL_CLOCK_FREQME_REF_SCALE (CONFIG_FSL_CLOCK_FREQME_REF_SCALE)
#else
#define FSL_CLOCK_FREQME_REF_SCALE (16U)
#endif
#endif
/*! @brief Bounded polling loop count for one FREQME measurement (CPU-frequency
 * independent busy-wait bound; measurement never completes if the reference
 * clock is dead). */
#ifndef FSL_CLOCK_FREQME_TIMEOUT_LOOPS
#ifdef CONFIG_FSL_CLOCK_FREQME_TIMEOUT_LOOPS
#define FSL_CLOCK_FREQME_TIMEOUT_LOOPS (CONFIG_FSL_CLOCK_FREQME_TIMEOUT_LOOPS)
#else
#define FSL_CLOCK_FREQME_TIMEOUT_LOOPS (1000000U)
#endif
#endif
/*@}*/

/*! @name PLL frequency macros (project defaults; override before including this header) */
/*@{*/
#ifndef FSL_CLOCK_USBPLL_OUT_FREQ_HZ
#define FSL_CLOCK_USBPLL_OUT_FREQ_HZ   (480000000U)
#endif
#ifndef FSL_CLOCK_USBPLL_48M_FREQ_HZ
#define FSL_CLOCK_USBPLL_48M_FREQ_HZ   (48000000U)
#endif
#ifndef FSL_CLOCK_MIPIPLL_DIV8_FREQ_HZ
#define FSL_CLOCK_MIPIPLL_DIV8_FREQ_HZ (54000000U)
#endif
#ifndef FSL_CLOCK_MEDIAPLL_FREQ_HZ
#define FSL_CLOCK_MEDIAPLL_FREQ_HZ     (108000000U)
#endif
/*! @} */

/*! @brief Clock gate name arrays */


/*! @brief Clock ip name array for ACMP. */
#define CMP_CLOCKS                                                                 \
    {                                                                               \
        kCLOCK_WAKE_acmp0, kCLOCK_WAKE_acmp1, kCLOCK_WAKE_acmp2, kCLOCK_WAKE_acmp3  \
    }

/*! @brief Clock ip name array for ADC. */
#define LPADC_CLOCKS                                  \
    {                                               \
        kCLOCK_MAIN_hsp_adc0, kCLOCK_MAIN_hsp_adc1  \
    }

/*! @brief Clock ip name array for SRAMC. */
#define SRAMC_CLOCKS        \
    {                       \
        kCLOCK_MAIN_sramc   \
    }

/*! @brief Clock ip name array for ASRC. */
#define ASRC_CLOCKS         \
    {                       \
        kCLOCK_AUDIO_asrc   \
    }

/*! @brief Clock ip name array for AXBS. */
#define AXBS_CLOCKS         \
    {                       \
        MAIN_AXBS_BASE      \
    }

/*! @brief Clock ip name array for FLEXCAN. */
#define FLEXCAN_CLOCKS                                                      \
    {                                                                       \
        kCLOCK_MAIN_hsp_can0, kCLOCK_MAIN_hsp_can1, kCLOCK_MAIN_hsp_can2    \
    }

/*! @brief Clock ip name array for CCM. */
#define CCM_CLOCKS                                                                                  \
    {                                                                                               \
        AUDIO_CCM_BASE, CMPT_CCM_BASE, COMM_CCM_BASE, MAIN_CCM_BASE, MEDIA_CCM_BASE, WAKE_CCM_BASE  \
    }

/*! @brief Clock ip name array for CRC. */
#define CRC_CLOCKS          \
    {                       \
        kCLOCK_MAIN_hsp_crc \
    }

/*! @brief Clock ip name array for CSI. */
#define CSI_CLOCKS          \
    {                       \
        kCLOCK_MEDIA_csi    \
    }

/*! @brief Clock ip name array for DCIF. */
#define DCIF_CLOCKS         \
    {                       \
        kCLOCK_MEDIA_dcif   \
    }

/*! @brief Clock ip name array for DSI2_HOST. */
#define DSI2_HOST_CLOCKS    \
    {                       \
        kCLOCK_MEDIA_mipi_dsi   \
    }

/*! @brief Clock ip name array for EDMA, indexed to match EDMA_BASE_PTRS
 * {MAIN__EDMA3, MAIN__EDMA5, AUDIO__EDMA3, WAKE__EDMA3}. Note the crossed
 * MAIN gate naming per RM rev.1 Draft M Table 65 (ch.20.4 System clocks):
 * gate main_edma0 (CGC_ROOT6) clocks MAIN_EDMA5, and gate main_edma1
 * (CGC_ROOT7) clocks MAIN_EDMA3. Verified on silicon: edma3/edma5
 * memory_to_memory examples bus-fault with the gates swapped and pass with
 * this mapping. */
#define EDMA_CLOCKS                                                               \
    {                                                                             \
        kCLOCK_MAIN_edma1, kCLOCK_MAIN_edma0, kCLOCK_AUDIO_edma, kCLOCK_WAKE_edma \
    }

/*! @brief Clock ip name array for ENET. Note the crossed gate naming per RM
 * Table 65 (ch.20.4): gate comm_eth1 (CGC_ROOT2) clocks COMM_ENET, while
 * gate comm_eth0 (CGC_ROOT1) clocks COMM_ENET_QOS. */
#define ENET_CLOCKS      \
    {                    \
        kCLOCK_COMM_eth1 \
    }

/*! @brief Clock ip name array for ENETQOS. Gate comm_eth0 (CGC_ROOT1)
 * clocks COMM_ENET_QOS per RM Table 65 -- see ENET_CLOCKS note. */
#define ENETQOS_CLOCKS   \
    {                    \
        kCLOCK_COMM_eth0 \
    }

