zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
/*! @brief Clock ip name array for QDC. */
#define QDC_CLOCKS                                                                                 \
    {                                                                                              \
        kCLOCK_MAIN_hsp_qdc0, kCLOCK_MAIN_hsp_qdc1, kCLOCK_MAIN_hsp_qdc2, kCLOCK_MAIN_hsp_qdc3 \
    }

/*! @brief Clock ip name array for EWM. */
#define EWM_CLOCKS      \
    {                   \
        kCLOCK_Ewm0 \
    }

/*! @brief Clock ip name array for FLEXIO. */
#define FLEXIO_CLOCKS                                                             \
    {                                                                             \
        kCLOCK_MAIN_hsp_flexio0, kCLOCK_MAIN_hsp_flexio1, kCLOCK_MAIN_hsp_flexio2 \
    }

/*! @brief Clock ip name array for FLEXSPI. */
#define FLEXSPI_SLV_CLOCKS \
    {                      \
        kCLOCK_COMM_xspir  \
    }

/*! @brief Clock ip name array for FREQME. */
#define FREQME_CLOCKS                                                                                                                                  \
    {                                                                                                                                                  \
        kCLOCK_AUDIO_freqme, kCLOCK_CMPT_freqme, kCLOCK_COMM_freqme, kCLOCK_MAIN_freqme, kCLOCK_MEDIA_freqme, kCLOCK_SYSCON_freqme, kCLOCK_WAKE_freqme \
    }

#define INPUTMUX_CLOCKS                                                                                                                                \
    {                                                                                                                                                  \
        kCLOCK_AUDIO_freqme, kCLOCK_CMPT_freqme, kCLOCK_COMM_freqme, kCLOCK_MAIN_freqme, kCLOCK_MEDIA_freqme, kCLOCK_SYSCON_freqme, kCLOCK_WAKE_freqme \
    }

/*! @brief Clock ip name array for GPIO, indexed to match GPIO_BASE_PTRS
 * {HSP__GPIO_0..4, VBAT__GPIO, WAKE__GPIO} (7 entries). VBAT__GPIO has no
 * LPCG (clocked directly from wake_clk per RM Table 65), so its slot is
 * kCLOCK_IpInvalid. */
#define GPIO_CLOCKS                                                                                                    \
    {                                                                                                                  \
        kCLOCK_MAIN_hsp_rgpio0, kCLOCK_MAIN_hsp_rgpio1, kCLOCK_MAIN_hsp_rgpio2, kCLOCK_MAIN_hsp_rgpio3,               \
        kCLOCK_MAIN_hsp_rgpio4, kCLOCK_IpInvalid, kCLOCK_WAKE_rgpio0                                                   \
    }

/*! @brief Clock ip name array for SAI. */
#define SAI_CLOCKS                                              \
    {                                                           \
        kCLOCK_AUDIO_sai0, kCLOCK_AUDIO_sai1, kCLOCK_AUDIO_sai2 \
    }

/*! @brief Clock ip name array for I3C. */
#define I3C_CLOCKS                             \
    {                                          \
        kCLOCK_MAIN_hsp_i3c0, kCLOCK_WAKE_i3c0 \
    }

/*! @brief Clock ip name array for ISI. */
#define ISI_CLOCKS       \
    {                    \
        kCLOCK_MEDIA_isi \
    }

/*! @brief Clock ip name array for JPEGDEC. */
#define JPEGDEC_CLOCKS            \
    {                             \
        kCLOCK_MEDIA_jpeg_decoder \
    }

/*! @brief Clock ip name array for LLC. */
#define LLC_CLOCKS      \
    {                   \
        kCLOCK_CMPT_llc \
    }

/*! @brief Clock ip name array for DAC. */
#define LPDAC_CLOCKS          \
    {                       \
        kCLOCK_MAIN_hsp_dac \
    }

/*! @brief Clock ip name array for LPI2C. */
#define LPI2C_CLOCKS                                                                           \
    {                                                                                          \
        kCLOCK_MAIN_hsp_lpi2c0, kCLOCK_MAIN_hsp_lpi2c1, kCLOCK_WAKE_lpi2c0, kCLOCK_WAKE_lpi2c1 \
    }

/*! @brief Clock ip name array for LPIT. */
#define LPIT_CLOCKS                                  \
    {                                                \
        kCLOCK_MAIN_hsp_lpit0, kCLOCK_MAIN_hsp_lpit1 \
    }

/*! @brief Clock ip name array for LPSPI. */
#define LPSPI_CLOCKS                                                                                                                              \
    {                                                                                                                                             \
        kCLOCK_MAIN_hsp_lpspi0, kCLOCK_MAIN_hsp_lpspi1, kCLOCK_MAIN_hsp_lpspi2, kCLOCK_MAIN_hsp_lpspi3, kCLOCK_MAIN_hsp_lpspi4, kCLOCK_WAKE_lpspi \
    }

/*! @brief Clock ip name array for LPTMR. */
#define LPTMR_CLOCKS                                                 \
    {                                                                \
        kCLOCK_IpInvalid, kCLOCK_WAKE_lptimer0, kCLOCK_WAKE_lptimer1 \
    }

/*! @brief Clock ip name array for LPUART. */
#define LPUART_CLOCKS                                                                                                                                                                                                    \
    {                                                                                                                                                                                                                    \
        kCLOCK_MAIN_hsp_lpuart0, kCLOCK_MAIN_hsp_lpuart1, kCLOCK_MAIN_hsp_lpuart2, kCLOCK_MAIN_hsp_lpuart3, kCLOCK_MAIN_hsp_lpuart4, kCLOCK_MAIN_hsp_lpuart5, kCLOCK_WAKE_lpuart0, kCLOCK_WAKE_lpuart1 \
    }

/*! @brief Clock ip name array for MMU. */
#define MMU_CLOCKS       \
    {                    \
        kCLOCK_MAIN_mmu0 \
    }

/*! @brief Clock ip name array for MODCON. */
#define MODCON_CLOCKS                                                                                                            \
    {                                                                                                                            \
        kCLOCK_AUDIO_modcon, kCLOCK_CMPT_modcon, kCLOCK_COMM_modcon, kCLOCK_MAIN_modcon, kCLOCK_MEDIA_modcon, kCLOCK_WAKE_modcon \
    }

/*! @brief Clock ip name array for NIC. */
#define NIC_CLOCKS                                                                               \
    {                                                                                            \
        kCLOCK_CMPT_nic_gpv, kCLOCK_COMM_nic_gpv, kCLOCK_MAIN_nic_main_gpv, kCLOCK_MEDIA_nic_gpv \
    }

