zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
/*! @brief Clock ip name array for NPU. */
#define NPU_CORE_CLOCKS \
    { \
        kCLOCK_CMPT_npu_core \
    }

/*! @brief Clock ip name array for NPU. */
#define NPU_MEM_CLOCKS      \
    {                       \
        kCLOCK_CMPT_npu_mem \
    } 

/*! @brief Clock ip name array for PDCON. */
#define PDCON_CLOCKS             \
    {                            \
        kCLOCK_WAKE_syscon_pdcon \
    }

/*! @brief Clock ip name array for PDM. */
#define PDM_CLOCKS                              \
    {                                           \
        kCLOCK_AUDIO_micfil, kCLOCK_WAKE_micfil \
    }

/*! @brief Clock ip name array for PMU. */
#define PMU_CLOCKS             \
    {                          \
        kCLOCK_WAKE_syscon_pmu \
    }

/*! @brief Clock ip name array for PWM. */
#define PWM_CLOCKS                                                                                                \
    {                                                                                                             \
        {kCLOCK_MAIN_hsp_flexpwm0, kCLOCK_MAIN_hsp_flexpwm0, kCLOCK_MAIN_hsp_flexpwm0, kCLOCK_MAIN_hsp_flexpwm0}, \
        {kCLOCK_MAIN_hsp_flexpwm1, kCLOCK_MAIN_hsp_flexpwm1, kCLOCK_MAIN_hsp_flexpwm1, kCLOCK_MAIN_hsp_flexpwm1}, \
        {kCLOCK_MAIN_hsp_flexpwm2, kCLOCK_MAIN_hsp_flexpwm2, kCLOCK_MAIN_hsp_flexpwm2, kCLOCK_MAIN_hsp_flexpwm2}, \
        {kCLOCK_MAIN_hsp_flexpwm3, kCLOCK_MAIN_hsp_flexpwm3, kCLOCK_MAIN_hsp_flexpwm3, kCLOCK_MAIN_hsp_flexpwm3}  \
    }

/*! @brief Clock ip name array for REFORMATTER. */
#define REFORMATTER_CLOCKS       \
    {                            \
        kCLOCK_MEDIA_reformatter \
    }

/*! @brief Clock ip name array for RESETCON. */
#define RESETCON_CLOCKS             \
    {                               \
        kCLOCK_WAKE_syscon_resetcon \
    }

/*! @brief Clock ip name array for ROMCP. */
#define ROMCP_CLOCKS      \
    {                     \
        kCLOCK_CMPT_romcp \
    }

/*! @brief Clock ip name array for RTC. */
#define RTC_CLOCKS              \
    {                           \
        kCLOCK_WAKE_vbat_rtc_hp \
    }

/*! @brief Clock ip name array for SINC. */
#define SINC_CLOCKS                                  \
    {                                                \
        kCLOCK_MAIN_hsp_sinc0, kCLOCK_MAIN_hsp_sinc1 \
    }

/*! @brief Clock ip name array for SPDIF. */
#define SPDIF_CLOCKS            \
    {                           \
        kCLOCK_AUDIO_spdif_xcvr \
    }

/*! @brief Clock ip name array for SRAM. */
#define SRAM_CTRL_CLOCKS                                                       \
    {                                                                          \
        kCLOCK_CMPT_sram_ctrl0, kCLOCK_CMPT_sram_ctrl1, kCLOCK_CMPT_sram_ctrl2 \
    }

/*! @brief Clock ip name array for STM. */
#define STM_CLOCKS          \
    {                       \
        kCLOCK_MAIN_hsp_stm \
    }

/*! @brief Clock ip name array for SWT. */
#define SWT_CLOCKS                         \
    {                                      \
        kCLOCK_WAKE_swt0, kCLOCK_WAKE_swt1 \
    }

/*! @brief Clock ip name array for TENBASET. */
#define TENBASET_PHY_CLOCKS                        \
    {                                              \
        kCLOCK_COMM_xenophy0, kCLOCK_COMM_xenophy1 \
    }

/*! @brief Clock ip name array for TINGPU. */
#define TINGPU_CLOCKS    \
    {                    \
        kCLOCK_MEDIA_gpu \
    }

/*! @brief Clock ip name array for TMR. */
#define TMR_CLOCKS                                                                                         \
    {                                                                                                      \
        kCLOCK_MAIN_hsp_qtimer0, kCLOCK_MAIN_hsp_qtimer1, kCLOCK_MAIN_hsp_qtimer2, kCLOCK_MAIN_hsp_qtimer3 \
    }

/*! @brief Clock ip name array for TPM. */
#define TPM_CLOCKS                                                                                                                                                          \
    {                                                                                                                                                                       \
        kCLOCK_MAIN_hsp_qtpm0, kCLOCK_MAIN_hsp_qtpm0, kCLOCK_MAIN_hsp_qtpm0, kCLOCK_MAIN_hsp_qtpm0, kCLOCK_WAKE_qtpm, kCLOCK_WAKE_qtpm , kCLOCK_WAKE_qtpm, kCLOCK_WAKE_qtpm \
    }

/*! @brief Clock ip name array for TRDC. */
#define TRDC_CLOCKS                                                                                \
    {                                                                                              \
        kCLOCK_AUDIO_trdc, kCLOCK_COMM_trdc, kCLOCK_MAIN_trdc, kCLOCK_MEDIA_trdc, kCLOCK_WAKE_trdc \
    }

/*! @brief Clock ip name array for CMPT. */
#define CMPT_TRDC_CLOCKS \
    {                    \
        kCLOCK_CMPT_trdc \
    }

/*! @brief Clock ip name array for TRGSYNC. */
#define TRGSYNC_CLOCKS                                                                \
    {                                                                                 \
        kCLOCK_MAIN_hsp_trig_sync0, kCLOCK_MAIN_hsp_trig_sync1, kCLOCK_WAKE_trig_sync \
    }

/*! @brief Clock ip name array for USB. */
#define USB_CLOCKS                         \
    {                                      \
        kCLOCK_COMM_usb0, kCLOCK_COMM_usb1 \
    }

/*! @brief Clock ip name array for USDHC. */
#define USDHC_CLOCKS                           \
    {                                          \
        kCLOCK_COMM_usdhc0, kCLOCK_COMM_usdhc1 \
    }

/*! @brief Clock ip name array for XBARs. */
#define XBAR_CLOCKS             \
    {                           \
        kCLOCK_IpInvalid,       \
        kCLOCK_AUDIO_xbar0,     \
        kCLOCK_MAIN_hsp_xbar0,  \
        kCLOCK_MAIN_hsp_xbar1,  \
        kCLOCK_MAIN_hsp_xbar2,  \
        kCLOCK_WAKE_xbar0       \
    }

/*! @brief Clock ip name array for XSPI. */
#define XSPI_CLOCKS                          \
    {                                        \
        kCLOCK_MAIN_xspi0, kCLOCK_MAIN_xspi1 \
    }

