zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
/*!
 * @brief Clock LPCG index
 */
typedef enum _clock_lpcg {
  // Clock LPCG for SYSCON SS [0]
  kCLOCK_SYSCON_START                          = 0,
  kCLOCK_SYSCON_freqme                         = 0,   /*!< Clock LPCG SYSCON SS 0 syscon_freqme       */
  kCLOCK_SYSCON_END                            = 0,
  // Clock LPCG for Cmpt Subsystem [16..29]
  kCLOCK_CMPT_START                            = 16,
  kCLOCK_CMPT_romcp                            = 16,  /*!< Clock LPCG Cmpt SS index 0  cmpt_romcp     */
  kCLOCK_CMPT_cm85_clkin                       = 17,  /*!< Clock LPCG Cmpt SS index 1  cm85_clkin     */
  kCLOCK_CMPT_cm85_dbgclk                      = 18,  /*!< Clock LPCG Cmpt SS index 2  cm85_dbgclk    */
  kCLOCK_CMPT_cm85_iwic                        = 19,  /*!< Clock LPCG Cmpt SS index 3  cm85_iwic      */
  kCLOCK_CMPT_npu_core                         = 20,  /*!< Clock LPCG Cmpt SS index 4  npu_core       */
  kCLOCK_CMPT_npu_mem                          = 21,  /*!< Clock LPCG Cmpt SS index 5  npu_mem        */
  kCLOCK_CMPT_freqme                           = 22,  /*!< Clock LPCG Cmpt SS index 6  cmpt_freqme    */
  kCLOCK_CMPT_modcon                           = 23,  /*!< Clock LPCG Cmpt SS index 7  cmpt_modcon    */
  kCLOCK_CMPT_trdc                             = 24,  /*!< Clock LPCG Cmpt SS index 8  cmpt_trdc      */
  kCLOCK_CMPT_sram_ctrl0                       = 25,  /*!< Clock LPCG Cmpt SS index 9  cmpt_sram_ctrl0*/
  kCLOCK_CMPT_sram_ctrl1                       = 26,  /*!< Clock LPCG Cmpt SS index 10 cmpt_sram_ctrl1*/
  kCLOCK_CMPT_sram_ctrl2                       = 27,  /*!< Clock LPCG Cmpt SS index 11 cmpt_sram_ctrl2*/
  kCLOCK_CMPT_nic_gpv                          = 28,  /*!< Clock LPCG Cmpt SS index 12 cmpt_nic_gpv   */
  kCLOCK_CMPT_llc                              = 29,  /*!< Clock LPCG Cmpt SS index 13 cmpt_llc       */
  kCLOCK_CMPT_END                              = 29,
  // Clock LPCG for Main Subsystem [32..106]
  kCLOCK_MAIN_START                            = 32,
  kCLOCK_MAIN_trace_rt2660                     = 32,  /*!< Clock LPCG Main SS index 0  trace_rt2660   */
  kCLOCK_MAIN_tsclk                            = 33,  /*!< Clock LPCG Main SS index 1 tsclk           */
  kCLOCK_MAIN_tpiu_traceclkin                  = 34,  /*!< Clock LPCG Main SS index 2 tpiu_traceclkin */
  kCLOCK_MAIN_swo_traceclkin                   = 35,  /*!< Clock LPCG Main SS index 3  swo_traceclkin */
  kCLOCK_MAIN_xspi0                            = 36, /*!< Clock LPCG Main SS index 4 xspi0           */
  kCLOCK_MAIN_xspi1                            = 37, /*!< Clock LPCG Main SS index 5 xspi1           */
  kCLOCK_MAIN_edma0                            = 38, /*!< Clock LPCG Main SS index 6 edma0           */
  kCLOCK_MAIN_edma1                            = 39, /*!< Clock LPCG Main SS index 7 edma1           */
  kCLOCK_MAIN_freqme                           = 40, /*!< Clock LPCG Main SS index 8 freqme          */
  kCLOCK_MAIN_modcon                           = 41, /*!< Clock LPCG Main SS index 9 modcon          */
  kCLOCK_MAIN_hsp_crc                          = 42, /*!< Clock LPCG Main SS index 10 hsp_crc        */
  kCLOCK_MAIN_hsp_dac                          = 43, /*!< Clock LPCG Main SS index 11 hsp_dac        */
  kCLOCK_MAIN_hsp_adc0                         = 44, /*!< Clock LPCG Main SS index 12 hsp_adc0       */
  kCLOCK_MAIN_hsp_adc1                         = 45, /*!< Clock LPCG Main SS index 13 hsp_adc1       */
  kCLOCK_MAIN_hsp_evtg0                        = 46, /*!< Clock LPCG Main SS index 14 hsp_evtg0      */
  kCLOCK_MAIN_hsp_evtg1                        = 47, /*!< Clock LPCG Main SS index 15 hsp_evtg1      */
  kCLOCK_MAIN_hsp_evtg2                        = 48, /*!< Clock LPCG Main SS index 16 hsp_evtg2      */
  kCLOCK_MAIN_hsp_evtg3                        = 49, /*!< Clock LPCG Main SS index 17 hsp_evtg3      */
  kCLOCK_MAIN_hsp_xbar0                        = 50, /*!< Clock LPCG Main SS index 18 hsp_xbar0      */
  kCLOCK_MAIN_hsp_xbar1                        = 51, /*!< Clock LPCG Main SS index 19 hsp_xbar1      */
  kCLOCK_MAIN_hsp_xbar2                        = 52, /*!< Clock LPCG Main SS index 20 hsp_xbar2      */
  kCLOCK_MAIN_sramc                            = 53, /*!< Clock LPCG Main SS index 21 sramc          */
  kCLOCK_MAIN_trdc                             = 54, /*!< Clock LPCG Main SS index 22 trdc           */
  kCLOCK_MAIN_hsp_lpspi0                       = 55, /*!< Clock LPCG Main SS index 23 hsp_lpspi0     */
  kCLOCK_MAIN_hsp_lpspi1                       = 56, /*!< Clock LPCG Main SS index 24 hsp_lpspi1     */
  kCLOCK_MAIN_hsp_lpspi2                       = 57, /*!< Clock LPCG Main SS index 25 hsp_lpspi2     */
  kCLOCK_MAIN_hsp_lpspi3                       = 58, /*!< Clock LPCG Main SS index 26 hsp_lpspi3     */
  kCLOCK_MAIN_hsp_lpspi4                       = 59, /*!< Clock LPCG Main SS index 27 hsp_lpspi4     */
  kCLOCK_MAIN_hsp_lpi2c0                       = 60, /*!< Clock LPCG Main SS index 28 hsp_lpi2c0     */
  kCLOCK_MAIN_hsp_lpi2c1                       = 61, /*!< Clock LPCG Main SS index 29 hsp_lpi2c1     */
  kCLOCK_MAIN_hsp_lpuart0                      = 62, /*!< Clock LPCG Main SS index 30 hsp_lpuart0    */
  kCLOCK_MAIN_hsp_lpuart1                      = 63, /*!< Clock LPCG Main SS index 31 hsp_lpuart1    */
  kCLOCK_MAIN_hsp_lpuart2                      = 64, /*!< Clock LPCG Main SS index 32 hsp_lpuart2    */
  kCLOCK_MAIN_hsp_lpuart3                      = 65, /*!< Clock LPCG Main SS index 33 hsp_lpuart3    */
  kCLOCK_MAIN_hsp_lpuart4                      = 66, /*!< Clock LPCG Main SS index 34 hsp_lpuart4    */
  kCLOCK_MAIN_hsp_lpuart5                      = 67, /*!< Clock LPCG Main SS index 35 hsp_lpuart5    */
  kCLOCK_MAIN_hsp_flexpwm0                     = 68, /*!< Clock LPCG Main SS index 36 hsp_flexpwm0   */
  kCLOCK_MAIN_hsp_flexpwm1                     = 69, /*!< Clock LPCG Main SS index 37 hsp_flexpwm1   */
  kCLOCK_MAIN_hsp_flexpwm2                     = 70, /*!< Clock LPCG Main SS index 38 hsp_flexpwm2   */
  kCLOCK_MAIN_hsp_flexpwm3                     = 71, /*!< Clock LPCG Main SS index 39 hsp_flexpwm3   */
  kCLOCK_MAIN_hsp_lpit0                        = 72, /*!< Clock LPCG Main SS index 40 hsp_lpit0      */
  kCLOCK_MAIN_hsp_lpit1                        = 73, /*!< Clock LPCG Main SS index 41 hsp_lpit1      */
  kCLOCK_MAIN_hsp_qtpm0                        = 74, /*!< Clock LPCG Main SS index 42 hsp_qtpm0      */
  kCLOCK_MAIN_hsp_qtimer0                      = 75, /*!< Clock LPCG Main SS index 43 hsp_qtimer0    */
  kCLOCK_MAIN_hsp_qtimer1                      = 76, /*!< Clock LPCG Main SS index 44 hsp_qtimer1    */
  kCLOCK_MAIN_hsp_qtimer2                      = 77, /*!< Clock LPCG Main SS index 45 hsp_qtimer2    */
  kCLOCK_MAIN_hsp_qtimer3                      = 78, /*!< Clock LPCG Main SS index 46 hsp_qtimer3    */
  kCLOCK_MAIN_hsp_can0                         = 79, /*!< Clock LPCG Main SS index 47 hsp_can0       */
  kCLOCK_MAIN_hsp_can1                         = 80, /*!< Clock LPCG Main SS index 48 hsp_can1       */
  kCLOCK_MAIN_hsp_can2                         = 81, /*!< Clock LPCG Main SS index 49 hsp_can2       */
  kCLOCK_MAIN_hsp_qdc0                         = 82, /*!< Clock LPCG Main SS index 50 hsp_qdc0       */
  kCLOCK_MAIN_hsp_qdc1                         = 83, /*!< Clock LPCG Main SS index 51 hsp_qdc1       */
  kCLOCK_MAIN_hsp_qdc2                         = 84, /*!< Clock LPCG Main SS index 52 hsp_qdc2       */
  kCLOCK_MAIN_hsp_qdc3                         = 85, /*!< Clock LPCG Main SS index 53 hsp_qdc3       */
  kCLOCK_MAIN_hsp_rgpio0                       = 86, /*!< Clock LPCG Main SS index 54 hsp_rgpio0     */
  kCLOCK_MAIN_hsp_rgpio1                       = 87, /*!< Clock LPCG Main SS index 55 hsp_rgpio1     */
  kCLOCK_MAIN_hsp_rgpio2                       = 88, /*!< Clock LPCG Main SS index 56 hsp_rgpio2     */
  kCLOCK_MAIN_hsp_rgpio3                       = 89, /*!< Clock LPCG Main SS index 57 hsp_rgpio3     */
  kCLOCK_MAIN_hsp_rgpio4                       = 90, /*!< Clock LPCG Main SS index 58 hsp_rgpio4     */
  kCLOCK_MAIN_hsp_i3c0                         = 91, /*!< Clock LPCG Main SS index 59 hsp_i3c0       */
  kCLOCK_MAIN_hsp_flexio0                      = 92, /*!< Clock LPCG Main SS index 60 hsp_flexio0    */
  kCLOCK_MAIN_hsp_flexio1                      = 93, /*!< Clock LPCG Main SS index 61 hsp_flexio1    */
  kCLOCK_MAIN_hsp_flexio2                      = 94, /*!< Clock LPCG Main SS index 62 hsp_flexio2    */
  kCLOCK_MAIN_hsp_sinc0                        = 95, /*!< Clock LPCG Main SS index 63 hsp_sinc0      */
  kCLOCK_MAIN_hsp_sinc1                        = 96, /*!< Clock LPCG Main SS index 64 hsp_sinc1      */
  kCLOCK_MAIN_mtr_master                       = 97,  /*!< Clock LPCG Main SS index 65 mtr_master     */
  kCLOCK_MAIN_iomuxc                           = 98,  /*!< Clock LPCG Main SS index 66 main_iomuxc    */
  kCLOCK_MAIN_hsp_trig_sync0                   = 99,  /*!< Clock LPCG Main SS index 67 hsp_trig_sync0 */
  kCLOCK_MAIN_hsp_trig_sync1                   = 100, /*!< Clock LPCG Main SS index 68 hsp_trig_sync1 */
  kCLOCK_MAIN_hsp_stm                          = 101, /*!< Clock LPCG Main SS index 69 hsp_stm        */
  kCLOCK_MAIN_hsp_nic_main_gpv                 = 102, /*!< Clock LPCG Main SS index 70 hsp_nic_main_gpv*/
  kCLOCK_MAIN_prince0                          = 103, /*!< Clock LPCG Main SS index 71 main_prince0   */
  kCLOCK_MAIN_prince1                          = 104, /*!< Clock LPCG Main SS index 72 main_prince1   */
  kCLOCK_MAIN_cssi                             = 105, /*!< Clock LPCG Main SS index 73 main_cssi      */
  kCLOCK_MAIN_mmu0                             = 106, /*!< Clock LPCG Main SS index 74 main_mmu0      */
  kCLOCK_MAIN_END                              = 106,
  // Clock LPCG for Wake SS [112..144]
  kCLOCK_WAKE_START                            = 112,
  kCLOCK_WAKE_syscon_pmu                       = 112, /*!< Clock LPCG Wake SS index 0 syscon_pmu      */
  kCLOCK_WAKE_dap_rt2660                       = 113, /*!< Clock LPCG Wake SS index 1 dap_rt2660      */
  kCLOCK_WAKE_edma                             = 114, /*!< Clock LPCG Wake SS index 2 edma            */
  kCLOCK_WAKE_freqme                           = 115, /*!< Clock LPCG Wake SS index 3 freqme          */
  kCLOCK_WAKE_modcon                           = 116, /*!< Clock LPCG Wake SS index 4 modcon          */
  kCLOCK_WAKE_xbar0                            = 117, /*!< Clock LPCG Wake SS index 5 xbar0           */
  kCLOCK_WAKE_trdc                             = 118, /*!< Clock LPCG Wake SS index 6 trdc            */
  kCLOCK_WAKE_syscon_resetcon                  = 119, /*!< Clock LPCG Wake SS index 7 syscon_resetcon */
  kCLOCK_WAKE_syscon_pdcon                     = 120, /*!< Clock LPCG Wake SS index 8 syscon_pdcon    */
  kCLOCK_WAKE_syscon_powercon                  = 121, /*!< Clock LPCG Wake SS index 9 syscon_powercon */
  kCLOCK_WAKE_syscon_memcon                    = 122, /*!< Clock LPCG Wake SS index 10 syscon_memcon  */
  kCLOCK_WAKE_micfil                           = 123, /*!< Clock LPCG Wake SS index 11 micfil         */
  kCLOCK_WAKE_lpspi                            = 124, /*!< Clock LPCG Wake SS index 12 lpspi          */
  kCLOCK_WAKE_lpi2c0                           = 125, /*!< Clock LPCG Wake SS index 13 lpi2c0         */
  kCLOCK_WAKE_lpi2c1                           = 126, /*!< Clock LPCG Wake SS index 14 lpi2c1         */
  kCLOCK_WAKE_lpuart0                          = 127, /*!< Clock LPCG Wake SS index 15 lpuart0        */
  kCLOCK_WAKE_lpuart1                          = 128, /*!< Clock LPCG Wake SS index 16 lpuart1        */
  kCLOCK_WAKE_acmp0                            = 129, /*!< Clock LPCG Wake SS index 17 acmp0          */
  kCLOCK_WAKE_acmp1                            = 130, /*!< Clock LPCG Wake SS index 18 acmp1          */
  kCLOCK_WAKE_acmp2                            = 131, /*!< Clock LPCG Wake SS index 19 acmp2          */
  kCLOCK_WAKE_acmp3                            = 132, /*!< Clock LPCG Wake SS index 20 acmp3          */
  kCLOCK_WAKE_swt0                             = 133, /*!< Clock LPCG Wake SS index 21 swt0           */
  kCLOCK_WAKE_swt1                             = 134, /*!< Clock LPCG Wake SS index 22 swt1           */
  kCLOCK_WAKE_lptimer0                         = 135, /*!< Clock LPCG Wake SS index 23 lptimer0       */
  kCLOCK_WAKE_lptimer1                         = 136, /*!< Clock LPCG Wake SS index 24 lptimer1       */
  kCLOCK_WAKE_qtpm                             = 137, /*!< Clock LPCG Wake SS index 25 qtpm           */
  kCLOCK_WAKE_ewm                              = 138, /*!< Clock LPCG Wake SS index 26 ewm            */
  kCLOCK_WAKE_rgpio0                           = 139, /*!< Clock LPCG Wake SS index 27 rgpio0         */
  kCLOCK_WAKE_i3c0                             = 140, /*!< Clock LPCG Wake SS index 28 i3c0           */
  kCLOCK_WAKE_ram_ctrl                         = 141, /*!< Clock LPCG Wake SS index 29 ram_ctrl       */
  kCLOCK_WAKE_iomuxc                           = 142, /*!< Clock LPCG Wake SS index 30 iomuxc         */
  kCLOCK_WAKE_vbat_rtc_hp                      = 143, /*!< Clock LPCG Wake SS index 31 vbat_rtc_hp    */
  kCLOCK_WAKE_trig_sync                        = 144, /*!< Clock LPCG Wake SS index 32 trig_sync      */
  kCLOCK_WAKE_END                              = 144,
  // Clock LPCG for Comm Subsystem [160..172]
  kCLOCK_COMM_START                            = 160,
  kCLOCK_COMM_xspir                            = 160,  /*!< Clock LPCG Comm SS index 0 xspir           */
  kCLOCK_COMM_eth0                             = 161,  /*!< Clock LPCG Comm SS index 1 eth0            */
  kCLOCK_COMM_eth1                             = 162,  /*!< Clock LPCG Comm SS index 2 eth1            */
  kCLOCK_COMM_usdhc0                           = 163,  /*!< Clock LPCG Comm SS index 3 usdhc0          */
  kCLOCK_COMM_usdhc1                           = 164,  /*!< Clock LPCG Comm SS index 4 usdhc1          */
  kCLOCK_COMM_usb0                             = 165,  /*!< Clock LPCG Comm SS index 5 usb0            */
  kCLOCK_COMM_usb1                             = 166,  /*!< Clock LPCG Comm SS index 6 usb1            */
  kCLOCK_COMM_xenophy0                         = 167,  /*!< Clock LPCG Comm SS index 7 xenophy0        */
  kCLOCK_COMM_xenophy1                         = 168,  /*!< Clock LPCG Comm SS index 8 xenophy1        */
  kCLOCK_COMM_freqme                           = 169,  /*!< Clock LPCG Comm SS index 9 freqme          */
  kCLOCK_COMM_modcon                           = 170,  /*!< Clock LPCG Comm SS index 10 modcon         */
  kCLOCK_COMM_trdc                             = 171,  /*!< Clock LPCG Comm SS index 11 trdc           */
  kCLOCK_COMM_nic_gpv                          = 172,  /*!< Clock LPCG Comm SS index 12 nic_gpv        */
  kCLOCK_COMM_END                              = 172,
  // Clock LPCG for Audio Subsystem [176..188]
  kCLOCK_AUDIO_START                           = 176,
  kCLOCK_AUDIO_edma                            = 176,  /*!< Clock LPCG Audio SS index 0 edma           */
  kCLOCK_AUDIO_freqme                          = 177,  /*!< Clock LPCG Audio SS index 1 freqme         */
  kCLOCK_AUDIO_modcon                          = 178,  /*!< Clock LPCG Audio SS index 2 modcon         */
  kCLOCK_AUDIO_xbar0                           = 179,  /*!< Clock LPCG Audio SS index 3 xbar0          */
  kCLOCK_AUDIO_trdc                            = 180,  /*!< Clock LPCG Audio SS index 4 trdc           */
  kCLOCK_AUDIO_sai0                            = 181,  /*!< Clock LPCG Audio SS index 5 sai0           */
  kCLOCK_AUDIO_sai1                            = 182,  /*!< Clock LPCG Audio SS index 6 sai1           */
  kCLOCK_AUDIO_sai2                            = 183,  /*!< Clock LPCG Audio SS index 7 sai2           */
  kCLOCK_AUDIO_micfil                          = 184,  /*!< Clock LPCG Audio SS index 8 micfil         */
  kCLOCK_AUDIO_asrc                            = 185,  /*!< Clock LPCG Audio SS index 9 asrc           */
  kCLOCK_AUDIO_spdif_xcvr                      = 186,  /*!< Clock LPCG Audio SS index 10 spdif_xcvr    */
  kCLOCK_AUDIO_mqs                             = 187,  /*!< Clock LPCG Audio SS index 11 mqs           */
  kCLOCK_AUDIO_ram_ctrl                        = 188,  /*!< Clock LPCG Audio SS index 12 ram_ctrl      */
  kCLOCK_AUDIO_END                             = 188,
  // Clock LPCG for Media Subsystem [192..203]
  kCLOCK_MEDIA_START                           = 192,
  kCLOCK_MEDIA_jpeg_decoder                    = 192, /*!< Clock LPCG Media SS index 0 jpeg_decoder   */
  kCLOCK_MEDIA_isi                             = 193, /*!< Clock LPCG Media SS index 1 isi            */
  kCLOCK_MEDIA_reformatter                     = 194, /*!< Clock LPCG Media SS index 2 reformatter    */
  kCLOCK_MEDIA_csi                             = 195, /*!< Clock LPCG Media SS index 3 csi            */
  kCLOCK_MEDIA_mipi_csi                        = 196, /*!< Clock LPCG Media SS index 4 mipi_csi       */
  kCLOCK_MEDIA_gpu                             = 197, /*!< Clock LPCG Media SS index 5 gpu            */
  kCLOCK_MEDIA_dcif                            = 198, /*!< Clock LPCG Media SS index 6 dcif           */
  kCLOCK_MEDIA_mipi_dsi                        = 199, /*!< Clock LPCG Media SS index 7 mipi_dsi       */
  kCLOCK_MEDIA_freqme                          = 200, /*!< Clock LPCG Media SS index 8 freqme         */
  kCLOCK_MEDIA_modcon                          = 201, /*!< Clock LPCG Media SS index 9 modcon         */
  kCLOCK_MEDIA_trdc                            = 202, /*!< Clock LPCG Media SS index 10 trdc          */
  kCLOCK_MEDIA_nic_gpv                         = 203, /*!< Clock LPCG Media SS index 11 nic_gpv       */
  kCLOCK_MEDIA_END                             = 203,
  // Clock LPCG for NA Nodes
  kCLOCK_IpInvalid, /*!< Invalid value. */
} clock_lpcg_t;

