zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
#define kCLOCK_Ewm0     kCLOCK_WAKE_ewm

/*!
 * @brief Root clock index
 *
 */
typedef enum _clock_root {
  // Clock Root for CGU SS
  kCLOCK_Root_CGU_START                    = 0,
  kCLOCK_Root_CGU_SXOSC_ROOTCLK            = 0,   /*!< Clock Root CGU SS index 0 SXOSC_ROOTCLK */
  kCLOCK_Root_CGU_BASE_CLK                 = 1,   /*!< Clock Root CGU SS index 1 BASE_CLK */
  kCLOCK_Root_CGU_LOW_CLK                  = 2,   /*!< Clock Root CGU SS index 2 LOW_CLK */
  kCLOCK_Root_CGU_MAINPLL_DIVX             = 3,   /*!< Clock Root CGU SS index 3 MAINPLL_DIVX */
  kCLOCK_Root_CGU_SYSPLL_DIVX              = 4,   /*!< Clock Root CGU SS index 4 SYSPLL_DIVX */
  kCLOCK_Root_CGU_PLL_PFDX                 = 5,   /*!< Clock Root CGU SS index 5 PLL_PFDX */
  kCLOCK_Root_CGU_MEDIA_PFDX               = 6,   /*!< Clock Root CGU SS index 6 MEDIA_PFDX */
  kCLOCK_Root_CGU_MAINPFDX_ROOTCLK         = 7,   /*!< Clock Root CGU SS index 7 MAINPFDX_ROOTCLK */
  kCLOCK_Root_CGU_COMMPFDX_ROOTCLK         = 8,   /*!< Clock Root CGU SS index 8 COMMPFDX_ROOTCLK */
  kCLOCK_Root_CGU_MAINDIVX_ROOTCLK         = 9,   /*!< Clock Root CGU SS index 9 MAINDIVX_ROOTCLK */
  kCLOCK_Root_CGU_SAIMCLK_ROOTCLK          = 10,  /*!< Clock Root CGU SS index 10 SAIMCLK_ROOTCLK */
  kCLOCK_Root_CGU_SAIMCLK0_ROOTCLK         = 11,  /*!< Clock Root CGU SS index 11 SAIMCLK0_ROOTCLK */
  kCLOCK_Root_CGU_SAIMCLK1_ROOTCLK         = 12,  /*!< Clock Root CGU SS index 12 SAIMCLK1_ROOTCLK */
  kCLOCK_Root_CGU_SAIMCLK2_ROOTCLK         = 13,  /*!< Clock Root CGU SS index 13 SAIMCLK2_ROOTCLK */
  kCLOCK_Root_CGU_LP12M_CORE_ROOTCLK       = 14,  /*!< Clock Root CGU SS index 14 LP12M_CORE_ROOTCLK */
  kCLOCK_Root_CGU_LP1M_CORE_ROOTCLK        = 15,  /*!< Clock Root CGU SS index 15 LP1M_CORE_ROOTCLK */
  kCLOCK_Root_CGU_ULP32K_ROOTCLK           = 16,  /*!< Clock Root CGU SS index 16 ULP32K_ROOTCLK */
  kCLOCK_Root_CGU_FRO192M_ROOTCLK          = 17,  /*!< Clock Root CGU SS index 17 FRO192M_ROOTCLK */
  kCLOCK_Root_CGU_FRO96M_ROOTCLK           = 18,  /*!< Clock Root CGU SS index 18 FRO96M_ROOTCLK */
  kCLOCK_Root_CGU_FRO48M_ROOTCLK           = 19,  /*!< Clock Root CGU SS index 19 FRO48M_ROOTCLK */
  kCLOCK_Root_CGU_FRO24M_ROOTCLK           = 20,  /*!< Clock Root CGU SS index 20 FRO24M_ROOTCLK */
  kCLOCK_Root_CGU_SYSPLLDIV4_ROOTCLK       = 21,  /*!< Clock Root CGU SS index 21 SYSPLLDIV4_ROOTCLK */
  kCLOCK_Root_CGU_SYSPLLDIV5_ROOTCLK       = 22,  /*!< Clock Root CGU SS index 22 SYSPLLDIV5_ROOTCLK */
  kCLOCK_Root_CGU_SYSPLLDIVX_ROOTCLK       = 23,  /*!< Clock Root CGU SS index 23 SYSPLLDIVX_ROOTCLK */
  kCLOCK_Root_CGU_MAINPLLDIVX_ROOTCLK      = 24,  /*!< Clock Root CGU SS index 24 MAINPLLDIVX_ROOTCLK */
  kCLOCK_Root_CGU_MAINPLLDIV8_ROOTCLK      = 25,  /*!< Clock Root CGU SS index 25 MAINPLLDIV8_ROOTCLK */
  kCLOCK_Root_CGU_MAINPLLDIV10_ROOTCLK     = 26,  /*!< Clock Root CGU SS index 26 MAINPLLDIV10_ROOTCLK */
  kCLOCK_Root_CGU_MAINPLLDIV20_ROOTCLK     = 27,  /*!< Clock Root CGU SS index 27 MAINPLLDIV20_ROOTCLK */
  kCLOCK_Root_CGU_AUDIOPLL_ROOTCLK         = 28,  /*!< Clock Root CGU SS index 28 AUDIOPLL_ROOTCLK */
  kCLOCK_Root_CGU_VIDEOPLL_ROOTCLK         = 29,  /*!< Clock Root CGU SS index 29 VIDEOPLL_ROOTCLK */
  kCLOCK_Root_CGU_MAIN_ROOTCLK             = 30,  /*!< Clock Root CGU SS index 30 MAIN_ROOTCLK (renamed from CPU_ROOTCLK; CGU ROOT 30 feeds both CMPT ROOT 0 MAIN (after div+sndDiv) and CMPT ROOT 1 CPU (after div only) -- see CLOCK_GetClockSrcFreq sndDiv special case for kCLOCK_SRC_CPU) */
  kCLOCK_Root_CGU_NPU_ROOTCLK              = 31,  /*!< Clock Root CGU SS index 31 NPU_ROOTCLK */
  kCLOCK_Root_CGU_MEDIABUS_ROOTCLK         = 32,  /*!< Clock Root CGU SS index 32 MEDIABUS_ROOTCLK */
  kCLOCK_Root_CGU_AUDIOBUS_ROOTCLK         = 33,  /*!< Clock Root CGU SS index 33 AUDIOBUS_ROOTCLK */
  kCLOCK_Root_CGU_COMMBUS_ROOTCLK          = 34,  /*!< Clock Root CGU SS index 34 COMMBUS_ROOTCLK */
  kCLOCK_Root_CGU_WAKEBUS_ROOTCLK          = 35,  /*!< Clock Root CGU SS index 35 WAKEBUS_ROOTCLK */
  kCLOCK_Root_CGU_SYSCON_PDMAIN_CLK        = 36,  /*!< Clock Root CGU SS index 36 SYSCON_PDMAIN_CLK */
  kCLOCK_Root_CGU_PERI_ROOTCLK0            = 37,  /*!< Clock Root CGU SS index 37 PERI_ROOTCLK0 */
  kCLOCK_Root_CGU_PERI_ROOTCLK1            = 38,  /*!< Clock Root CGU SS index 38 PERI_ROOTCLK1 */
  kCLOCK_Root_CGU_PERI_ROOTCLK2            = 39,  /*!< Clock Root CGU SS index 39 PERI_ROOTCLK2 */
  kCLOCK_Root_CGU_PERI_ROOTCLK3            = 40,  /*!< Clock Root CGU SS index 40 PERI_ROOTCLK3 */
  kCLOCK_Root_CGU_PERI_ROOTCLK4            = 41,  /*!< Clock Root CGU SS index 41 PERI_ROOTCLK4 */
  kCLOCK_Root_CGU_PERI_ROOTCLK5            = 42,  /*!< Clock Root CGU SS index 42 PERI_ROOTCLK5 */
  kCLOCK_Root_CGU_PERI_ROOTCLK6            = 43,  /*!< Clock Root CGU SS index 43 PERI_ROOTCLK6 */
  kCLOCK_Root_CGU_PERI_ROOTCLK7            = 44,  /*!< Clock Root CGU SS index 44 PERI_ROOTCLK7 */
  kCLOCK_Root_CGU_AUDIO_ROOTCLK            = 45,  /*!< Clock Root CGU SS index 45 AUDIO_ROOTCLK */
  kCLOCK_Root_CGU_VIDEO_ROOTCLK            = 46,  /*!< Clock Root CGU SS index 46 VIDEO_ROOTCLK */
  kCLOCK_Root_CGU_USB1_ROOTCLK             = 47,  /*!< Clock Root CGU SS index 47 USB1_ROOTCLK */
  kCLOCK_Root_CGU_ETH_ROOTCLK              = 48,  /*!< Clock Root CGU SS index 48 ETH_ROOTCLK */
#if 0
  kCLOCK_Root_CGU_TEST_ROOTCLK             = 49,  /*!< Clock Root CGU SS index 49 TEST_ROOTCLK */
  kCLOCK_Root_CGU_CLKOUT                   = 50,  /*!< Clock Root CGU SS index 50 CLKOUT */
  kCLOCK_Root_CGU_MAIN_FRO192M             = 51,  /*!< Clock Root CGU SS index 51 MAIN_FRO192M */
  kCLOCK_Root_CGU_MAIN_ULP32K              = 52,  /*!< Clock Root CGU SS index 52 MAIN_ULP32K */
  kCLOCK_Root_CGU_END                      = 52,
#else
  kCLOCK_Root_CGU_END                      = 48,
#endif
  // Clock Root for Cmpt SS
  kCLOCK_Root_CMPT_START                   = 64,
  kCLOCK_Root_CMPT_cmpt_clk                = 64,  /*!< Clock Root Cmpt SS index 0 cmpt_clk (MAIN_ROOTCLK) */
  kCLOCK_Root_CMPT_cpu_clk                 = 65,  /*!< Clock Root Cmpt SS index 1 cpu_clk (CPU_ROOTCLK)   */
  kCLOCK_Root_CMPT_npu_clk                 = 66,  /*!< Clock Root Cmpt SS index 2 npu_clk (NPU_ROOTCLK)   */
  kCLOCK_Root_CMPT_systick_clk0            = 67,  /*!< Clock Root Cmpt SS index 3 systick_clk0            */
  kCLOCK_Root_CMPT_systick_clk1            = 68,  /*!< Clock Root Cmpt SS index 4 systick_clk1            */
  kCLOCK_Root_CMPT_END                     = 68,
  // Clock Root for Main SS
  kCLOCK_Root_MAIN_START                   = 80,
  kCLOCK_Root_MAIN_main_clk_divided        = 80, /*!< Clock Root Main SS index 0 main_clk_divided        */
  kCLOCK_Root_MAIN_xspi0_fclk_divided      = 81, /*!< Clock Root Main SS index 1 xspi0_fclk_divided      */
  kCLOCK_Root_MAIN_xspi1_fclk_divided      = 82, /*!< Clock Root Main SS index 2 xspi1_fclk_divided      */
  kCLOCK_Root_MAIN_i3c0_fclk               = 83, /*!< Clock Root Main SS index 3 i3c0_fclk               */
  kCLOCK_Root_MAIN_lpi2c0_fclk             = 84, /*!< Clock Root Main SS index 4 lpi2c0_fclk             */
  kCLOCK_Root_MAIN_lpi2c1_fclk             = 85, /*!< Clock Root Main SS index 5 lpi2c1_fclk             */
  kCLOCK_Root_MAIN_lpspi0_fclk             = 86, /*!< Clock Root Main SS index 6 lpspi0_fclk             */
  kCLOCK_Root_MAIN_lpspi1_fclk             = 87, /*!< Clock Root Main SS index 7 lpspi1_fclk             */
  kCLOCK_Root_MAIN_lpspi2_fclk             = 88, /*!< Clock Root Main SS index 8 lpspi2_fclk             */
  kCLOCK_Root_MAIN_lpspi3_fclk             = 89, /*!< Clock Root Main SS index 9 lpspi3_fclk             */
  kCLOCK_Root_MAIN_lpspi4_fclk             = 90, /*!< Clock Root Main SS index 10 lpspi4_fclk            */
  kCLOCK_Root_MAIN_lpuart0_fclk            = 91, /*!< Clock Root Main SS index 11 lpuart0_fclk           */
  kCLOCK_Root_MAIN_lpuart1_fclk            = 92, /*!< Clock Root Main SS index 12 lpuart1_fclk           */
  kCLOCK_Root_MAIN_lpuart2_fclk            = 93, /*!< Clock Root Main SS index 13 lpuart2_fclk           */
  kCLOCK_Root_MAIN_lpuart3_fclk            = 94, /*!< Clock Root Main SS index 14 lpuart3_fclk           */
  kCLOCK_Root_MAIN_lpuart4_fclk            = 95, /*!< Clock Root Main SS index 15 lpuart4_fclk           */
  kCLOCK_Root_MAIN_lpuart5_fclk            = 96, /*!< Clock Root Main SS index 16 lpuart5_fclk           */
  kCLOCK_Root_MAIN_flexcan0_fclk           = 97, /*!< Clock Root Main SS index 17 flexcan0_fclk          */
  kCLOCK_Root_MAIN_flexcan1_fclk           = 98, /*!< Clock Root Main SS index 18 flexcan1_fclk          */
  kCLOCK_Root_MAIN_flexcan2_fclk           = 99, /*!< Clock Root Main SS index 19 flexcan2_fclk          */
  kCLOCK_Root_MAIN_flexcan_gfclk           = 100, /*!< Clock Root Main SS index 20 flexcan_gfclk         */
  kCLOCK_Root_MAIN_qtpm0_fclk              = 101, /*!< Clock Root Main SS index 21 TBD0                  */
  kCLOCK_Root_MAIN_lpit0_fclk              = 102, /*!< Clock Root Main SS index 22 lpit0_fclk            */
  kCLOCK_Root_MAIN_lpit1_fclk              = 103, /*!< Clock Root Main SS index 23 lpit1_fclk            */
  kCLOCK_Root_MAIN_adc0_fclk               = 104, /*!< Clock Root Main SS index 24 adc0_fclk             */
  kCLOCK_Root_MAIN_adc1_fclk               = 105, /*!< Clock Root Main SS index 25 adc1_fclk             */
  kCLOCK_Root_MAIN_sinc0_fclk              = 106, /*!< Clock Root Main SS index 26 sinc0_fclk            */
  kCLOCK_Root_MAIN_sinc1_fclk              = 107, /*!< Clock Root Main SS index 27 sinc1_fclk            */
  kCLOCK_Root_MAIN_flexio0_fclk            = 108, /*!< Clock Root Main SS index 28 flexio0_fclk          */
  kCLOCK_Root_MAIN_flexio1_fclk            = 109, /*!< Clock Root Main SS index 29 flexio1_fclk          */
  kCLOCK_Root_MAIN_flexio2_fclk            = 110, /*!< Clock Root Main SS index 30 flexio2_fclk          */
  kCLOCK_Root_MAIN_tpiu_clk                = 111, /*!< Clock Root Main SS index 31 tpiu_clk              */
  kCLOCK_Root_MAIN_cssi_refclk             = 112, /*!< Clock Root Main SS index 32 cssi_refclk           */
  kCLOCK_Root_MAIN_otp_clk                 = 113, /*!< Clock Root Main SS index 33 otp_clk               */
  kCLOCK_Root_MAIN_clkout	               = 114, /*!< Clock Root Main SS index 34 clkout                */
  kCLOCK_Root_MAIN_fro192m	               = 115, /*!< Clock Root Main SS index 35 clkout                */
  kCLOCK_Root_MAIN_ulp32k                  = 116, /*!< Clock Root Main SS index 36 clkout                */
  kCLOCK_Root_MAIN_END                     = 116,
  // Clock Root for Wake SS
  kCLOCK_Root_WAKE_START                   = 128,
  kCLOCK_Root_WAKE_wake_clk                = 128, /*!< Clock Root Wake SS index 0 wake_clk                */
  kCLOCK_Root_WAKE_wake_sxosc              = 129, /*!< Clock Root Wake SS index 1 wake_sxosc              */
  kCLOCK_Root_WAKE_wake_lp1m               = 130, /*!< Clock Root Wake SS index 2 wake_lp1m               */
  kCLOCK_Root_WAKE_wake_lp12m              = 131, /*!< Clock Root Wake SS index 3 wake_lp12m              */
  kCLOCK_Root_WAKE_wake_ulp32k             = 132, /*!< Clock Root Wake SS index 4 wake_ulp32k             */
  kCLOCK_Root_WAKE_wake_lpclk              = 133, /*!< Clock Root Wake SS index 5 wake_lpclk              */
  kCLOCK_Root_WAKE_i3c0_fclk               = 134, /*!< Clock Root Wake SS index 6 i3c0_fclk               */
  kCLOCK_Root_WAKE_lpi2c0_fclk             = 135, /*!< Clock Root Wake SS index 7 lpi2c0_fclk             */
  kCLOCK_Root_WAKE_lpi2c1_fclk             = 136, /*!< Clock Root Wake SS index 8 lpi2c1_fclk             */
  kCLOCK_Root_WAKE_lpspi0_fclk             = 137, /*!< Clock Root Wake SS index 9 lpspi0_fclk             */
  kCLOCK_Root_WAKE_lpuart0_fclk            = 138, /*!< Clock Root Wake SS index 10 lpuart0_fclk           */
  kCLOCK_Root_WAKE_lpuart1_fclk            = 139, /*!< Clock Root Wake SS index 11 lpuart1_fclk           */
  kCLOCK_Root_WAKE_dmic1_appclk            = 140, /*!< Clock Root Wake SS index 12 dmic1_appclk           */
  kCLOCK_Root_WAKE_qtpm0_fclk              = 141, /*!< Clock Root Wake SS index 13 qtpm0_fclk             */
  kCLOCK_Root_WAKE_lptmr0_fclk             = 142, /*!< Clock Root Wake SS index 14 lptmr0_fclk            */
  kCLOCK_Root_WAKE_lptmr1_fclk             = 143, /*!< Clock Root Wake SS index 15 lptmr1_fclk            */
  kCLOCK_Root_WAKE_swt0_fclk               = 144, /*!< Clock Root Wake SS index 16 swt0_fclk              */
  kCLOCK_Root_WAKE_swt1_fclk               = 145, /*!< Clock Root Wake SS index 17 swt1_fclk              */
  kCLOCK_Root_WAKE_ewm_fclk                = 146, /*!< Clock Root Wake SS index 18 ewm_fclk               */
  kCLOCK_Root_WAKE_acmp0_fclk              = 147, /*!< Clock Root Wake SS index 19 acmp0_fclk             */
  kCLOCK_Root_WAKE_acmp1_fclk              = 148, /*!< Clock Root Wake SS index 20 acmp1_fclk             */
  kCLOCK_Root_WAKE_acmp2_fclk              = 149, /*!< Clock Root Wake SS index 21 acmp2_fclk             */
  kCLOCK_Root_WAKE_acmp3_fclk              = 150, /*!< Clock Root Wake SS index 22 acmp3_fclk             */
  kCLOCK_Root_WAKE_acmp0_rrclk             = 151, /*!< Clock Root Wake SS index 23 acmp0_rrclk            */
  kCLOCK_Root_WAKE_acmp1_rrclk             = 152, /*!< Clock Root Wake SS index 24 acmp1_rrclk            */
  kCLOCK_Root_WAKE_acmp2_rrclk             = 153, /*!< Clock Root Wake SS index 25 acmp2_rrclk            */
  kCLOCK_Root_WAKE_acmp3_rrclk             = 154, /*!< Clock Root Wake SS index 26 acmp3_rrclk            */
  kCLOCK_Root_WAKE_END                     = 154,
  // Clock Root for Comm SS
  kCLOCK_Root_COMM_START                   = 160,
  kCLOCK_Root_COMM_comm_clk                = 160, /*!< Clock Root Comm SS index 0 comm_clk                */
  kCLOCK_Root_COMM_comm_ulp32k             = 161, /*!< Clock Root Comm SS index 1 comm_ulp32k             */
  kCLOCK_Root_COMM_usdhc0_fclk             = 162, /*!< Clock Root Comm SS index 2 usdhc0_fclk             */
  kCLOCK_Root_COMM_usdhc1_fclk             = 163, /*!< Clock Root Comm SS index 3 usdhc1_fclk             */
  kCLOCK_Root_COMM_xspir_rootclk           = 164, /*!< Clock Root Comm SS index 4 xspir_rootclk           */
  kCLOCK_Root_COMM_usb0_phyclk             = 165, /*!< Clock Root Comm SS index 5 usb0_phyclk             */
  kCLOCK_Root_COMM_usb0_fro48m             = 166, /*!< Clock Root Comm SS index 6 usb0_fro48m             */
  kCLOCK_Root_COMM_usb1_fclk               = 167, /*!< Clock Root Comm SS index 7 usb1_fclk               */
  kCLOCK_Root_COMM_usb0_wakeclk            = 168, /*!< Clock Root Comm SS index 8 usb0_wakeclk            */
  kCLOCK_Root_COMM_eth0_trxclk             = 169, /*!< Clock Root Comm SS index 9 eth0_trxclk             */
  kCLOCK_Root_COMM_eth0_timerclk           = 170, /*!< Clock Root Comm SS index 10 eth0_timerclk          */
  kCLOCK_Root_COMM_eth1_trxclk             = 171, /*!< Clock Root Comm SS index 11 eth1_trxclk            */
  kCLOCK_Root_COMM_eth1_timerclk           = 172, /*!< Clock Root Comm SS index 12 eth1_timerclk          */
  kCLOCK_Root_COMM_eth_refclk              = 173, /*!< Clock Root Comm SS index 13 eth_refclk             */
  kCLOCK_Root_COMM_xeno0_liwclk            = 174, /*!< Clock Root Comm SS index 14 xeno0_liwclk           */
  kCLOCK_Root_COMM_xeno1_liwclk            = 175, /*!< Clock Root Comm SS index 15 xeno1_liwclk           */
  kCLOCK_Root_COMM_dll_refclk              = 176, /*!< Clock Root Comm SS index 16 dll_refclk             */
  kCLOCK_Root_COMM_END                     = 176,
  // Clock Root for Audio SS
  kCLOCK_Root_AUDIO_START                  = 192,
  kCLOCK_Root_AUDIO_audio_clk              = 192,  /*!< Clock Root Audio SS index 0 audio_clk              */
  kCLOCK_Root_AUDIO_dmic0_appclk           = 193,  /*!< Clock Root Audio SS index 1 dmic0_appclk           */
  kCLOCK_Root_AUDIO_sai0_mclk0             = 194,  /*!< Clock Root Audio SS index 2 sai0_mclk0             */
  kCLOCK_Root_AUDIO_sai0_mclk1             = 195,  /*!< Clock Root Audio SS index 3 sai0_mclk1             */
  kCLOCK_Root_AUDIO_sai1_mclk0             = 196,  /*!< Clock Root Audio SS index 4 sai1_mclk0             */
  kCLOCK_Root_AUDIO_sai1_mclk1             = 197,  /*!< Clock Root Audio SS index 5 sai1_mclk1             */
  kCLOCK_Root_AUDIO_sai2_mclk0             = 198,  /*!< Clock Root Audio SS index 6 sai2_mclk0             */
  kCLOCK_Root_AUDIO_sai2_mclk1             = 199,  /*!< Clock Root Audio SS index 7 sai2_mclk1             */
  kCLOCK_Root_AUDIO_spdif_txclk            = 200,  /*!< Clock Root Audio SS index 8 spdif_txclk            */
  kCLOCK_Root_AUDIO_spdif_cdrclk           = 201,  /*!< Clock Root Audio SS index 9 spdif_cdrclk           */
  kCLOCK_Root_AUDIO_asrc_clk               = 202,  /*!< Clock Root Audio SS index 10 asrc_clk              */
  kCLOCK_Root_AUDIO_END                    = 202,
  // Clock Root for Media SS
  kCLOCK_Root_MEDIA_START                  = 208,
  kCLOCK_Root_MEDIA_media_clk              = 208, /*!< Clock Root Media SS index 0 media_clk              */
  kCLOCK_Root_MEDIA_mediapll_clk           = 209, /*!< Clock Root Media SS index 1 mediapll_clk           */
  kCLOCK_Root_MEDIA_mipicsi_escclk         = 210, /*!< Clock Root Media SS index 2 mipicsi_escclk         */
  kCLOCK_Root_MEDIA_mipicsi_clk            = 211, /*!< Clock Root Media SS index 3 mipicsi_clk            */
  kCLOCK_Root_MEDIA_mipidsi_escclk_divided = 212, /*!< Clock Root Media SS index 4 mipidsi_escclk_divided */
  kCLOCK_Root_MEDIA_mipidsi_refclk         = 213, /*!< Clock Root Media SS index 5 mipidsi_refclk         */
  kCLOCK_Root_MEDIA_mipidsi_clk            = 214, /*!< Clock Root Media SS index 6 mipidsi_clk            */
  kCLOCK_Root_MEDIA_reformat_fclk          = 215, /*!< Clock Root Media SS index 7 reformat_fclk          */
  kCLOCK_Root_MEDIA_dcpixel_fclk           = 216, /*!< Clock Root Media SS index 8 dcpixel_fclk           */
  kCLOCK_Root_MEDIA_csi_mclkout            = 217, /*!< Clock Root Media SS index 9 csi_mclkout            */
  kCLOCK_Root_MEDIA_END                    = 217,

  kCLOCK_Root_Invalid                      = 0xFFU, /*!< Sentinel: not a real root. Used by the frequency
                                                         resolver to mark an empty slot in s_clockSrcRootMap. */
} clock_root_t;

/*!
 * @brief The enumerator of clock roots' clock source mux value.
 */
typedef enum _clock_root_mux_source {
    /*
     * CGU Clock Roots
     */
    /* CGU ROOT 0 SXOSC */
    kCLOCK_SXOSC_ClockRoot_OSC_24M               = 0U, /*!< SXOSC mux from OSC_24M               */

    /* CGU ROOT 1 BASE */
    kCLOCK_BASE_ClockRoot_FRO_192M               = 0U, /*!< BASE mux from FRO_192M               */
    kCLOCK_BASE_ClockRoot_OSC_24M                = 1U, /*!< BASE mux from OSC_24M                */
    kCLOCK_BASE_ClockRoot_LPOSC_12M_CORE         = 2U, /*!< BASE mux from LPOSC_12M_CORE         */
    kCLOCK_BASE_ClockRoot_LPOSC_1M_CORE          = 3U, /*!< BASE mux from LPOSC_1M_CORE          */

    /* CGU ROOT 2 LOW */
    kCLOCK_LOW_ClockRoot_FRO_24M                 = 0U, /*!< LOW mux from FRO_24M                 */
    kCLOCK_LOW_ClockRoot_OSC_24M                 = 1U, /*!< LOW mux from OSC_24M                 */
    kCLOCK_LOW_ClockRoot_LPOSC_12M_CORE          = 2U, /*!< LOW mux from LPOSC_12M_CORE          */
    kCLOCK_LOW_ClockRoot_LPOSC_1M_CORE           = 3U, /*!< LOW mux from LPOSC_1M_CORE           */

    /* CGU ROOT 3 MAINPLL_DIVX */
    kCLOCK_MAINPLL_DIVX_ClockRoot_MAINPLL_DIV4   = 0U, /*!< MAINPLL_DIVX mux from MAINPLL_DIV4   */
    kCLOCK_MAINPLL_DIVX_ClockRoot_MAINPLL_DIV5   = 1U, /*!< MAINPLL_DIVX mux from MAINPLL_DIV5   */

    /* CGU ROOT 4 SYSPLL_DIVX */
    kCLOCK_SYSPLL_DIVX_ClockRoot_SYSPLL_DIV4     = 0U, /*!< SYSPLL_DIVX mux from SYSPLL_DIV4     */
    kCLOCK_SYSPLL_DIVX_ClockRoot_SYSPLL_DIV5     = 1U, /*!< SYSPLL_DIVX mux from SYSPLL_DIV5     */

    /* CGU ROOT 5 PLL_PFDX */
    kCLOCK_PLL_PFDX_ClockRoot_MAINPLL_DIVOUT1    = 0U, /*!< PLL_PFDX mux from MAINPLL_DIVOUT1    */
    kCLOCK_PLL_PFDX_ClockRoot_MAINPLL_DIVOUT2    = 1U, /*!< PLL_PFDX mux from MAINPLL_DIVOUT2    */
    kCLOCK_PLL_PFDX_ClockRoot_SYSPLL_DIVOUT1     = 2U, /*!< PLL_PFDX mux from SYSPLL_DIVOUT1     */
    kCLOCK_PLL_PFDX_ClockRoot_SYSPLL_DIVOUT2     = 3U, /*!< PLL_PFDX mux from SYSPLL_DIVOUT2     */

