zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
    /* CGU ROOT 6 MEDIA_PFDX */
    kCLOCK_MEDIA_PFDX_ClockRoot_MAINPLL_DIVOUT1  = 0U, /*!< MEDIA_PFDX mux from MAINPLL_DIVOUT1  */
    kCLOCK_MEDIA_PFDX_ClockRoot_MAINPLL_DIVOUT2  = 1U, /*!< MEDIA_PFDX mux from MAINPLL_DIVOUT2  */
    kCLOCK_MEDIA_PFDX_ClockRoot_SYSPLL_DIVOUT1   = 2U, /*!< MEDIA_PFDX mux from SYSPLL_DIVOUT1   */
    kCLOCK_MEDIA_PFDX_ClockRoot_SYSPLL_DIVOUT2   = 3U, /*!< MEDIA_PFDX mux from SYSPLL_DIVOUT2   */

    /* CGU ROOT 7 MAINPFDX */
    kCLOCK_MAINPFDX_ClockRoot_COREPLL_OUT        = 0U, /*!< MAINPFDX mux from COREPLL_OUT        */
    kCLOCK_MAINPFDX_ClockRoot_MAINPLL_DIVOUT2    = 1U, /*!< MAINPFDX mux from MAINPLL_DIVOUT2    */
    kCLOCK_MAINPFDX_ClockRoot_SYSPLL_DIVOUT1     = 2U, /*!< MAINPFDX mux from SYSPLL_DIVOUT1     */
    kCLOCK_MAINPFDX_ClockRoot_SYSPLL_DIVOUT2     = 3U, /*!< MAINPFDX mux from SYSPLL_DIVOUT2     */

    /* CGU ROOT 8 COMMPFDX */
    kCLOCK_COMMPFDX_ClockRoot_COREPLL_OUT        = 0U, /*!< COMMPFDX mux from COREPLL_OUT        */
    kCLOCK_COMMPFDX_ClockRoot_MAINPLL_DIVOUT2    = 1U, /*!< COMMPFDX mux from MAINPLL_DIVOUT2    */
    kCLOCK_COMMPFDX_ClockRoot_SYSPLL_DIVOUT1     = 2U, /*!< COMMPFDX mux from SYSPLL_DIVOUT1     */
    kCLOCK_COMMPFDX_ClockRoot_SYSPLL_DIVOUT2     = 3U, /*!< COMMPFDX mux from SYSPLL_DIVOUT2     */

    /* CGU ROOT 9 MAINDIVX */
    kCLOCK_MAINDIVX_ClockRoot_MAINPLL_DIV4       = 0U, /*!< MAINDIVX mux from MAINPLL_DIV4       */
    kCLOCK_MAINDIVX_ClockRoot_MAINPLL_DIV5       = 1U, /*!< MAINDIVX mux from MAINPLL_DIV5       */
    kCLOCK_MAINDIVX_ClockRoot_SYSPLL_DIV4        = 2U, /*!< MAINDIVX mux from SYSPLL_DIV4        */
    kCLOCK_MAINDIVX_ClockRoot_SYSPLL_DIV5        = 3U, /*!< MAINDIVX mux from SYSPLL_DIV5        */

    /* CGU ROOT 10 SAIMCLK */
    kCLOCK_SAIMCLK_ClockRoot_SAI0_MCLK           = 0U, /*!< SAIMCLK mux from SAI0_MCLK           */
    kCLOCK_SAIMCLK_ClockRoot_SAI1_MCLK           = 1U, /*!< SAIMCLK mux from SAI1_MCLK           */
    kCLOCK_SAIMCLK_ClockRoot_SAI2_MCLK           = 2U, /*!< SAIMCLK mux from SAI2_MCLK           */
    kCLOCK_SAIMCLK_ClockRoot_LPOSC_12M_CORE      = 3U, /*!< SAIMCLK mux from LPOSC_12M_CORE      */

    /* CGU ROOT 11 SAIMCLK0 */
    kCLOCK_SAIMCLK0_ClockRoot_SAI0_MCLK          = 0U, /*!< SAIMCLK0 mux from SAI0_MCLK          */

    /* CGU ROOT 12 SAIMCLK1 */
    kCLOCK_SAIMCLK1_ClockRoot_SAI1_MCLK          = 0U, /*!< SAIMCLK1 mux from SAI1_MCLK          */

    /* CGU ROOT 13 SAIMCLK2 */
    kCLOCK_SAIMCLK2_ClockRoot_SAI2_MCLK          = 0U, /*!< SAIMCLK2 mux from SAI2_MCLK          */

    /* CGU ROOT 14 LP12M_CORE */
    kCLOCK_LP12M_CORE_ClockRoot_LPOSC_12M_CORE   = 0U, /*!< LP12M_CORE mux from LPOSC_12M_CORE   */

    /* CGU ROOT 15 LP1M_CORE */
    kCLOCK_LP1M_CORE_ClockRoot_LPOSC_1M_CORE     = 0U, /*!< LP1M_CORE mux from LPOSC_1M_CORE     */

    /*CGU ROOT 16 ULP32K */
    kCLOCK_ULP32K_ClockRoot_LPOSC32K             = 0U, /*!< ULP32K mux from LPOSC32K             */

    /*CGU ROOT 17 FRO192M */
    kCLOCK_FRO192M_ClockRoot_FRO_192M            = 0U, /*!< FRO192M mux from FRO_192M            */

    /*CGU ROOT 18 FRO96M */
    kCLOCK_FRO96M_ClockRoot_FRO_96M              = 0U, /*!< FRO96M mux from FRO_96M              */

    /*CGU ROOT 19 FRO48M */
    kCLOCK_FRO48M_ClockRoot_FRO_48M              = 0U, /*!< FRO48M mux from FRO_48M              */

    /*CGU ROOT 20 FRO24M */
    kCLOCK_FRO24M_ClockRoot_FRO_24M              = 0U, /*!< FRO24M mux from FRO_24M              */

    /*CGU ROOT 21 SYSPLLDIV4 */
    kCLOCK_SYSPLLDIV4_ClockRoot_SYSPLL_DIV4      = 0U, /*!< SYSPLLDIV4 mux from SYSPLL_DIV4      */

    /*CGU ROOT 22 SYSPLLDIV5 */
    kCLOCK_SYSPLLDIV5_ClockRoot_SYSPLL_DIV5      = 0U, /*!< SYSPLLDIV5 mux from SYSPLL_DIV5      */

    /*CGU ROOT 23 SYSPLLDIVX */
    kCLOCK_SYSPLLDIVX_ClockRoot_SYSPLL_DIV4      = 0U, /*!< SYSPLLDIVX mux from SYSPLL_DIV4      */
    kCLOCK_SYSPLLDIVX_ClockRoot_SYSPLL_DIV5      = 1U, /*!< SYSPLLDIVX mux from SYSPLL_DIV5      */

    /*CGU ROOT 24 MAINPLLDIVX */
    kCLOCK_MAINPLLDIVX_ClockRoot_MAINPLL_DIV4    = 0U, /*!< MAINPLLDIVX mux from MAINPLL_DIV4    */
    kCLOCK_MAINPLLDIVX_ClockRoot_MAINPLL_DIV5    = 1U, /*!< MAINPLLDIVX mux from MAINPLL_DIV5    */

    /*CGU ROOT 25 MAINPLLDIV8 */
    kCLOCK_MAINPLLDIV8_ClockRoot_MAINPLL_DIV8    = 0U, /*!< MAINPLLDIV8 mux from MAINPLL_DIV8    */

    /*CGU ROOT 26 MAINPLLDIV10 */
    kCLOCK_MAINPLLDIV10_ClockRoot_MAINPLL_DIV10  = 0U, /*!< MAINPLLDIV10 mux from MAINPLL_DIV10  */

    /*CGU ROOT 27 MAINPLLDIV20 */
    kCLOCK_MAINPLLDIV20_ClockRoot_MAINPLL_DIV20  = 0U, /*!< MAINPLLDIV20 mux from MAINPLL_DIV20  */

    /*CGU ROOT 28 AUDIOPLL */
    kCLOCK_AUDIOPLL_ClockRoot_AUDIOPLL_DIVOUT    = 0U, /*!< AUDIOPLL mux from AUDIOPLL_DIVOUT    */

    /*CGU ROOT 29 VIDEOPLL */
    kCLOCK_VIDEOPLL_ClockRoot_VIDEOPLL_DIVOUT    = 0U, /*!< VIDEOPLL mux from VIDEOPLL_DIVOUT    */

    /*CGU ROOT 30 MAIN (was "CPU"; renamed -- this slice feeds both CMPT MAIN and CMPT CPU) */
    kCLOCK_CGU_MAIN_ClockRoot_BASE               = 0U, /*!< CGU MAIN mux from BASE               */
    kCLOCK_CGU_MAIN_ClockRoot_COREPLL_OUT        = 1U, /*!< CGU MAIN mux from COREPLL_OUT        */
    kCLOCK_CGU_MAIN_ClockRoot_MAINPLL_DIVX       = 2U, /*!< CGU MAIN mux from MAINPLL_DIVX       */
    kCLOCK_CGU_MAIN_ClockRoot_PLL_PFDX           = 3U, /*!< CGU MAIN mux from PLL_PFDX           */

    /*CGU ROOT 31 NPU */
    kCLOCK_NPU_ClockRoot_BASE                    = 0U, /*!< NPU mux from BASE                    */
    kCLOCK_NPU_ClockRoot_COREPLL_OUT             = 1U, /*!< NPU mux from COREPLL_OUT             */
    kCLOCK_NPU_ClockRoot_MAINPLL_DIVOUT1         = 2U, /*!< NPU mux from MAINPLL_DIVOUT1         */
    kCLOCK_NPU_ClockRoot_PLL_PFDX                = 3U, /*!< NPU mux from PLL_PFDX                */

    /*CGU ROOT 32 MEDIABUS */
    kCLOCK_MEDIABUS_ClockRoot_BASE               = 0U, /*!< MEDIABUS mux from BASE               */
    kCLOCK_MEDIABUS_ClockRoot_COREPLL_OUT        = 1U, /*!< MEDIABUS mux from COREPLL_OUT        */
    kCLOCK_MEDIABUS_ClockRoot_SYSPLL_DIVOUT2     = 2U, /*!< MEDIABUS mux from SYSPLL_DIVOUT2     */
    kCLOCK_MEDIABUS_ClockRoot_PLL_PFDX           = 3U, /*!< MEDIABUS mux from PLL_PFDX           */

