zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
    /*CGU ROOT 33 AUDIOBUS */
    kCLOCK_AUDIOBUS_ClockRoot_BASE               = 0U, /*!< AUDIOBUS mux from BASE               */
    kCLOCK_AUDIOBUS_ClockRoot_SYSPLL_DIVOUT2     = 1U, /*!< AUDIOBUS mux from SYSPLL_DIVOUT2     */
    kCLOCK_AUDIOBUS_ClockRoot_MAINPLL_DIVX       = 2U, /*!< AUDIOBUS mux from MAINPLL_DIVX       */
    kCLOCK_AUDIOBUS_ClockRoot_SYSPLL_DIVX        = 3U, /*!< AUDIOBUS mux from SYSPLL_DIVX        */

    /*CGU ROOT 34 COMMBUS */
    kCLOCK_COMMBUS_ClockRoot_BASE                = 0U, /*!< COMMBUS mux from BASE                */
    kCLOCK_COMMBUS_ClockRoot_SYSPLL_DIVOUT2      = 1U, /*!< COMMBUS mux from SYSPLL_DIVOUT2      */
    kCLOCK_COMMBUS_ClockRoot_MAINPLL_DIVX        = 2U, /*!< COMMBUS mux from MAINPLL_DIVX        */
    kCLOCK_COMMBUS_ClockRoot_SYSPLL_DIVX         = 3U, /*!< COMMBUS mux from SYSPLL_DIVX         */

    /*CGU ROOT 35 WAKEBUS */
    kCLOCK_WAKEBUS_ClockRoot_LOW                 = 0U, /*!< WAKEBUS mux from LOW                 */
    kCLOCK_WAKEBUS_ClockRoot_FRO_192M            = 1U, /*!< WAKEBUS mux from FRO_192M            */
    kCLOCK_WAKEBUS_ClockRoot_MAINPLL_DIVX        = 2U, /*!< WAKEBUS mux from MAINPLL_DIVX        */
    kCLOCK_WAKEBUS_ClockRoot_SYSPLL_DIVOUT2      = 3U, /*!< WAKEBUS mux from SYSPLL_DIVOUT2      */

    /*CGU ROOT 36 SYSCON_PDMAIN */
    kCLOCK_SYSCON_PDMAIN_ClockRoot_LOW           = 0U, /*!< SYSCON_PDMAIN mux from LOW           */
    kCLOCK_SYSCON_PDMAIN_ClockRoot_FRO_48M       = 1U, /*!< SYSCON_PDMAIN mux from FRO_48M       */
    kCLOCK_SYSCON_PDMAIN_ClockRoot_MAINPLL_DIV10 = 2U, /*!< SYSCON_PDMAIN mux from MAINPLL_DIV10 */
    kCLOCK_SYSCON_PDMAIN_ClockRoot_SYSPLL_DIV10  = 3U, /*!< SYSCON_PDMAIN mux from SYSPLL_DIV10  */

    /*CGU ROOT 37 PERI0 */
    kCLOCK_PERI0_ClockRoot_BASE                  = 0U, /*!< PERI0 mux from BASE                  */
    kCLOCK_PERI0_ClockRoot_MAINPLL_DIVOUT0       = 1U, /*!< PERI0 mux from MAINPLL_DIVOUT0       */
    kCLOCK_PERI0_ClockRoot_SYSPLL_DIVOUT0        = 2U, /*!< PERI0 mux from SYSPLL_DIVOUT0        */
    kCLOCK_PERI0_ClockRoot_SYSPLL_DIVOUT1        = 3U, /*!< PERI0 mux from SYSPLL_DIVOUT1        */

    /*CGU ROOT 38 PERI1 */
    kCLOCK_PERI1_ClockRoot_BASE                  = 0U, /*!< PERI1 mux from BASE                  */
    kCLOCK_PERI1_ClockRoot_MAINPLL_DIVOUT1       = 1U, /*!< PERI1 mux from MAINPLL_DIVOUT1       */
    kCLOCK_PERI1_ClockRoot_SYSPLL_DIVOUT0        = 2U, /*!< PERI1 mux from SYSPLL_DIVOUT0        */
    kCLOCK_PERI1_ClockRoot_SYSPLL_DIVOUT1        = 3U, /*!< PERI1 mux from SYSPLL_DIVOUT1        */

    /*CGU ROOT 39 PERI2 */
    kCLOCK_PERI2_ClockRoot_BASE                  = 0U, /*!< PERI2 mux from BASE                  */
    kCLOCK_PERI2_ClockRoot_MAINPLL_DIVOUT2       = 1U, /*!< PERI2 mux from MAINPLL_DIVOUT2       */
    kCLOCK_PERI2_ClockRoot_SYSPLL_DIVOUT0        = 2U, /*!< PERI2 mux from SYSPLL_DIVOUT0        */
    kCLOCK_PERI2_ClockRoot_SYSPLL_DIVOUT2        = 3U, /*!< PERI2 mux from SYSPLL_DIVOUT2        */

    /*CGU ROOT 40 PERI3 */
    kCLOCK_PERI3_ClockRoot_BASE                  = 0U, /*!< PERI3 mux from BASE                  */
    kCLOCK_PERI3_ClockRoot_MAINPLL_DIVOUT2       = 1U, /*!< PERI3 mux from MAINPLL_DIVOUT2       */
    kCLOCK_PERI3_ClockRoot_MAINPLL_DIVX          = 2U, /*!< PERI3 mux from MAINPLL_DIVX          */
    kCLOCK_PERI3_ClockRoot_SYSPLL_DIVOUT2        = 3U, /*!< PERI3 mux from SYSPLL_DIVOUT2        */

    /*CGU ROOT 41 PERI4 */
    kCLOCK_PERI4_ClockRoot_BASE                  = 0U, /*!< PERI4 mux from BASE                  */
    kCLOCK_PERI4_ClockRoot_MAINPLL_DIVOUT0       = 1U, /*!< PERI4 mux from MAINPLL_DIVOUT0       */
    kCLOCK_PERI4_ClockRoot_MAINPLL_DIVX          = 2U, /*!< PERI4 mux from MAINPLL_DIVX          */
    kCLOCK_PERI4_ClockRoot_SYSPLL_DIVOUT2        = 3U, /*!< PERI4 mux from SYSPLL_DIVOUT2        */

    /*CGU ROOT 42 PERI5 */
    kCLOCK_PERI5_ClockRoot_BASE                  = 0U, /*!< PERI5 mux from BASE                  */
    kCLOCK_PERI5_ClockRoot_MAINPLL_DIVOUT0       = 1U, /*!< PERI5 mux from MAINPLL_DIVOUT0       */
    kCLOCK_PERI5_ClockRoot_MAINPLL_DIVX          = 2U, /*!< PERI5 mux from MAINPLL_DIVX          */
    kCLOCK_PERI5_ClockRoot_SYSPLL_DIVOUT2        = 3U, /*!< PERI5 mux from SYSPLL_DIVOUT2        */

    /*CGU ROOT 43 PERI6 */
    kCLOCK_PERI6_ClockRoot_BASE                  = 0U, /*!< PERI6 mux from BASE                  */
    kCLOCK_PERI6_ClockRoot_MAINPLL_DIVOUT1       = 1U, /*!< PERI6 mux from MAINPLL_DIVOUT1       */
    kCLOCK_PERI6_ClockRoot_MAINPLL_DIVX          = 2U, /*!< PERI6 mux from MAINPLL_DIVX          */
    kCLOCK_PERI6_ClockRoot_SYSPLL_DIVOUT2        = 3U, /*!< PERI6 mux from SYSPLL_DIVOUT2        */

    /*CGU ROOT 44 PERI7 */
    kCLOCK_PERI7_ClockRoot_LOW                   = 0U, /*!< PERI7 mux from LOW                   */
    kCLOCK_PERI7_ClockRoot_FRO_192M              = 1U, /*!< PERI7 mux from FRO_192M              */
    kCLOCK_PERI7_ClockRoot_MAINPLL_DIVOUT2       = 2U, /*!< PERI7 mux from MAINPLL_DIVOUT2       */
    kCLOCK_PERI7_ClockRoot_SYSPLL_DIVOUT2        = 3U, /*!< PERI7 mux from SYSPLL_DIVOUT2        */

    /*CGU ROOT 45 AUDIO */
    kCLOCK_AUDIO_ClockRoot_LOW                   = 0U, /*!< AUDIO mux from LOW                   */
    kCLOCK_AUDIO_ClockRoot_AUDIOPLL_DIVOUT       = 1U, /*!< AUDIO mux from AUDIOPLL_DIVOUT       */
    kCLOCK_AUDIO_ClockRoot_VIDEOPLL_DIVOUT       = 2U, /*!< AUDIO mux from VIDEOPLL_DIVOUT       */
    kCLOCK_AUDIO_ClockRoot_SYSPLL_DIVOUT2        = 3U, /*!< AUDIO mux from SYSPLL_DIVOUT2        */

    /*CGU ROOT 46 VIDEO */
    kCLOCK_VIDEO_ClockRoot_BASE                  = 0U, /*!< VIDEO mux from BASE                  */
    kCLOCK_VIDEO_ClockRoot_AUDIOPLL_DIVOUT       = 1U, /*!< VIDEO mux from AUDIOPLL_DIVOUT       */
    kCLOCK_VIDEO_ClockRoot_VIDEOPLL_DIVOUT       = 2U, /*!< VIDEO mux from VIDEOPLL_DIVOUT       */
    kCLOCK_VIDEO_ClockRoot_MEDIA_PFDX            = 3U, /*!< VIDEO mux from MEDIA_PFDX            */

    /*CGU ROOT 47 USB1 */
    kCLOCK_USB1_ClockRoot_FRO_48M                = 0U, /*!< USB1 mux from FRO_48M                */
    kCLOCK_USB1_ClockRoot_MAINPLL_DIVOUT1        = 1U, /*!< USB1 mux from MAINPLL_DIVOUT1        */
    kCLOCK_USB1_ClockRoot_MAINPLL_DIVOUT2        = 2U, /*!< USB1 mux from MAINPLL_DIVOUT2        */
    kCLOCK_USB1_ClockRoot_SYSPLL_DIVOUT2         = 3U, /*!< USB1 mux from SYSPLL_DIVOUT2         */

    /*CGU ROOT 48 ETH */
    kCLOCK_ETH_ClockRoot_BASE                    = 0U, /*!< ETH mux from BASE                    */
    kCLOCK_ETH_ClockRoot_MAINPLL_DIV8            = 1U, /*!< ETH mux from MAINPLL_DIV8            */
    kCLOCK_ETH_ClockRoot_MAINPLL_DIV20           = 2U, /*!< ETH mux from MAINPLL_DIV20           */
    kCLOCK_ETH_ClockRoot_SYSPLL_DIV20            = 3U, /*!< ETH mux from SYSPLL_DIV20            */

