zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
#if 0
    /*CGU ROOT 49 TEST */
    kCLOCK_TEST_ClockRoot_TIE_LOW                = 0U, /*!< TEST mux from TIE_LOW                */
    kCLOCK_TEST_ClockRoot_COREPLL_OUT            = 1U, /*!< TEST mux from COREPLL_OUT            */
    kCLOCK_TEST_ClockRoot_MAINPLL_DIVOUT0        = 2U, /*!< TEST mux from MAINPLL_DIVOUT0        */
    kCLOCK_TEST_ClockRoot_SYSPLL_DIVOUT0         = 3U, /*!< TEST mux from SYSPLL_DIVOUT0         */

    /*CGU ROOT 50 CLKOUT */
    kCLOCK_CLKOUT_ClockRoot_PERI3                = 0U, /*!< CLKOUT mux from PERI3                */
    kCLOCK_CLKOUT_ClockRoot_PERI5                = 1U, /*!< CLKOUT mux from PERI5                */
    kCLOCK_CLKOUT_ClockRoot_FRO192M              = 2U, /*!< CLKOUT mux from FRO192M              */
    kCLOCK_CLKOUT_ClockRoot_MAINPLLDIV10         = 3U, /*!< CLKOUT mux from MAINPLLDIV10         */

    /*CGU ROOT 51 MAIN_FRO192M */
    kCLOCK_MAIN_FRO192M_ClockRoot_FRO192M        = 0U, /*!< MAIN_FRO192M mux from FRO192M        */

    /*CGU ROOT 52 MAIN_ULP32K */
    kCLOCK_MAIN_ULP32K_ClockRoot_ULP32K          = 0U, /*!< MAIN_ULP32K mux from ULP32K          */
#endif

    /*
     * CMPT Clock Roots
     */
    /* CMPT ROOT 0 CMPT */
    kCLOCK_CMPT_ClockRoot_MAIN                   = 0U, /*!< CMPT mux from MAIN                   */

    /* CMPT ROOT 1 CPU */
    kCLOCK_CPU_ClockRoot_CPU                     = 0U, /*!< CPU mux from CPU                     */

    /* CMPT ROOT 2 NPU */
    kCLOCK_NPU_ClockRoot_NPU                     = 0U, /*!< NPU mux from NPU                     */

    /* CMPT ROOT 3 SYSTICK0 */
    kCLOCK_SYSTICK0_ClockRoot_LP1M_CORE          = 0U, /*!< SYSTICK0 mux from LP1M_CORE          */
    kCLOCK_SYSTICK0_ClockRoot_SXOSC              = 1U, /*!< SYSTICK0 mux from SXOSC              */
    kCLOCK_SYSTICK0_ClockRoot_PERI4              = 2U, /*!< SYSTICK0 mux from PERI4              */
    kCLOCK_SYSTICK0_ClockRoot_MAINPLLDIV10       = 3U, /*!< SYSTICK0 mux from MAINPLLDIV10       */

    /* CMPT ROOT 4 SYSTICK1 */
    kCLOCK_SYSTICK1_ClockRoot_LP1M_CORE          = 0U, /*!< SYSTICK1 mux from LP1M_CORE          */
    kCLOCK_SYSTICK1_ClockRoot_SXOSC              = 1U, /*!< SYSTICK1 mux from SXOSC              */
    kCLOCK_SYSTICK1_ClockRoot_PERI4              = 2U, /*!< SYSTICK1 mux from PERI4              */
    kCLOCK_SYSTICK1_ClockRoot_MAINPLLDIV10       = 3U, /*!< SYSTICK1 mux from MAINPLLDIV10       */

    /*
     * MAIN Clock Roots
     */
    /* MAIN ROOT 0 MAIN/MAIN_DIV */
    kCLOCK_MAIN_ClockRoot_MAIN                   = 0U, /*!< MAIN mux from MAIN                   */
    kCLOCK_MAIN_ClockRoot_TIE_LOW                = 1U, /*!< MAIN mux from TIE_LOW                */

    /* MAIN ROOT 1 XSPI0 */
    kCLOCK_XSPI0_ClockRoot_MAIN_PERI0_DIV2       = 0U, /*!< XSPI0 mux from MAIN_PERI0_DIV2       */
    kCLOCK_XSPI0_ClockRoot_MAINPFDX_DIV2         = 1U, /*!< XSPI0 mux from MAINPFDX_DIV2         */
    kCLOCK_XSPI0_ClockRoot_SYSPLLDIV4            = 2U, /*!< XSPI0 mux from SYSPLLDIV4            */
    kCLOCK_XSPI0_ClockRoot_SYSPLLDIV5            = 3U, /*!< XSPI0 mux from SYSPLLDIV5            */

    /* MAIN ROOT 2 XSPI1 */
    kCLOCK_XSPI1_ClockRoot_MAIN_PERI1_DIV2       = 0U, /*!< XSPI1 mux from MAIN_PERI1_DIV2       */
    kCLOCK_XSPI1_ClockRoot_MAINPFDX_DIV2         = 1U, /*!< XSPI1 mux from MAINPFDX_DIV2         */
    kCLOCK_XSPI1_ClockRoot_SYSPLLDIV4            = 2U, /*!< XSPI1 mux from SYSPLLDIV4            */
    kCLOCK_XSPI1_ClockRoot_SYSPLLDIV5            = 3U, /*!< XSPI1 mux from SYSPLLDIV5            */

    /* MAIN ROOT 3 I3C0 */
    kCLOCK_I3C0_ClockRoot_PERI3                  = 0U, /*!< I3C0 mux from PERI3                  */
    kCLOCK_I3C0_ClockRoot_PERI4                  = 1U, /*!< I3C0 mux from PERI4                  */
    kCLOCK_I3C0_ClockRoot_FRO192M                = 2U, /*!< I3C0 mux from FRO192M                */
    kCLOCK_I3C0_ClockRoot_SXOSC                  = 3U, /*!< I3C0 mux from SXOSC                  */

    /* MAIN ROOT 4 LPI2C0 */
    kCLOCK_LPI2C0_ClockRoot_PERI3                = 0U, /*!< LPI2C0 mux from PERI3                */
    kCLOCK_LPI2C0_ClockRoot_PERI4                = 1U, /*!< LPI2C0 mux from PERI4                */
    kCLOCK_LPI2C0_ClockRoot_FRO192M              = 2U, /*!< LPI2C0 mux from FRO192M              */
    kCLOCK_LPI2C0_ClockRoot_SXOSC                = 3U, /*!< LPI2C0 mux from SXOSC                */

    /* MAIN ROOT 5 LPI2C1 */
    kCLOCK_LPI2C1_ClockRoot_PERI3                = 0U, /*!< LPI2C1 mux from PERI3                */
    kCLOCK_LPI2C1_ClockRoot_PERI4                = 1U, /*!< LPI2C1 mux from PERI4                */
    kCLOCK_LPI2C1_ClockRoot_FRO192M              = 2U, /*!< LPI2C1 mux from FRO192M              */
    kCLOCK_LPI2C1_ClockRoot_SXOSC                = 3U, /*!< LPI2C1 mux from SXOSC                */

    /* MAIN ROOT 6 LPSPI0 */
    kCLOCK_LPSPI0_ClockRoot_PERI2                = 0U, /*!< LPSPI0 mux from PERI2                */
    kCLOCK_LPSPI0_ClockRoot_PERI4                = 1U, /*!< LPSPI0 mux from PERI4                */
    kCLOCK_LPSPI0_ClockRoot_FRO192M              = 2U, /*!< LPSPI0 mux from FRO192M              */
    kCLOCK_LPSPI0_ClockRoot_MAINDIVX             = 3U, /*!< LPSPI0 mux from MAINDIVX             */

    /* MAIN ROOT 7 LPSPI1 */
    kCLOCK_LPSPI1_ClockRoot_PERI2                = 0U, /*!< LPSPI1 mux from PERI2                */
    kCLOCK_LPSPI1_ClockRoot_PERI4                = 1U, /*!< LPSPI1 mux from PERI4                */
    kCLOCK_LPSPI1_ClockRoot_FRO192M              = 2U, /*!< LPSPI1 mux from FRO192M              */
    kCLOCK_LPSPI1_ClockRoot_MAINDIVX             = 3U, /*!< LPSPI1 mux from MAINDIVX             */

    /* MAIN ROOT 8 LPSPI2 */
    kCLOCK_LPSPI2_ClockRoot_PERI2                = 0U, /*!< LPSPI2 mux from PERI2                */
    kCLOCK_LPSPI2_ClockRoot_PERI4                = 1U, /*!< LPSPI2 mux from PERI4                */
    kCLOCK_LPSPI2_ClockRoot_FRO192M              = 2U, /*!< LPSPI2 mux from FRO192M              */
    kCLOCK_LPSPI2_ClockRoot_MAINDIVX             = 3U, /*!< LPSPI2 mux from MAINDIVX             */

    /* MAIN ROOT 9 LPSPI3 */
    kCLOCK_LPSPI3_ClockRoot_PERI2                = 0U, /*!< LPSPI3 mux from PERI2                */
    kCLOCK_LPSPI3_ClockRoot_PERI4                = 1U, /*!< LPSPI3 mux from PERI4                */
    kCLOCK_LPSPI3_ClockRoot_FRO192M              = 2U, /*!< LPSPI3 mux from FRO192M              */
    kCLOCK_LPSPI3_ClockRoot_MAINDIVX             = 3U, /*!< LPSPI3 mux from MAINDIVX             */

    /* MAIN ROOT 10 LPSPI4 */
    kCLOCK_LPSPI4_ClockRoot_PERI2                = 0U, /*!< LPSPI4 mux from PERI2                */
    kCLOCK_LPSPI4_ClockRoot_PERI4                = 1U, /*!< LPSPI4 mux from PERI4                */
    kCLOCK_LPSPI4_ClockRoot_FRO192M              = 2U, /*!< LPSPI4 mux from FRO192M              */
    kCLOCK_LPSPI4_ClockRoot_MAINDIVX             = 3U, /*!< LPSPI4 mux from MAINDIVX             */

    /* MAIN ROOT 11 LPUART0 */
    kCLOCK_LPUART0_ClockRoot_PERI3               = 0U, /*!< LPUART0 mux from PERI3               */
    kCLOCK_LPUART0_ClockRoot_PERI4               = 1U, /*!< LPUART0 mux from PERI4               */
    kCLOCK_LPUART0_ClockRoot_FRO192M             = 2U, /*!< LPUART0 mux from FRO192M             */
    kCLOCK_LPUART0_ClockRoot_SXOSC               = 3U, /*!< LPUART0 mux from SXOSC               */

    /* MAIN ROOT 12 LPUART1 */
    kCLOCK_LPUART1_ClockRoot_PERI3               = 0U, /*!< LPUART1 mux from PERI3               */
    kCLOCK_LPUART1_ClockRoot_PERI4               = 1U, /*!< LPUART1 mux from PERI4               */
    kCLOCK_LPUART1_ClockRoot_FRO192M             = 2U, /*!< LPUART1 mux from FRO192M             */
    kCLOCK_LPUART1_ClockRoot_SXOSC               = 3U, /*!< LPUART1 mux from SXOSC               */

    /* MAIN ROOT 13 LPUART2 */
    kCLOCK_LPUART2_ClockRoot_PERI3               = 0U, /*!< LPUART2 mux from PERI3               */
    kCLOCK_LPUART2_ClockRoot_PERI4               = 1U, /*!< LPUART2 mux from PERI4               */
    kCLOCK_LPUART2_ClockRoot_FRO192M             = 2U, /*!< LPUART2 mux from FRO192M             */
    kCLOCK_LPUART2_ClockRoot_SXOSC               = 3U, /*!< LPUART2 mux from SXOSC               */

