zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
    /* MAIN ROOT 14 LPUART3 */
    kCLOCK_LPUART3_ClockRoot_PERI3               = 0U, /*!< LPUART3 mux from PERI3               */
    kCLOCK_LPUART3_ClockRoot_PERI4               = 1U, /*!< LPUART3 mux from PERI4               */
    kCLOCK_LPUART3_ClockRoot_FRO192M             = 2U, /*!< LPUART3 mux from FRO192M             */
    kCLOCK_LPUART3_ClockRoot_SXOSC               = 3U, /*!< LPUART3 mux from SXOSC               */

    /* MAIN ROOT 15 LPUART4 */
    kCLOCK_LPUART4_ClockRoot_PERI3               = 0U, /*!< LPUART4 mux from PERI3               */
    kCLOCK_LPUART4_ClockRoot_PERI4               = 1U, /*!< LPUART4 mux from PERI4               */
    kCLOCK_LPUART4_ClockRoot_FRO192M             = 2U, /*!< LPUART4 mux from FRO192M             */
    kCLOCK_LPUART4_ClockRoot_SXOSC               = 3U, /*!< LPUART4 mux from SXOSC               */

    /* MAIN ROOT 16 LPUART5 */
    kCLOCK_LPUART5_ClockRoot_PERI3               = 0U, /*!< LPUART5 mux from PERI3               */
    kCLOCK_LPUART5_ClockRoot_PERI4               = 1U, /*!< LPUART5 mux from PERI4               */
    kCLOCK_LPUART5_ClockRoot_FRO192M             = 2U, /*!< LPUART5 mux from FRO192M             */
    kCLOCK_LPUART5_ClockRoot_SXOSC               = 3U, /*!< LPUART5 mux from SXOSC               */

    /* MAIN ROOT 17 FLEXCAN0 */
    kCLOCK_FLEXCAN0_ClockRoot_PERI1              = 0U, /*!< FLEXCAN0 mux from PERI1              */
    kCLOCK_FLEXCAN0_ClockRoot_PERI4              = 1U, /*!< FLEXCAN0 mux from PERI4              */
    kCLOCK_FLEXCAN0_ClockRoot_FRO192M            = 2U, /*!< FLEXCAN0 mux from FRO192M            */
    kCLOCK_FLEXCAN0_ClockRoot_SXOSC              = 3U, /*!< FLEXCAN0 mux from SXOSC              */

    /* MAIN ROOT 18 FLEXCAN1 */
    kCLOCK_FLEXCAN1_ClockRoot_PERI1              = 0U, /*!< FLEXCAN1 mux from PERI1              */
    kCLOCK_FLEXCAN1_ClockRoot_PERI4              = 1U, /*!< FLEXCAN1 mux from PERI4              */
    kCLOCK_FLEXCAN1_ClockRoot_FRO192M            = 2U, /*!< FLEXCAN1 mux from FRO192M            */
    kCLOCK_FLEXCAN1_ClockRoot_SXOSC              = 3U, /*!< FLEXCAN1 mux from SXOSC              */

    /* MAIN ROOT 19 FLEXCAN2 */
    kCLOCK_FLEXCAN2_ClockRoot_PERI1              = 0U, /*!< FLEXCAN2 mux from PERI1              */
    kCLOCK_FLEXCAN2_ClockRoot_PERI4              = 1U, /*!< FLEXCAN2 mux from PERI4              */
    kCLOCK_FLEXCAN2_ClockRoot_FRO192M            = 2U, /*!< FLEXCAN2 mux from FRO192M            */
    kCLOCK_FLEXCAN2_ClockRoot_SXOSC              = 3U, /*!< FLEXCAN2 mux from SXOSC              */

    /* MAIN ROOT 20 FLEXCAN_GFCLK */
    kCLOCK_FLEXCAN_GFCLK_ClockRoot_PERI1         = 0U, /*!< FLEXCAN_GFCLK mux from PERI1         */
    kCLOCK_FLEXCAN_GFCLK_ClockRoot_PERI4         = 1U, /*!< FLEXCAN_GFCLK mux from PERI4         */
    kCLOCK_FLEXCAN_GFCLK_ClockRoot_FRO192M       = 2U, /*!< FLEXCAN_GFCLK mux from FRO192M       */
    kCLOCK_FLEXCAN_GFCLK_ClockRoot_SXOSC         = 3U, /*!< FLEXCAN_GFCLK mux from SXOSC         */

    /* MAIN ROOT 21 QTPM0 */
    kCLOCK_QTPM0_ClockRoot_PERI3                 = 0U, /*!< QTPM0 mux from PERI3                 */
    kCLOCK_QTPM0_ClockRoot_PERI5                 = 1U, /*!< QTPM0 mux from PERI5                 */
    kCLOCK_QTPM0_ClockRoot_FRO192M               = 2U, /*!< QTPM0 mux from FRO192M               */
    kCLOCK_QTPM0_ClockRoot_SXOSC                 = 3U, /*!< QTPM0 mux from SXOSC                 */

    /* MAIN ROOT 22 LPIT0 */
    kCLOCK_LPIT0_ClockRoot_PERI3                 = 0U, /*!< LPIT0 mux from PERI3                 */
    kCLOCK_LPIT0_ClockRoot_PERI5                 = 1U, /*!< LPIT0 mux from PERI5                 */
    kCLOCK_LPIT0_ClockRoot_FRO192M               = 2U, /*!< LPIT0 mux from FRO192M               */
    kCLOCK_LPIT0_ClockRoot_MAINPLLDIV10          = 3U, /*!< LPIT0 mux from MAINPLLDIV10          */

    /* MAIN ROOT 23 LPIT1 */
    kCLOCK_LPIT1_ClockRoot_PERI3                 = 0U, /*!< LPIT1 mux from PERI3                 */
    kCLOCK_LPIT1_ClockRoot_PERI5                 = 1U, /*!< LPIT1 mux from PERI5                 */
    kCLOCK_LPIT1_ClockRoot_FRO192M               = 2U, /*!< LPIT1 mux from FRO192M               */
    kCLOCK_LPIT1_ClockRoot_MAINPLLDIV10          = 3U, /*!< LPIT1 mux from MAINPLLDIV10          */

    /* MAIN ROOT 24 ADC0 */
    kCLOCK_ADC0_ClockRoot_PERI3                  = 0U, /*!< ADC0 mux from PERI3                  */
    kCLOCK_ADC0_ClockRoot_PERI5                  = 1U, /*!< ADC0 mux from PERI5                  */
    kCLOCK_ADC0_ClockRoot_FRO192M                = 2U, /*!< ADC0 mux from FRO192M                */
    kCLOCK_ADC0_ClockRoot_MAINPLLDIV10           = 3U, /*!< ADC0 mux from MAINPLLDIV10           */

    /* MAIN ROOT 25 ADC1 */
    kCLOCK_ADC1_ClockRoot_PERI3                  = 0U, /*!< ADC1 mux from PERI3                  */
    kCLOCK_ADC1_ClockRoot_PERI5                  = 1U, /*!< ADC1 mux from PERI5                  */
    kCLOCK_ADC1_ClockRoot_FRO192M                = 2U, /*!< ADC1 mux from FRO192M                */
    kCLOCK_ADC1_ClockRoot_MAINPLLDIV10           = 3U, /*!< ADC1 mux from MAINPLLDIV10           */

    /* MAIN ROOT 26 SINC0 */
    kCLOCK_SINC0_ClockRoot_PERI3                 = 0U, /*!< SINC0 mux from PERI3                 */
    kCLOCK_SINC0_ClockRoot_PERI5                 = 1U, /*!< SINC0 mux from PERI5                 */
    kCLOCK_SINC0_ClockRoot_FRO192M               = 2U, /*!< SINC0 mux from FRO192M               */
    kCLOCK_SINC0_ClockRoot_MAINPLLDIV10          = 3U, /*!< SINC0 mux from MAINPLLDIV10          */

    /* MAIN ROOT 27 SINC1 */
    kCLOCK_SINC1_ClockRoot_PERI3                 = 0U, /*!< SINC1 mux from PERI3                 */
    kCLOCK_SINC1_ClockRoot_PERI5                 = 1U, /*!< SINC1 mux from PERI5                 */
    kCLOCK_SINC1_ClockRoot_FRO192M               = 2U, /*!< SINC1 mux from FRO192M               */
    kCLOCK_SINC1_ClockRoot_MAINPLLDIV10          = 3U, /*!< SINC1 mux from MAINPLLDIV10          */

