zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
    /* MAIN ROOT 28 FLEXIO0 */
    kCLOCK_FLEXIO0_ClockRoot_PERI0               = 0U, /*!< FLEXIO0 mux from PERI0               */
    kCLOCK_FLEXIO0_ClockRoot_PERI5               = 1U, /*!< FLEXIO0 mux from PERI5               */
    kCLOCK_FLEXIO0_ClockRoot_FRO192M             = 2U, /*!< FLEXIO0 mux from FRO192M             */
    kCLOCK_FLEXIO0_ClockRoot_MAINDIVX            = 3U, /*!< FLEXIO0 mux from MAINDIVX            */

    /* MAIN ROOT 29 FLEXIO1 */
    kCLOCK_FLEXIO1_ClockRoot_PERI0               = 0U, /*!< FLEXIO1 mux from PERI0               */
    kCLOCK_FLEXIO1_ClockRoot_PERI5               = 1U, /*!< FLEXIO1 mux from PERI5               */
    kCLOCK_FLEXIO1_ClockRoot_FRO192M             = 2U, /*!< FLEXIO1 mux from FRO192M             */
    kCLOCK_FLEXIO1_ClockRoot_MAINDIVX            = 3U, /*!< FLEXIO1 mux from MAINDIVX            */

    /* MAIN ROOT 30 FLEXIO2 */
    kCLOCK_FLEXIO2_ClockRoot_PERI0               = 0U, /*!< FLEXIO2 mux from PERI0               */
    kCLOCK_FLEXIO2_ClockRoot_PERI5               = 1U, /*!< FLEXIO2 mux from PERI5               */
    kCLOCK_FLEXIO2_ClockRoot_FRO192M             = 2U, /*!< FLEXIO2 mux from FRO192M             */
    kCLOCK_FLEXIO2_ClockRoot_MAINDIVX            = 3U, /*!< FLEXIO2 mux from MAINDIVX            */

    /* MAIN ROOT 31 TPIU */
    kCLOCK_TPIU_ClockRoot_PERI3                  = 0U, /*!< TPIU mux from PERI3                  */
    kCLOCK_TPIU_ClockRoot_SYSPLLDIV4             = 1U, /*!< TPIU mux from SYSPLLDIV4             */
    kCLOCK_TPIU_ClockRoot_FRO192M                = 2U, /*!< TPIU mux from FRO192M                */
    kCLOCK_TPIU_ClockRoot_MAINDIVX               = 3U, /*!< TPIU mux from MAINDIVX               */

    /* MAIN ROOT 32 CSSI_REFCLK */
    kCLOCK_CSSI_REFCLK_ClockRoot_FRO96M          = 0U, /*!< CSSI_REFCLK mux from FRO96M          */
    kCLOCK_CSSI_REFCLK_ClockRoot_MAINPLLDIV10    = 1U, /*!< CSSI_REFCLK mux from MAINPLLDIV10    */
    kCLOCK_CSSI_REFCLK_ClockRoot_TIE_LOW         = 2U, /*!< CSSI_REFCLK mux from TIE_LOW         */

    /* MAIN ROOT 33 OTP */
    kCLOCK_OTP_ClockRoot_SXOSC                   = 0U, /*!< OTP mux from SXOSC                   */
    kCLOCK_OTP_ClockRoot_MAINPLLDIV10            = 1U, /*!< OTP mux from MAINPLLDIV10            */
    kCLOCK_OTP_ClockRoot_FRO192M                 = 2U, /*!< OTP mux from FRO192M                 */
    kCLOCK_OTP_ClockRoot_FRO24M                  = 3U, /*!< OTP mux from FRO24M                  */

    /* MAIN ROOT 34 CLKOUT */
    kCLOCK_MAIN_CLKOUT_ClockRoot_PERI3           = 0U, /*!< MAIN_CLKOUT mux from PERI3           */
    kCLOCK_MAIN_CLKOUT_ClockRoot_PERI5           = 1U, /*!< MAIN_CLKOUT mux from PERI5           */
    kCLOCK_MAIN_CLKOUT_ClockRoot_FRO192M         = 2U, /*!< MAIN_CLKOUT mux from FRO192M         */
    kCLOCK_MAIN_CLKOUT_ClockRoot_MAINPLLDIV10    = 3U, /*!< MAIN_CLKOUT mux from MAINPLLDIV10    */

    /* MAIN ROOT 35 MAIN_FRO192M */
    kCLOCK_MAIN_MAIN_FRO192M_ClockRoot_FRO192M   = 0U, /*!< MAIN_MAIN_FRO192M mux from FRO192M   */

    /* MAIN ROOT 36 MAIN_ULP32K */
    kCLOCK_MAIN_MAIN_ULP32K_ClockRoot_ULP32K     = 0U, /*!< MAIN_MAIN_ULP32K mux from ULP32K     */

    /*
     * WAKE Clock Roots
     */
    /* WAKE ROOT 0 WAKE */
    kCLOCK_WAKE_ClockRoot_WAKEBUS                = 0U, /*!< WAKE mux from WAKEBUS                */
    kCLOCK_WAKE_ClockRoot_LP12M_WAKE             = 1U, /*!< WAKE mux from LP12M_WAKE             */
    kCLOCK_WAKE_ClockRoot_LP2M_WAKE              = 2U, /*!< WAKE mux from LP2M_WAKE              */

    /* WAKE ROOT 1 WAKE_SXOSC */
    kCLOCK_WAKE_SXOSC_ClockRoot_SXOSC            = 0U, /*!< WAKE_SXOSC mux from SXOSC            */

    /* WAKE ROOT 2 WAKE_LP1M */
    kCLOCK_WAKE_LP1M_ClockRoot_LP1M_WAKE         = 0U, /*!< WAKE_LP1M mux from LP1M_WAKE         */

    /* WAKE ROOT 3 WAKE_LP12M */
    kCLOCK_WAKE_LP12M_ClockRoot_LP12M_WAKE       = 0U, /*!< WAKE_LP12M mux from LP12M_WAKE       */

    /* WAKE ROOT 4 WAKE_ULP32K */
    kCLOCK_WAKE_ULP32K_ClockRoot_ULP32K          = 0U, /*!< WAKE_ULP32K mux from ULP32K          */

    /* WAKE ROOT 5 WAKE_LPCLK */
    kCLOCK_WAKE_LPCLK_ClockRoot_LP1M_WAKE        = 0U, /*!< WAKE_LPCLK mux from LP1M_WAKE        */
    kCLOCK_WAKE_LPCLK_ClockRoot_LP12M_WAKE       = 1U, /*!< WAKE_LPCLK mux from LP12M_WAKE       */
    kCLOCK_WAKE_LPCLK_ClockRoot_LP2M_WAKE        = 2U, /*!< WAKE_LPCLK mux from LP2M_WAKE        */

    /* WAKE ROOT 6 I3C0 (WAKE domain) */
    kCLOCK_WAKE_I3C0_ClockRoot_PERI7             = 0U, /*!< WAKE I3C0 mux from PERI7             */
    kCLOCK_WAKE_I3C0_ClockRoot_FRO24M            = 1U, /*!< WAKE I3C0 mux from FRO24M            */
    kCLOCK_WAKE_I3C0_ClockRoot_WAKE_LPCLK        = 2U, /*!< WAKE I3C0 mux from WAKE_LPCLK        */
    kCLOCK_WAKE_I3C0_ClockRoot_SXOSC             = 3U, /*!< WAKE I3C0 mux from SXOSC             */

    /* WAKE ROOT 7 LPI2C0 (WAKE domain) */
    kCLOCK_WAKE_LPI2C0_ClockRoot_PERI7           = 0U, /*!< WAKE LPI2C0 mux from PERI7           */
    kCLOCK_WAKE_LPI2C0_ClockRoot_FRO24M          = 1U, /*!< WAKE LPI2C0 mux from FRO24M          */
    kCLOCK_WAKE_LPI2C0_ClockRoot_WAKE_LPCLK      = 2U, /*!< WAKE LPI2C0 mux from WAKE_LPCLK      */
    kCLOCK_WAKE_LPI2C0_ClockRoot_SXOSC           = 3U, /*!< WAKE LPI2C0 mux from SXOSC           */

    /* WAKE ROOT 8 LPI2C1 (WAKE domain) */
    kCLOCK_WAKE_LPI2C1_ClockRoot_PERI7           = 0U, /*!< WAKE LPI2C1 mux from PERI7           */
    kCLOCK_WAKE_LPI2C1_ClockRoot_FRO24M          = 1U, /*!< WAKE LPI2C1 mux from FRO24M          */
    kCLOCK_WAKE_LPI2C1_ClockRoot_WAKE_LPCLK      = 2U, /*!< WAKE LPI2C1 mux from WAKE_LPCLK      */
    kCLOCK_WAKE_LPI2C1_ClockRoot_SXOSC           = 3U, /*!< WAKE LPI2C1 mux from SXOSC           */

    /* WAKE ROOT 9 LPSPI0 (WAKE domain) */
    kCLOCK_WAKE_LPSPI0_ClockRoot_PERI7           = 0U, /*!< WAKE LPSPI0 mux from PERI7           */
    kCLOCK_WAKE_LPSPI0_ClockRoot_FRO24M          = 1U, /*!< WAKE LPSPI0 mux from FRO24M          */
    kCLOCK_WAKE_LPSPI0_ClockRoot_WAKE_LPCLK      = 2U, /*!< WAKE LPSPI0 mux from WAKE_LPCLK      */
    kCLOCK_WAKE_LPSPI0_ClockRoot_SXOSC           = 3U, /*!< WAKE LPSPI0 mux from SXOSC           */

