zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
    /* WAKE ROOT 10 LPUART0 (WAKE domain) */
    kCLOCK_WAKE_LPUART0_ClockRoot_PERI7          = 0U, /*!< WAKE LPUART0 mux from PERI7          */
    kCLOCK_WAKE_LPUART0_ClockRoot_FRO24M         = 1U, /*!< WAKE LPUART0 mux from FRO24M         */
    kCLOCK_WAKE_LPUART0_ClockRoot_WAKE_LPCLK     = 2U, /*!< WAKE LPUART0 mux from WAKE_LPCLK     */
    kCLOCK_WAKE_LPUART0_ClockRoot_ULP32K         = 3U, /*!< WAKE LPUART0 mux from ULP32K         */

    /* WAKE ROOT 11 LPUART1 (WAKE domain) */
    kCLOCK_WAKE_LPUART1_ClockRoot_PERI7          = 0U, /*!< WAKE LPUART1 mux from PERI7          */
    kCLOCK_WAKE_LPUART1_ClockRoot_FRO24M         = 1U, /*!< WAKE LPUART1 mux from FRO24M         */
    kCLOCK_WAKE_LPUART1_ClockRoot_WAKE_LPCLK     = 2U, /*!< WAKE LPUART1 mux from WAKE_LPCLK     */
    kCLOCK_WAKE_LPUART1_ClockRoot_ULP32K         = 3U, /*!< WAKE LPUART1 mux from ULP32K         */

    /* WAKE ROOT 12 DMIC1_APPCLK */
    kCLOCK_DMIC1_APPCLK_ClockRoot_PERI7          = 0U, /*!< DMIC1_APPCLK mux from PERI7          */
    kCLOCK_DMIC1_APPCLK_ClockRoot_AUDIO          = 1U, /*!< DMIC1_APPCLK mux from AUDIO          */
    kCLOCK_DMIC1_APPCLK_ClockRoot_WAKE_LPCLK     = 2U, /*!< DMIC1_APPCLK mux from WAKE_LPCLK     */
    kCLOCK_DMIC1_APPCLK_ClockRoot_SAIMCLK        = 3U, /*!< DMIC1_APPCLK mux from SAIMCLK        */

    /* WAKE ROOT 13 QTPM0 */
    kCLOCK_QTPM0_ClockRoot_PERI7                 = 0U, /*!< QTPM0 mux from PERI7                 */
    kCLOCK_QTPM0_ClockRoot_AUDIO                 = 1U, /*!< QTPM0 mux from AUDIO                 */
    kCLOCK_QTPM0_ClockRoot_WAKE_LPCLK            = 2U, /*!< QTPM0 mux from WAKE_LPCLK            */
    kCLOCK_QTPM0_ClockRoot_ULP32K                = 3U, /*!< QTPM0 mux from ULP32K                */

    /* WAKE ROOT 14 LPTMR0 */
    kCLOCK_LPTMR0_ClockRoot_ULP32K               = 0U, /*!< LPTMR0 mux from ULP32K               */
    kCLOCK_LPTMR0_ClockRoot_LP1M_WAKE            = 1U, /*!< LPTMR0 mux from LP1M_WAKE            */
    kCLOCK_LPTMR0_ClockRoot_WAKE_LPCLK           = 2U, /*!< LPTMR0 mux from WAKE_LPCLK           */
    kCLOCK_LPTMR0_ClockRoot_SXOSC                = 3U, /*!< LPTMR0 mux from SXOSC                */

    /* WAKE ROOT 15 LPTMR1 */
    kCLOCK_LPTMR1_ClockRoot_ULP32K               = 0U, /*!< LPTMR1 mux from ULP32K               */
    kCLOCK_LPTMR1_ClockRoot_LP1M_WAKE            = 1U, /*!< LPTMR1 mux from LP1M_WAKE            */
    kCLOCK_LPTMR1_ClockRoot_WAKE_LPCLK           = 2U, /*!< LPTMR1 mux from WAKE_LPCLK           */
    kCLOCK_LPTMR1_ClockRoot_SXOSC                = 3U, /*!< LPTMR1 mux from SXOSC                */

    /* WAKE ROOT 16 SWT0 */
    kCLOCK_SWT0_ClockRoot_ULP32K                 = 0U, /*!< SWT0 mux from ULP32K                 */
    kCLOCK_SWT0_ClockRoot_LP1M_WAKE              = 1U, /*!< SWT0 mux from LP1M_WAKE              */
    kCLOCK_SWT0_ClockRoot_TIE_LOW                = 2U, /*!< SWT0 mux from TIE_LOW                */

    /* WAKE ROOT 17 SWT1 */
    kCLOCK_SWT1_ClockRoot_ULP32K                 = 0U, /*!< SWT1 mux from ULP32K                 */
    kCLOCK_SWT1_ClockRoot_LP1M_WAKE              = 1U, /*!< SWT1 mux from LP1M_WAKE              */
    kCLOCK_SWT1_ClockRoot_TIE_LOW                = 2U, /*!< SWT1 mux from TIE_LOW                */

    /* WAKE ROOT 18 EWM */
    kCLOCK_EWM_ClockRoot_ULP32K                  = 0U, /*!< EWM mux from ULP32K                  */
    kCLOCK_EWM_ClockRoot_LP1M_WAKE               = 1U, /*!< EWM mux from LP1M_WAKE               */
    kCLOCK_EWM_ClockRoot_TIE_LOW                 = 2U, /*!< EWM mux from TIE_LOW                 */

    /* WAKE ROOT 19 ACMP0 */
    kCLOCK_ACMP0_ClockRoot_PERI7                 = 0U, /*!< ACMP0 mux from PERI7                 */
    kCLOCK_ACMP0_ClockRoot_FRO24M                = 1U, /*!< ACMP0 mux from FRO24M                */
    kCLOCK_ACMP0_ClockRoot_WAKE_LPCLK            = 2U, /*!< ACMP0 mux from WAKE_LPCLK            */
    kCLOCK_ACMP0_ClockRoot_SXOSC                 = 3U, /*!< ACMP0 mux from SXOSC                 */

    /* WAKE ROOT 20 ACMP1 */
    kCLOCK_ACMP1_ClockRoot_PERI7                 = 0U, /*!< ACMP1 mux from PERI7                 */
    kCLOCK_ACMP1_ClockRoot_FRO24M                = 1U, /*!< ACMP1 mux from FRO24M                */
    kCLOCK_ACMP1_ClockRoot_WAKE_LPCLK            = 2U, /*!< ACMP1 mux from WAKE_LPCLK            */
    kCLOCK_ACMP1_ClockRoot_SXOSC                 = 3U, /*!< ACMP1 mux from SXOSC                 */

    /* WAKE ROOT 21 ACMP2 */
    kCLOCK_ACMP2_ClockRoot_PERI7                 = 0U, /*!< ACMP2 mux from PERI7                 */
    kCLOCK_ACMP2_ClockRoot_FRO24M                = 1U, /*!< ACMP2 mux from FRO24M                */
    kCLOCK_ACMP2_ClockRoot_WAKE_LPCLK            = 2U, /*!< ACMP2 mux from WAKE_LPCLK            */
    kCLOCK_ACMP2_ClockRoot_SXOSC                 = 3U, /*!< ACMP2 mux from SXOSC                 */

    /* WAKE ROOT 22 ACMP3 */
    kCLOCK_ACMP3_ClockRoot_PERI7                 = 0U, /*!< ACMP3 mux from PERI7                 */
    kCLOCK_ACMP3_ClockRoot_FRO24M                = 1U, /*!< ACMP3 mux from FRO24M                */
    kCLOCK_ACMP3_ClockRoot_WAKE_LPCLK            = 2U, /*!< ACMP3 mux from WAKE_LPCLK            */
    kCLOCK_ACMP3_ClockRoot_SXOSC                 = 3U, /*!< ACMP3 mux from SXOSC                 */

    /* WAKE ROOT 23 ACMP0_RRCLK */
    kCLOCK_ACMP0_RRCLK_ClockRoot_ULP32K          = 0U, /*!< ACMP0_RRCLK mux from ULP32K          */
    kCLOCK_ACMP0_RRCLK_ClockRoot_FRO24M          = 1U, /*!< ACMP0_RRCLK mux from FRO24M          */
    kCLOCK_ACMP0_RRCLK_ClockRoot_WAKE_LPCLK      = 2U, /*!< ACMP0_RRCLK mux from WAKE_LPCLK      */
    kCLOCK_ACMP0_RRCLK_ClockRoot_LP1M_WAKE       = 3U, /*!< ACMP0_RRCLK mux from LP1M_WAKE       */

    /* WAKE ROOT 24 ACMP1_RRCLK */
    kCLOCK_ACMP1_RRCLK_ClockRoot_ULP32K          = 0U, /*!< ACMP1_RRCLK mux from ULP32K          */
    kCLOCK_ACMP1_RRCLK_ClockRoot_FRO24M          = 1U, /*!< ACMP1_RRCLK mux from FRO24M          */
    kCLOCK_ACMP1_RRCLK_ClockRoot_WAKE_LPCLK      = 2U, /*!< ACMP1_RRCLK mux from WAKE_LPCLK      */
    kCLOCK_ACMP1_RRCLK_ClockRoot_LP1M_WAKE       = 3U, /*!< ACMP1_RRCLK mux from LP1M_WAKE       */

    /* WAKE ROOT 25 ACMP2_RRCLK */
    kCLOCK_ACMP2_RRCLK_ClockRoot_ULP32K          = 0U, /*!< ACMP2_RRCLK mux from ULP32K          */
    kCLOCK_ACMP2_RRCLK_ClockRoot_FRO24M          = 1U, /*!< ACMP2_RRCLK mux from FRO24M          */
    kCLOCK_ACMP2_RRCLK_ClockRoot_WAKE_LPCLK      = 2U, /*!< ACMP2_RRCLK mux from WAKE_LPCLK      */
    kCLOCK_ACMP2_RRCLK_ClockRoot_LP1M_WAKE       = 3U, /*!< ACMP2_RRCLK mux from LP1M_WAKE       */

    /* WAKE ROOT 26 ACMP3_RRCLK */
    kCLOCK_ACMP3_RRCLK_ClockRoot_ULP32K          = 0U, /*!< ACMP3_RRCLK mux from ULP32K          */
    kCLOCK_ACMP3_RRCLK_ClockRoot_FRO24M          = 1U, /*!< ACMP3_RRCLK mux from FRO24M          */
    kCLOCK_ACMP3_RRCLK_ClockRoot_WAKE_LPCLK      = 2U, /*!< ACMP3_RRCLK mux from WAKE_LPCLK      */
    kCLOCK_ACMP3_RRCLK_ClockRoot_LP1M_WAKE       = 3U, /*!< ACMP3_RRCLK mux from LP1M_WAKE       */

