zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
    /*
     * COMM Clock Roots
     */
    /* COMM ROOT 0 COMM */
    kCLOCK_COMM_ClockRoot_COMMBUS                = 0U, /*!< COMM mux from COMMBUS                */

    /* COMM ROOT 1 COMM_ULP32K */
    kCLOCK_COMM_ULP32K_ClockRoot_ULP32K          = 0U, /*!< COMM_ULP32K mux from ULP32K          */

    /* COMM ROOT 2 USDHC0 */
    kCLOCK_USDHC0_ClockRoot_COMM_PERI1_DIV2      = 0U, /*!< USDHC0 mux from COMM_PERI1_DIV2      */
    kCLOCK_USDHC0_ClockRoot_COMMPFDX_DIV2        = 1U, /*!< USDHC0 mux from COMMPFDX_DIV2        */
    kCLOCK_USDHC0_ClockRoot_SYSPLLDIV4           = 2U, /*!< USDHC0 mux from SYSPLLDIV4           */
    kCLOCK_USDHC0_ClockRoot_SYSPLLDIV5           = 3U, /*!< USDHC0 mux from SYSPLLDIV5           */

    /* COMM ROOT 3 USDHC1 */
    kCLOCK_USDHC1_ClockRoot_COMM_PERI2_DIV2      = 0U, /*!< USDHC1 mux from COMM_PERI2_DIV2      */
    kCLOCK_USDHC1_ClockRoot_COMMPFDX_DIV2        = 1U, /*!< USDHC1 mux from COMMPFDX_DIV2        */
    kCLOCK_USDHC1_ClockRoot_SYSPLLDIV4           = 2U, /*!< USDHC1 mux from SYSPLLDIV4           */
    kCLOCK_USDHC1_ClockRoot_SYSPLLDIV5           = 3U, /*!< USDHC1 mux from SYSPLLDIV5           */

    /* COMM ROOT 4 XSPIR */
    kCLOCK_XSPIR_ClockRoot_PERI1                 = 0U, /*!< XSPIR mux from PERI1                 */
    kCLOCK_XSPIR_ClockRoot_PERI2                 = 1U, /*!< XSPIR mux from PERI2                 */
    kCLOCK_XSPIR_ClockRoot_SYSPLLDIV4            = 2U, /*!< XSPIR mux from SYSPLLDIV4            */
    kCLOCK_XSPIR_ClockRoot_SYSPLLDIV5            = 3U, /*!< XSPIR mux from SYSPLLDIV5            */

    /* COMM ROOT 5 USB0_PHYCLK */
    kCLOCK_USB0_PHYCLK_ClockRoot_SXOSC           = 0U, /*!< USB0_PHYCLK mux from SXOSC           */

    /* COMM ROOT 6 USB0_FRO48M */
    kCLOCK_USB0_FRO48M_ClockRoot_FRO48M          = 0U, /*!< USB0_FRO48M mux from FRO48M          */

    /* COMM ROOT 7 USB1 */
    kCLOCK_USB1_ClockRoot_USB1                   = 0U, /*!< USB1 mux from USB1                   */
    kCLOCK_USB1_ClockRoot_USBPLL_OUT             = 1U, /*!< USB1 mux from USBPLL_OUT             */
    kCLOCK_USB1_ClockRoot_USBPLL_48M             = 2U, /*!< USB1 mux from USBPLL_48M             */
    kCLOCK_USB1_ClockRoot_FRO48M                 = 3U, /*!< USB1 mux from FRO48M                 */

    /* COMM ROOT 8 USB0_WAKECLK */
    kCLOCK_USB0_WAKECLK_ClockRoot_ULP32K         = 0U, /*!< USB0_WAKECLK mux from ULP32K         */
    kCLOCK_USB0_WAKECLK_ClockRoot_LP1M_CORE      = 1U, /*!< USB0_WAKECLK mux from LP1M_CORE      */
    kCLOCK_USB0_WAKECLK_ClockRoot_SXOSC          = 2U, /*!< USB0_WAKECLK mux from SXOSC          */
    kCLOCK_USB0_WAKECLK_ClockRoot_TIE_LOW        = 3U, /*!< USB0_WAKECLK mux from TIE_LOW        */

    /* COMM ROOT 9 ETH0_TRXCLK */
    kCLOCK_ETH0_TRXCLK_ClockRoot_COMMBUS         = 0U, /*!< ETH0_TRXCLK mux from COMMBUS         */
    kCLOCK_ETH0_TRXCLK_ClockRoot_ETH             = 1U, /*!< ETH0_TRXCLK mux from ETH             */
    kCLOCK_ETH0_TRXCLK_ClockRoot_SYSPLLDIV4      = 2U, /*!< ETH0_TRXCLK mux from SYSPLLDIV4      */
    kCLOCK_ETH0_TRXCLK_ClockRoot_MAINPLLDIV8     = 3U, /*!< ETH0_TRXCLK mux from MAINPLLDIV8     */

    /* COMM ROOT 10 ETH0_TIMERCLK */
    kCLOCK_ETH0_TIMERCLK_ClockRoot_COMMBUS       = 0U, /*!< ETH0_TIMERCLK mux from COMMBUS       */
    kCLOCK_ETH0_TIMERCLK_ClockRoot_ETH           = 1U, /*!< ETH0_TIMERCLK mux from ETH           */
    kCLOCK_ETH0_TIMERCLK_ClockRoot_SXOSC         = 2U, /*!< ETH0_TIMERCLK mux from SXOSC         */
    kCLOCK_ETH0_TIMERCLK_ClockRoot_MAINPLLDIV8   = 3U, /*!< ETH0_TIMERCLK mux from MAINPLLDIV8   */

    /* COMM ROOT 11 ETH1_TRXCLK */
    kCLOCK_ETH1_TRXCLK_ClockRoot_COMMBUS         = 0U, /*!< ETH1_TRXCLK mux from COMMBUS         */
    kCLOCK_ETH1_TRXCLK_ClockRoot_ETH             = 1U, /*!< ETH1_TRXCLK mux from ETH             */
    kCLOCK_ETH1_TRXCLK_ClockRoot_SYSPLLDIV4      = 2U, /*!< ETH1_TRXCLK mux from SYSPLLDIV4      */
    kCLOCK_ETH1_TRXCLK_ClockRoot_MAINPLLDIV8     = 3U, /*!< ETH1_TRXCLK mux from MAINPLLDIV8     */

    /* COMM ROOT 12 ETH1_TIMERCLK */
    kCLOCK_ETH1_TIMERCLK_ClockRoot_COMMBUS       = 0U, /*!< ETH1_TIMERCLK mux from COMMBUS       */
    kCLOCK_ETH1_TIMERCLK_ClockRoot_ETH           = 1U, /*!< ETH1_TIMERCLK mux from ETH           */
    kCLOCK_ETH1_TIMERCLK_ClockRoot_SXOSC         = 2U, /*!< ETH1_TIMERCLK mux from SXOSC         */
    kCLOCK_ETH1_TIMERCLK_ClockRoot_MAINPLLDIV8   = 3U, /*!< ETH1_TIMERCLK mux from MAINPLLDIV8   */

    /* COMM ROOT 13 ETH_REFCLK */
    kCLOCK_ETH_REFCLK_ClockRoot_COMMBUS          = 0U, /*!< ETH_REFCLK mux from COMMBUS          */
    kCLOCK_ETH_REFCLK_ClockRoot_ETH              = 1U, /*!< ETH_REFCLK mux from ETH              */
    kCLOCK_ETH_REFCLK_ClockRoot_SXOSC            = 2U, /*!< ETH_REFCLK mux from SXOSC            */
    kCLOCK_ETH_REFCLK_ClockRoot_MAINPLLDIV8      = 3U, /*!< ETH_REFCLK mux from MAINPLLDIV8      */

    /* COMM ROOT 14 XENO0_LIWCLK */
    kCLOCK_XENO0_LIWCLK_ClockRoot_COMMBUS        = 0U, /*!< XENO0_LIWCLK mux from COMMBUS        */
    kCLOCK_XENO0_LIWCLK_ClockRoot_MAINPLLDIV10   = 1U, /*!< XENO0_LIWCLK mux from MAINPLLDIV10   */
    kCLOCK_XENO0_LIWCLK_ClockRoot_SYSPLLDIV4     = 2U, /*!< XENO0_LIWCLK mux from SYSPLLDIV4     */
    kCLOCK_XENO0_LIWCLK_ClockRoot_SYSPLLDIV5     = 3U, /*!< XENO0_LIWCLK mux from SYSPLLDIV5     */

    /* COMM ROOT 15 XENO1_LIWCLK */
    kCLOCK_XENO1_LIWCLK_ClockRoot_COMMBUS        = 0U, /*!< XENO1_LIWCLK mux from COMMBUS        */
    kCLOCK_XENO1_LIWCLK_ClockRoot_MAINPLLDIV10   = 1U, /*!< XENO1_LIWCLK mux from MAINPLLDIV10   */
    kCLOCK_XENO1_LIWCLK_ClockRoot_SYSPLLDIV4     = 2U, /*!< XENO1_LIWCLK mux from SYSPLLDIV4     */
    kCLOCK_XENO1_LIWCLK_ClockRoot_SYSPLLDIV5     = 3U, /*!< XENO1_LIWCLK mux from SYSPLLDIV5     */

    /* COMM ROOT 16 DLL_REFCLK */
    kCLOCK_DLL_REFCLK_ClockRoot_MAINPLLDIV10     = 0U, /*!< DLL_REFCLK mux from MAINPLLDIV10     */

    /*
     * AUDIO Clock Roots
     */
    /* AUDIO ROOT 0 audio_clk */
    kCLOCK_AUDIO_CLK_ClockRoot_AUDIOBUS          = 0U, /*!< audio_clk mux from AUDIOBUS          */

    /* AUDIO ROOT 1 dmic0_appclk */
    kCLOCK_DMIC0_APPCLK_ClockRoot_PERI6          = 0U, /*!< DMIC0_APPCLK mux from PERI6          */
    kCLOCK_DMIC0_APPCLK_ClockRoot_AUDIOPLL       = 1U, /*!< DMIC0_APPCLK mux from AUDIOPLL       */
    kCLOCK_DMIC0_APPCLK_ClockRoot_AUDIO          = 2U, /*!< DMIC0_APPCLK mux from AUDIO          */
    kCLOCK_DMIC0_APPCLK_ClockRoot_SAIMCLK        = 3U, /*!< DMIC0_APPCLK mux from SAIMCLK        */

    /* AUDIO ROOT 2 sai0_mclk0 */
    kCLOCK_SAI0_MCLK0_ClockRoot_PERI6            = 0U, /*!< sai0_mclk0 mux from PERI6            */
    kCLOCK_SAI0_MCLK0_ClockRoot_AUDIOPLL         = 1U, /*!< sai0_mclk0 mux from AUDIOPLL         */
    kCLOCK_SAI0_MCLK0_ClockRoot_AUDIO            = 2U, /*!< sai0_mclk0 mux from AUDIO            */
    kCLOCK_SAI0_MCLK0_ClockRoot_SAIMCLK0         = 3U, /*!< sai0_mclk0 mux from SAIMCLK0         */

