zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
    /* AUDIO ROOT 3 sai0_mclk1 */
    kCLOCK_SAI0_MCLK1_ClockRoot_PERI6            = 0U, /*!< sai0_mclk1 mux from PERI6            */
    kCLOCK_SAI0_MCLK1_ClockRoot_AUDIOPLL         = 1U, /*!< sai0_mclk1 mux from AUDIOPLL         */
    kCLOCK_SAI0_MCLK1_ClockRoot_AUDIO            = 2U, /*!< sai0_mclk1 mux from AUDIO            */
    kCLOCK_SAI0_MCLK1_ClockRoot_SAIMCLK          = 3U, /*!< sai0_mclk1 mux from SAIMCLK          */

    /* AUDIO ROOT 4 sai1_mclk0 */
    kCLOCK_SAI1_MCLK0_ClockRoot_PERI6            = 0U, /*!< sai1_mclk0 mux from PERI6            */
    kCLOCK_SAI1_MCLK0_ClockRoot_AUDIOPLL         = 1U, /*!< sai1_mclk0 mux from AUDIOPLL         */
    kCLOCK_SAI1_MCLK0_ClockRoot_AUDIO            = 2U, /*!< sai1_mclk0 mux from AUDIO            */
    kCLOCK_SAI1_MCLK0_ClockRoot_SAIMCLK1         = 3U, /*!< sai1_mclk0 mux from SAIMCLK1         */

    /* AUDIO ROOT 5 sai1_mclk1 */
    kCLOCK_SAI1_MCLK1_ClockRoot_PERI6            = 0U, /*!< sai1_mclk1 mux from PERI6            */
    kCLOCK_SAI1_MCLK1_ClockRoot_AUDIOPLL         = 1U, /*!< sai1_mclk1 mux from AUDIOPLL         */
    kCLOCK_SAI1_MCLK1_ClockRoot_AUDIO            = 2U, /*!< sai1_mclk1 mux from AUDIO            */
    kCLOCK_SAI1_MCLK1_ClockRoot_SAIMCLK          = 3U, /*!< sai1_mclk1 mux from SAIMCLK          */

    /* AUDIO ROOT 6 sai2_mclk0 */
    kCLOCK_SAI2_MCLK0_ClockRoot_PERI6            = 0U, /*!< sai2_mclk0 mux from PERI6            */
    kCLOCK_SAI2_MCLK0_ClockRoot_AUDIOPLL         = 1U, /*!< sai2_mclk0 mux from AUDIOPLL         */
    kCLOCK_SAI2_MCLK0_ClockRoot_AUDIO            = 2U, /*!< sai2_mclk0 mux from AUDIO            */
    kCLOCK_SAI2_MCLK0_ClockRoot_SAIMCLK2         = 3U, /*!< sai2_mclk0 mux from SAIMCLK2         */

    /* AUDIO ROOT 7 SAI2_MCLK1 */
    kCLOCK_SAI2_MCLK1_ClockRoot_PERI6            = 0U, /*!< SAI2_MCLK1 mux from PERI6            */
    kCLOCK_SAI2_MCLK1_ClockRoot_AUDIOPLL         = 1U, /*!< SAI2_MCLK1 mux from AUDIOPLL         */
    kCLOCK_SAI2_MCLK1_ClockRoot_AUDIO            = 2U, /*!< SAI2_MCLK1 mux from AUDIO            */
    kCLOCK_SAI2_MCLK1_ClockRoot_SAIMCLK          = 3U, /*!< SAI2_MCLK1 mux from SAIMCLK          */

    /* AUDIO ROOT 8 SPDIF_TXCLK */
    kCLOCK_SPDIF_TXCLK_ClockRoot_PERI6           = 0U, /*!< SPDIF_TXCLK mux from PERI6           */
    kCLOCK_SPDIF_TXCLK_ClockRoot_AUDIOPLL        = 1U, /*!< SPDIF_TXCLK mux from AUDIOPLL        */
    kCLOCK_SPDIF_TXCLK_ClockRoot_AUDIO           = 2U, /*!< SPDIF_TXCLK mux from AUDIO           */
    kCLOCK_SPDIF_TXCLK_ClockRoot_SAIMCLK         = 3U, /*!< SPDIF_TXCLK mux from SAIMCLK         */

    /* AUDIO ROOT 9 SPDIF_CDRCLK */
    kCLOCK_SPDIF_CDRCLK_ClockRoot_PERI6          = 0U, /*!< SPDIF_CDRCLK mux from PERI6          */
    kCLOCK_SPDIF_CDRCLK_ClockRoot_AUDIOPLL       = 1U, /*!< SPDIF_CDRCLK mux from AUDIOPLL       */
    kCLOCK_SPDIF_CDRCLK_ClockRoot_MAINPLLDIV10   = 2U, /*!< SPDIF_CDRCLK mux from MAINPLLDIV10   */
    kCLOCK_SPDIF_CDRCLK_ClockRoot_AUDIOBUS       = 3U, /*!< SPDIF_CDRCLK mux from AUDIOBUS       */

    /* AUDIO ROOT 10 ASRC */
    kCLOCK_ASRC_ClockRoot_PERI6                  = 0U, /*!< ASRC mux from PERI6                  */
    kCLOCK_ASRC_ClockRoot_AUDIOPLL               = 1U, /*!< ASRC mux from AUDIOPLL               */
    kCLOCK_ASRC_ClockRoot_MAINPLLDIV10           = 2U, /*!< ASRC mux from MAINPLLDIV10           */
    kCLOCK_ASRC_ClockRoot_AUDIOBUS               = 3U, /*!< ASRC mux from AUDIOBUS               */

    /*
     * MEDIA Clock Roots
     */
    /* MEDIA ROOT 0 MEDIA */
    kCLOCK_MEDIA_ClockRoot_MEDIABUS              = 0U, /*!< MEDIA mux from MEDIABUS              */

    /* MEDIA ROOT 1 MEDIAPLL */
    kCLOCK_MEDIAPLL_ClockRoot_MAINPLLDIV10       = 0U, /*!< MEDIAPLL mux from MAINPLLDIV10       */
    kCLOCK_MEDIAPLL_ClockRoot_MIPIPLL_DIV8       = 1U, /*!< MEDIAPLL mux from MIPIPLL_DIV8       */

    /* MEDIA ROOT 2 MIPICSI_ESCCLK */
    kCLOCK_MIPICSI_ESCCLK_ClockRoot_PERI5        = 0U, /*!< MIPICSI_ESCCLK mux from PERI5        */
    kCLOCK_MIPICSI_ESCCLK_ClockRoot_VIDEOPLL     = 1U, /*!< MIPICSI_ESCCLK mux from VIDEOPLL     */
    kCLOCK_MIPICSI_ESCCLK_ClockRoot_VIDEO        = 2U, /*!< MIPICSI_ESCCLK mux from VIDEO        */
    kCLOCK_MIPICSI_ESCCLK_ClockRoot_MEDIAPLL     = 3U, /*!< MIPICSI_ESCCLK mux from MEDIAPLL     */

    /* MEDIA ROOT 3 MIPICSI */
    kCLOCK_MIPICSI_ClockRoot_PERI5               = 0U, /*!< MIPICSI mux from PERI5               */
    kCLOCK_MIPICSI_ClockRoot_VIDEOPLL            = 1U, /*!< MIPICSI mux from VIDEOPLL            */
    kCLOCK_MIPICSI_ClockRoot_VIDEO               = 2U, /*!< MIPICSI mux from VIDEO               */
    kCLOCK_MIPICSI_ClockRoot_MEDIAPLL            = 3U, /*!< MIPICSI mux from MEDIAPLL            */

    /* MEDIA ROOT 4 MIPIDSI_ESCCLK */
    kCLOCK_MIPIDSI_ESCCLK_ClockRoot_PERI5        = 0U, /*!< MIPIDSI_ESCCLK mux from PERI5        */
    kCLOCK_MIPIDSI_ESCCLK_ClockRoot_VIDEOPLL     = 1U, /*!< MIPIDSI_ESCCLK mux from VIDEOPLL     */
    kCLOCK_MIPIDSI_ESCCLK_ClockRoot_VIDEO        = 2U, /*!< MIPIDSI_ESCCLK mux from VIDEO        */
    kCLOCK_MIPIDSI_ESCCLK_ClockRoot_MEDIAPLL     = 3U, /*!< MIPIDSI_ESCCLK mux from MEDIAPLL     */

    /* MEDIA ROOT 5 MIPIDSI_REFCLK */
    kCLOCK_MIPIDSI_REFCLK_ClockRoot_SXOSC        = 0U, /*!< MIPIDSI_REFCLK mux from SXOSC        */

    /* MEDIA ROOT 6 MIPIDSI */
    kCLOCK_MIPIDSI_ClockRoot_PERI5               = 0U, /*!< MIPIDSI mux from PERI5               */
    kCLOCK_MIPIDSI_ClockRoot_VIDEOPLL            = 1U, /*!< MIPIDSI mux from VIDEOPLL            */
    kCLOCK_MIPIDSI_ClockRoot_VIDEO               = 2U, /*!< MIPIDSI mux from VIDEO               */
    kCLOCK_MIPIDSI_ClockRoot_MEDIAPLL            = 3U, /*!< MIPIDSI mux from MEDIAPLL            */

    /* MEDIA ROOT 7 REFORMAT */
    kCLOCK_REFORMAT_ClockRoot_PERI5              = 0U, /*!< REFORMAT mux from PERI5              */
    kCLOCK_REFORMAT_ClockRoot_VIDEOPLL           = 1U, /*!< REFORMAT mux from VIDEOPLL           */
    kCLOCK_REFORMAT_ClockRoot_VIDEO              = 2U, /*!< REFORMAT mux from VIDEO              */
    kCLOCK_REFORMAT_ClockRoot_MEDIAPLL           = 3U, /*!< REFORMAT mux from MEDIAPLL           */

