zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
    /* MEDIA ROOT 8 DCPIXEL */
    kCLOCK_DCPIXEL_ClockRoot_PERI5               = 0U, /*!< DCPIXEL mux from PERI5               */
    kCLOCK_DCPIXEL_ClockRoot_VIDEOPLL            = 1U, /*!< DCPIXEL mux from VIDEOPLL            */
    kCLOCK_DCPIXEL_ClockRoot_VIDEO               = 2U, /*!< DCPIXEL mux from VIDEO               */
    kCLOCK_DCPIXEL_ClockRoot_MEDIAPLL            = 3U, /*!< DCPIXEL mux from MEDIAPLL            */

    /* MEDIA ROOT 9 CSI_MCLKOUT */
    kCLOCK_CSI_MCLKOUT_ClockRoot_PERI5           = 0U, /*!< CSI_MCLKOUT mux from PERI5           */
    kCLOCK_CSI_MCLKOUT_ClockRoot_SXOSC           = 1U, /*!< CSI_MCLKOUT mux from SXOSC           */
    kCLOCK_CSI_MCLKOUT_ClockRoot_VIDEO           = 2U, /*!< CSI_MCLKOUT mux from VIDEO           */
    kCLOCK_CSI_MCLKOUT_ClockRoot_MEDIAPLL        = 3U, /*!< CSI_MCLKOUT mux from MEDIAPLL        */
} clock_root_mux_source_t;

/*! @brief CCM gate control value. */
typedef enum _clock_gate_value
{
    kCLOCK_BusOFF_FuncOFF         = 0x0U,    /*!< bus clock OFF, functional clock OFF.*/
    kCLOCK_BusON_FuncON_SLEEP     = 0x1U,    /*!< bus clock ON(OFF in Sleep),functional clock ON(OFF in Sleep).*/
    kCLOCK_BusON_FuncON_DEEPSLEEP = 0x2U,    /*!< bus clock ON(OFF in DeepSleep),functional clock ON(OFF in DeepSleep).*/
    kCLOCK_BusON_FuncON           = 0x3U,    /*!< bus clock ON(OFF in DeepSleep),functional clock ON.*/
} clock_gate_value_t;

#define clock_ip_name_t clock_lpcg_t

/*!
 * @brief Clock name.
 */
typedef enum _clock_name
{
    /* ========================================================================
     * Section A: in-map srcs -- routed through s_clockSrcRootMap[name].
     * Values [0, 48) -- 48 entries: 38 Ox + 1 Case 4 (MAIN) + 1 Lx + 6 Mx.
     *
     * Each row's "Level X ?#" trailing comment is the source's location label
     * in the L1 / L2 clock-tree mux mapping. Sources that only appear at the
     * L0 level have no annotation.
     * ====================================================================== */

    /* --- A.1: L1 Ox CGU passthrough/mux outputs (38) --- */
    kCLOCK_SRC_BASE              = 0,     /*Level 1 O1 */
    kCLOCK_SRC_LOW               = 1,     /*Level 1 O2 */
    kCLOCK_SRC_MAINPLL_DIVX      = 2,     /*Level 1 O3 */
    kCLOCK_SRC_SYSPLL_DIVX       = 3,     /*Level 1 O4 */
    kCLOCK_SRC_PLL_PFDX          = 4,     /*Level 1 O5 */
    kCLOCK_SRC_MEDIA_PFDX        = 5,     /*Level 1 O6 */
    kCLOCK_SRC_MAINDIVX          = 6,     /*Level 1 O9 */
    kCLOCK_SRC_SAIMCLK           = 7,     /*Level 1 O10*/
    kCLOCK_SRC_SAIMCLK0          = 8,     /*Level 1 O11*/
    kCLOCK_SRC_SAIMCLK1          = 9,     /*Level 1 O12*/
    kCLOCK_SRC_SAIMCLK2          = 10,    /*Level 1 O13*/
    kCLOCK_SRC_ULP32K            = 11,    /*Level 1 O16*/
    kCLOCK_SRC_FRO192M           = 12,    /*Level 1 O17*/
    kCLOCK_SRC_FRO96M            = 13,    /*Level 1 O18*/
    kCLOCK_SRC_FRO48M            = 14,    /*Level 1 O19*/
    kCLOCK_SRC_FRO24M            = 15,    /*Level 1 O20*/
    kCLOCK_SRC_SYSPLLDIV4        = 16,    /*Level 1 O21*/
    kCLOCK_SRC_SYSPLLDIV5        = 17,    /*Level 1 O22*/
    kCLOCK_SRC_MAINPLLDIV8       = 18,    /*Level 1 O25*/
    kCLOCK_SRC_MAINPLLDIV10      = 19,    /*Level 1 O26*/
    kCLOCK_SRC_AUDIOPLL          = 20,    /*Level 1 O28*/
    kCLOCK_SRC_VIDEOPLL          = 21,    /*Level 1 O29*/
    kCLOCK_SRC_CPU               = 22,    /*Level 1 O30*/
    kCLOCK_SRC_NPU               = 23,    /*Level 1 O31*/
    kCLOCK_SRC_MEDIABUS          = 24,    /*Level 1 O32*/
    kCLOCK_SRC_AUDIOBUS          = 25,    /*Level 1 O33*/
    kCLOCK_SRC_COMMBUS           = 26,    /*Level 1 O34*/
    kCLOCK_SRC_WAKEBUS           = 27,    /*Level 1 O35*/
    kCLOCK_SRC_PERI0             = 28,    /*Level 1 O37*/
    kCLOCK_SRC_PERI1             = 29,    /*Level 1 O38*/
    kCLOCK_SRC_PERI2             = 30,    /*Level 1 O39*/
    kCLOCK_SRC_PERI3             = 31,    /*Level 1 O40*/
    kCLOCK_SRC_PERI4             = 32,    /*Level 1 O41*/
    kCLOCK_SRC_PERI5             = 33,    /*Level 1 O42*/
    kCLOCK_SRC_PERI6             = 34,    /*Level 1 O43*/
    kCLOCK_SRC_PERI7             = 35,    /*Level 1 O44*/
    kCLOCK_SRC_AUDIO             = 36,    /*Level 1 O45*/
    kCLOCK_SRC_VIDEO             = 37,    /*Level 1 O46*/
    kCLOCK_SRC_USB1              = 38,    /*Level 1 O47*/
    kCLOCK_SRC_ETH               = 39,    /*Level 1 O48*/

    /* --- A.2: Case 4 special alias (1) ---
     * MAIN is labeled O36 (SYSCON_PDMAIN) in the L1 mux mapping, but the
     * runtime resolver routes it to O30 (CGU MAIN root) to match the actual
     * silicon clock topology -- see CLOCK_GetClockSrcFreq. */
    kCLOCK_SRC_MAIN              = 40,    /*Level 1 O36*/ /* resolver routes to O30 */

    /* --- A.3: L2 Lx WAKE-domain SS-output feedback (1) --- */
    kCLOCK_SRC_WAKE_LPCLK        = 41,    /*Level 2 L0 */

    /* --- A.4: Mx MODCON-controlled /2 (6) ---
     * Each entry recurses through its parent root; the /2 selection is read
     * inside CLOCK_GetClockSrcFreq from the canonical MODCON instance. */
    kCLOCK_SRC_MAIN_PERI0_DIV2   = 42,    /*Level 2 M0 */
    kCLOCK_SRC_MAIN_PERI1_DIV2   = 43,    /*Level 2 M2 */
    kCLOCK_SRC_MAINPFDX_DIV2     = 44,    /*Level 2 M1 */
    kCLOCK_SRC_COMM_PERI1_DIV2   = 45,    /*Level 2 M3 */
    kCLOCK_SRC_COMM_PERI2_DIV2   = 46,    /*Level 2 M5 */
    kCLOCK_SRC_COMMPFDX_DIV2     = 47,    /*Level 2 M4 */

    /* ========================================================================
     * Section B: reserved future-in-map slots -- [48, 64), 16 entries.
     * s_clockSrcRootMap[48..63] is implicitly kCLOCK_Root_Invalid; the resolver
     * short-circuits to 0 if any of those values shows up at runtime. When
     * adding a new src that needs root routing (Ox / Lx / Mx / special alias),
     * give it the next free value in [48, 64) and add the matching row to
     * s_clockSrcRootMap -- no other enum values move. When this segment fills
     * up, raise kCLOCK_SRC_BOUNDARY and shift Section C / Invalid values up.
     * ====================================================================== */

    kCLOCK_SRC_BOUNDARY          = 64,    /*!< NOT a real src. Marks the end of
                                               the s_clockSrcRootMap-indexed
                                               segment. Used by the resolver. */

