zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
    /* ========================================================================
     * Section C: terminal srcs -- routed by the Case 2 switch in
     * CLOCK_GetClockSrcFreq. L0 fundamentals (no L1/L2 mux annotation),
     * PLL helpers, macro-backed PLLs, external sources, TIE_LOW.
     *
     * A few sources here are Level 1 outputs in the mux mapping but treated
     * as terminal constants in code (cycle breakers / simplification); flagged.
     * ====================================================================== */

    /* --- C.1: L0 fixed analog / oscillators (mostly Level-0-only -- no L1/L2 label) --- */
    kCLOCK_SRC_OSC_24M           = 64,    /* L0 only, MODCON-routed */
    kCLOCK_SRC_SXOSC             = 65,    /*Level 1 O0 */ /* cycle breaker, Case 2 const 24M */
    kCLOCK_SRC_FRO_192M          = 66,    /* L0 only */
    kCLOCK_SRC_FRO_96M           = 67,    /* L0 only */
    kCLOCK_SRC_FRO_48M           = 68,    /* L0 only */
    kCLOCK_SRC_FRO_24M           = 69,    /* L0 only */
    kCLOCK_SRC_LPOSC_12M_CORE    = 70,    /* L0 only */
    kCLOCK_SRC_LPOSC_1M_CORE     = 71,    /* L0 only */
    kCLOCK_SRC_LP1M_CORE         = 72,    /*Level 1 O15*/ /* treated as Case 2 const 1M */
    kCLOCK_SRC_LP12M_WAKE        = 73,    /*Level 2 A0 */ /* cycle breaker const 12M */
    kCLOCK_SRC_LP1M_WAKE         = 74,    /*Level 2 A2 */ /* cycle breaker const 1M */
    kCLOCK_SRC_LP2M_WAKE         = 75,    /*Level 2 A1 */
    kCLOCK_SRC_LPOSC32K          = 76,    /* L0 only */

    /* --- C.2: PLL outputs via dedicated helpers (L0 only, no L1/L2 label) --- */
    kCLOCK_SRC_COREPLL_OUT       = 77,    /* L0 only */
    kCLOCK_SRC_AUDIOPLL_DIVOUT   = 78,    /* L0 only */
    kCLOCK_SRC_VIDEOPLL_DIVOUT   = 79,    /* L0 only */
    kCLOCK_SRC_MAINPLL_DIV4      = 80,    /* L0 only */
    kCLOCK_SRC_MAINPLL_DIV5      = 81,    /* L0 only */
    kCLOCK_SRC_MAINPLL_DIV8      = 82,    /* L0 only */
    kCLOCK_SRC_MAINPLL_DIV10     = 83,    /* L0 only */
    kCLOCK_SRC_MAINPLL_DIV20     = 84,    /* L0 only */
    kCLOCK_SRC_MAINPLL_DIVOUT0   = 85,    /* L0 only */
    kCLOCK_SRC_MAINPLL_DIVOUT1   = 86,    /* L0 only */
    kCLOCK_SRC_MAINPLL_DIVOUT2   = 87,    /* L0 only */
    kCLOCK_SRC_SYSPLL_DIV4       = 88,    /* L0 only */
    kCLOCK_SRC_SYSPLL_DIV5       = 89,    /* L0 only */
    kCLOCK_SRC_SYSPLL_DIV10      = 90,    /* L0 only */
    kCLOCK_SRC_SYSPLL_DIV20      = 91,    /* L0 only */
    kCLOCK_SRC_SYSPLL_DIVOUT0    = 92,    /* L0 only */
    kCLOCK_SRC_SYSPLL_DIVOUT1    = 93,    /* L0 only */
    kCLOCK_SRC_SYSPLL_DIVOUT2    = 94,    /* L0 only */

    /* --- C.3: macro-backed PLLs (#ifndef-overridable in this header) --- */
    kCLOCK_SRC_USBPLL_OUT        = 95,    /*Level 2 D0 */
    kCLOCK_SRC_USBPLL_48M        = 96,    /*Level 2 D1 */
    kCLOCK_SRC_MIPIPLL_DIV8      = 97,    /*Level 2 D2 */
    kCLOCK_SRC_MEDIAPLL          = 98,    /*Level 2 L1 */

    /* --- C.4: external -- board override via CLOCK_GetExternalSrcFreq --- */
    kCLOCK_SRC_SAI0_MCLK         = 99,    /* L0 only, EXT */
    kCLOCK_SRC_SAI1_MCLK         = 100,   /* L0 only, EXT */
    kCLOCK_SRC_SAI2_MCLK         = 101,   /* L0 only, EXT */

    /* --- C.5: hardwired zero input --- */
    kCLOCK_SRC_TIE_LOW           = 102,   /* L0 only */

    kCLOCK_SRC_Invalid           = 127,   /* sentinel; not in the L1/L2 mapping */
} clock_name_t;

typedef struct _clock_root_config_t
{
    bool clockShutdown;
    uint8_t mux; /*!< See #clock_root_mux_source_t for details. */
    uint8_t div; /*!< it's the actual divider */
    uint8_t sndDiv; /*!< Second divider, if applicable */
} clock_root_config_t;

/*******************************************************************************
 * CGUANA Definitions
 ******************************************************************************/

/*!
 * @defgroup cguana_fsm_resource CGUANA FSM resource bits
 * @{
 * These bits are used in CGUAD_CTRL_REG.CGUAD_FSM_SW_ON_REQ[8:0],
 * CGUAD_CTRL_REG.CGUAD_FSM_SW_OFF_REQ[8:0], and
 * CGUAD_CTRL_STS.CGUAD_FSM_RDY[7:0] (FRO12M_WAKE has no RDY bit).
 */
#define CLOCK_CGUANA_FSM_LDOA         (1U << 0U)  /*!< LDOA 0.8 V */
#define CLOCK_CGUANA_FSM_FRO192M      (1U << 1U)  /*!< FRO 192 MHz */
#define CLOCK_CGUANA_FSM_FRO12M       (1U << 2U)  /*!< FRO 12 MHz */
#define CLOCK_CGUANA_FSM_MAINPLL      (1U << 3U)  /*!< Main PLL */
#define CLOCK_CGUANA_FSM_COREPLL      (1U << 4U)  /*!< Core PLL */
#define CLOCK_CGUANA_FSM_SYSPLL       (1U << 5U)  /*!< System PLL */
#define CLOCK_CGUANA_FSM_LDOQ         (1U << 6U)  /*!< LDOQ 0.8 V */
#define CLOCK_CGUANA_FSM_SXOSC        (1U << 7U)  /*!< SXOSC crystal oscillator */
#define CLOCK_CGUANA_FSM_FRO12M_WAKE  (1U << 8U)  /*!< FRO 12 MHz wake path (ON_REQ only) */
/*! @} */

/*! @brief CGUANA PLL reference clock frequency selection. */
typedef enum _clock_cguana_ref_freq
{
    kCLOCK_CguanaRefFreq19p2M = 0U, /*!< 19.2 MHz */
    kCLOCK_CguanaRefFreq24M   = 1U, /*!< 24 MHz */
    kCLOCK_CguanaRefFreq32M   = 2U, /*!< 32 MHz */
    kCLOCK_CguanaRefFreq40M   = 3U, /*!< 40 MHz */
} clock_cguana_ref_freq_t;

/*!
 * @brief PLL reference clock source selector.
 *
 * Maps to CGUANA CGUA_CTRL_REG bits CGUA_CLKGEN_CMS_PLL_CKIN_SEL (bit 22, Core/
 * Main/Sys PLLs) and CGUA_CLKGEN_AV_PLL_CKIN_SEL (bit 23, Audio/Video PLLs).
 * Both legs are nominally 24 MHz on RT2660.
 */
typedef enum _clock_pll_ref_src
{
    kCLOCK_PllRefSrc_FRO192M_24M = 0U, /*!< 24 MHz output of FRO192M */
    kCLOCK_PllRefSrc_SXOSC       = 1U, /*!< SXOSC output clock */
} clock_pll_ref_src_t;

/*! @brief CGUANA PLL starting (calibration) mode. */
typedef enum _clock_cguana_pll_start_mode
{
    kCLOCK_CguanaPllStartFull    = 0U, /*!< Full auto with VCO calibration */
    kCLOCK_CguanaPllStartSkipCal = 3U, /*!< Skip VCO calibration (reuses stored cal value) */
} clock_cguana_pll_start_mode_t;

/*! @brief SXOSC oscillator mode selection. */
typedef enum _clock_cguana_sxosc_mode
{
    kCLOCK_CguanaSxoscModeCrystal       = 0U, /*!< Crystal (differential) mode */
    kCLOCK_CguanaSxoscModeAcSlave       = 1U, /*!< AC-coupled slave mode */
    kCLOCK_CguanaSxoscModeDcBypass      = 2U, /*!< DC-bypass mode */
    kCLOCK_CguanaSxoscModeDcBypassNoDet = 3U, /*!< DC-bypass without level detector */
} clock_cguana_sxosc_mode_t;

/*! @brief FRO 192 MHz oscillator trimming word band (OTWB) selection. */
typedef enum _clock_cguana_fro192m_otwb
{
    kCLOCK_CguanaFro192mOtwb96M  = 0U, /*!<  96 MHz band */
    kCLOCK_CguanaFro192mOtwb120M = 1U, /*!< 120 MHz band */
    kCLOCK_CguanaFro192mOtwb144M = 2U, /*!< 144 MHz band */
    kCLOCK_CguanaFro192mOtwb192M = 3U, /*!< 192 MHz band */
    kCLOCK_CguanaFro192mOtwb240M = 4U, /*!< 240 MHz band */
    kCLOCK_CguanaFro192mOtwb288M = 5U, /*!< 288 MHz band */
    kCLOCK_CguanaFro192mOtwb384M = 6U, /*!< 384 MHz band */
    kCLOCK_CguanaFro192mOtwb480M = 7U, /*!< 480 MHz band */
} clock_cguana_fro192m_otwb_t;

/*! @brief FRO 12 MHz oscillator trimming word band (OTWB) selection. */
typedef enum _clock_cguana_fro12m_otwb
{
    kCLOCK_CguanaFro12mOtwb8M      = 0U, /*!<  8 MHz band */
    kCLOCK_CguanaFro12mOtwb10M     = 1U, /*!< 10 MHz band */
    kCLOCK_CguanaFro12mOtwb12M     = 2U, /*!< 12 MHz band */
    kCLOCK_CguanaFro12mOtwb12p288M = 3U, /*!< 12.288 MHz band */
    kCLOCK_CguanaFro12mOtwb16M     = 4U, /*!< 16 MHz band */
    kCLOCK_CguanaFro12mOtwb20M     = 5U, /*!< 20 MHz band */
    kCLOCK_CguanaFro12mOtwb24M     = 6U, /*!< 24 MHz band */
    kCLOCK_CguanaFro12mOtwb32M     = 7U, /*!< 32 MHz band */
} clock_cguana_fro12m_otwb_t;

