zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
/*! @brief Main/System fractional PLL VCO frequency selection. */
typedef enum _clock_cguana_frac_pll_vco_freq
{
    kCLOCK_CguanaFracPllVco2000M = 0U, /*!< 2000 MHz */
    kCLOCK_CguanaFracPllVco1950M = 1U, /*!< 1950 MHz */
    kCLOCK_CguanaFracPllVco1900M = 2U, /*!< 1900 MHz */
    kCLOCK_CguanaFracPllVco1850M = 3U, /*!< 1850 MHz */
} clock_cguana_frac_pll_vco_freq_t;

/*! @brief Spread-spectrum (SSCG) configuration, shared by frac PLLs and AV PLLs. */
typedef struct _clock_cguana_sscg_config
{
    uint16_t stop;        /*!< Modulation frequency setting (SSCG_STOP) */
    uint16_t step;        /*!< Modulation amplitude setting (SSCG_STEP) */
    bool     centerSpread; /*!< false=downspread, true=centerspread */
} clock_cguana_sscg_config_t;

/*! @brief SXOSC crystal oscillator configuration. */
typedef struct _clock_cguana_sxosc_config
{
    clock_cguana_sxosc_mode_t modeSel; /*!< Oscillator operating mode */
    uint8_t                   gmSel;        /*!< Oscillator GM selection [2:0] */
    uint8_t                   xtal1CapTrim; /*!< XTAL1 pad capacitor trim [5:0] */
    uint8_t                   xtal2CapTrim; /*!< XTAL2 pad capacitor trim [5:0] */
    uint8_t                   detTrim;      /*!< Level detector trim [1:0] */
    bool                      clkDiv2En;    /*!< Enable divide-by-2 on output clock */
} clock_cguana_sxosc_config_t;

/*! @brief FRO 192 MHz configuration. */
typedef struct _clock_cguana_fro192m_config
{
    clock_cguana_fro192m_otwb_t otwb; /*!< Target frequency band selection */
} clock_cguana_fro192m_config_t;

/*! @brief FRO 12 MHz configuration. */
typedef struct _clock_cguana_fro12m_config
{
    clock_cguana_fro12m_otwb_t otwb; /*!< Target frequency band selection */
} clock_cguana_fro12m_config_t;

/*! @brief Core PLL configuration. */
typedef struct _clock_cguana_core_pll_config
{
    clock_cguana_pll_start_mode_t startMode;  /*!< Calibration/start mode */
    bool                          vcoSelHf;   /*!< false=LF VCO (600-858 MHz), true=HF VCO (858-1200 MHz) */
    clock_cguana_ref_freq_t       refFreq;    /*!< Reference clock frequency */
    uint8_t                       loopDivNint; /*!< Integer feedback division ratio [6:0] */
    bool                          postDivBy2; /*!< false=600-1200 MHz output, true=300-600 MHz output */
} clock_cguana_core_pll_config_t;

/*! @brief Fractional output divider configuration for Main/Sys PLL. */
typedef struct _clock_cguana_frac_div_config
{
    bool    en;    /*!< Enable this fractional divider output */
    bool    range; /*!< Extended range: when true, effective_div = (sel+32)/4 */
    uint8_t sel;   /*!< 5-bit division ratio: N = sel/4, output = VCO*4/sel */
} clock_cguana_frac_div_config_t;

/*! @brief Main/System PLL (fractional-N) configuration. */
typedef struct _clock_cguana_frac_pll_config
{
    clock_cguana_pll_start_mode_t    startMode; /*!< Calibration/start mode */
    clock_cguana_ref_freq_t          refFreq;   /*!< Reference clock frequency */
    clock_cguana_frac_pll_vco_freq_t lowFreq;  /*!< VCO frequency selection */
    bool                             div5En;    /*!< Enable divide-by-5 output */
    bool                             div8En;    /*!< Enable divide-by-8 output */
    bool                             div10En;   /*!< Enable divide-by-10 output */
    bool                             div20En;   /*!< Enable divide-by-20 output */
    clock_cguana_frac_div_config_t   fracDiv[3]; /*!< Three programmable fractional divider outputs */
    bool                             sscgEn;   /*!< Enable spread-spectrum clock generation */
    const                            clock_cguana_sscg_config_t *sscg;  /*!< SSCG config (may be NULL when sscgEn is false) */
} clock_cguana_frac_pll_config_t;

/*! @brief Audio/Video PLL (AV PLL) configuration.
 *
 *  The AV PLL VCO frequency is determined by:
 *    F_VCO = F_REF * DNUM / 2^24   (DNUM is 30-bit, upper 6 bits are integer part)
 *  Output frequency:
 *    F_OUT = F_VCO / postDivRatio
 */
typedef struct _clock_cguana_avpll_config
{
    clock_cguana_pll_start_mode_t startMode;   /*!< Calibration/start mode */
    clock_cguana_ref_freq_t       refFreq;     /*!< Reference clock frequency */
    uint8_t                       ccoBandSel;  /*!< CCO_FREQ_BAND_SEL [2:0] for VCO band */
    uint8_t                       postDivRatio; /*!< POSTDIV_DIVRATIO_SEL [6:0], minimum value 8 */
    uint32_t                      dnum;        /*!< 30-bit DNUM value [29:0]; F_VCO = F_REF * dnum / 2^24 */
    bool                          sscgEn;     /*!< Enable SSCG */
    const                         clock_cguana_sscg_config_t *sscg;   /*!< SSCG config (may be NULL when sscgEn is false) */
} clock_cguana_avpll_config_t;

/*! @brief USB FS (USBFS/KHCI) functional clock source (COMM usb1_fclk root mux). */
typedef enum _clock_usb_fs_src
{
    kCLOCK_UsbFsSrcUsb1Root  = kCLOCK_USB1_ClockRoot_USB1,       /*!< usb1_rootclk (root47 output, configured in clock_config) */
    kCLOCK_UsbFsSrcUsbPllOut = kCLOCK_USB1_ClockRoot_USBPLL_OUT, /*!< USB PHY PLL 480M direct out (needs /10 in root -> 48M) */
    kCLOCK_UsbFsSrcUsbPll48M = kCLOCK_USB1_ClockRoot_USBPLL_48M, /*!< USB PHY PLL 480M/10 = 48M (recommended, exact) */
    kCLOCK_UsbFsSrcFro48M    = kCLOCK_USB1_ClockRoot_FRO48M,     /*!< Free-running FRO 48M (RC accuracy, may not meet USB FS) */
} clock_usb_fs_src_t;

/*!
 * @brief FRO tuner (FLL) reference-clock source.
 *
 * Selects the reference against which the tuner locks an FRO. The first five
 * values use the SXOSC crystal path (CKREF_SOURCE_SEL == 0) and differ only by
 * the SXOSC frequency; the last two use a USB Start-Of-Frame pulse as the
 * reference. The enumerators are ordered to match the reference manual
 * FRO_TUNER settings tables and are used to index the internal parameter
 * tables in fsl_clock.c, so do not reorder them.
 */
typedef enum _clock_fro_tuner_src
{
    kCLOCK_FroTunerRefSxosc19M2 = 0U, /*!< SXOSC crystal at 19.2 MHz. */
    kCLOCK_FroTunerRefSxosc24M,       /*!< SXOSC crystal at 24 MHz. */
    kCLOCK_FroTunerRefSxosc32M,       /*!< SXOSC crystal at 32 MHz. */
    kCLOCK_FroTunerRefSxosc40M,       /*!< SXOSC crystal at 40 MHz. */
    kCLOCK_FroTunerRefSxosc32768Hz,   /*!< SXOSC crystal at 32.768 kHz. */
    kCLOCK_FroTunerRefUsbFsSof1kHz,   /*!< USB Full-/Low-Speed 1 kHz Start-Of-Frame. */
    kCLOCK_FroTunerRefUsbHsSof8kHz,   /*!< USB High-Speed 8 kHz Start-Of-Frame. */
} clock_fro_tuner_src_t;

/*! @brief Which FRO the tuner (FLL) locks. */
typedef enum _clock_fro_tuner_target
{
    kCLOCK_FroTuner12M = 0U, /*!< Tune the 12 MHz FRO. */
    kCLOCK_FroTuner192M,     /*!< Tune the 192 MHz FRO. */
} clock_fro_tuner_target_t;

