zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*!
 * @brief Enable the clock for specific IP.
 *
 * @param name  Which clock to enable, see \ref clock_lpcg_t.
 */
void CLOCK_EnableClock(clock_ip_name_t name);

/*!
 * @brief Disable the clock for specific IP.
 *
 * @param name  Which clock to disable, see \ref clock_lpcg_t.
 */
void CLOCK_DisableClock(clock_ip_name_t name);

/*!
 * @brief Program the LPCG_CFG, HSK_SEL, and HSK_BYPASS fields of a peripheral
 *        clock gate in one update.
 *
 * Writes bits[1:0] (LPCG_CFG), bits[18:16] (HSK_SEL), and bit[8] (HSK_BYPASS)
 * of the CCM SLICE_CONTROL register that owns @p name. Other bits of
 * SLICE_CONTROL are preserved. Use this when a peripheral requires more than
 * the simple on/off behavior provided by CLOCK_EnableClock / CLOCK_DisableClock,
 * for example to gate the clock automatically in Sleep / Deep Sleep or to
 * select which CMC instance(s) drive the clock-gate handshake.
 *
 * @param name             Clock IP identifier, see \ref clock_lpcg_t.
 * @param mode             Desired LPCG_CFG value (see \ref clock_gate_value_t).
 * @param hskSel           HSK_SEL value (3 bits) selecting the CMC instance(s)
 *                         that drive the clock-gate handshake for this LPCG.
 * @param bypassHandshake  If true, set HSK_BYPASS to bypass the clock-gate
 *                         handshake.  Use only for early bring-up when the
 *                         downstream CMC partner is not yet functional.
 */
void CLOCK_SetClockGateMode(clock_ip_name_t name, clock_gate_value_t mode, uint8_t hskSel,
                            bool bypassHandshake);

/*!
 * @brief Gets the clock frequency for a specific root clock name.
 *
 * This function walks the 3-layer RT2660 clock tree (L0 analog roots -> L1
 * CGUDIG mux -> L2 subsystem mux) using the current mux/divider/MODCON state
 * and returns the actual frequency for the requested root. Returns 0U for
 * out-of-range roots, invalid sources, or divider-by-zero (REQ-006). ISR-safe
 * and reentrant (REQ-009) - read-only, no locks, no critical sections.
 *
 * @param root Clock root defined in clock_root_t
 * @return Clock frequency in hertz, or 0 if it cannot be resolved.
 */
uint32_t CLOCK_GetRootClockFreq(clock_root_t root);

/*!
 * @brief Gets the frequency of an upstream clock source identified by clock_name_t.
 *
 * Resolves L0 analog roots (constants and PLL helpers), L1 CGUDIG aliases
 * (recursing into the owning root), L1/L2 SS feedback sources, MODCON-controlled
 * (Mx) values, and macro-backed PLLs (USBPLL/MEDIAPLL/MIPIPLL). Returns 0U for
 * kCLOCK_SRC_Invalid, kCLOCK_SRC_TIE_LOW, and unrecognized enum values. ISR-safe
 * and reentrant.
 *
 * @param name Source name, see clock_name_t.
 * @return Source frequency in hertz, or 0 if it cannot be resolved.
 */
uint32_t CLOCK_GetClockSrcFreq(clock_name_t name);

/*!
 * @brief Board-overridable hook returning the frequency of an external source.
 *
 * Used by CLOCK_GetClockSrcFreq to resolve external (Dx) sources whose
 * frequency the SoC cannot know on its own, including kCLOCK_SRC_SAI0_MCLK,
 * kCLOCK_SRC_SAI1_MCLK, kCLOCK_SRC_SAI2_MCLK, and any future EXT source. The
 * default weak implementation returns 0U. Board ports override it to declare
 * the actually-wired external frequency.
 *
 * @param name External source name, see clock_name_t.
 * @return External source frequency in hertz, or 0 if unknown.
 */
uint32_t CLOCK_GetExternalSrcFreq(clock_name_t name);

/*!
 * @brief Measures the actual frequency of a clock root using the FREQME hardware.
 *
 * Unlike CLOCK_GetRootClockFreq(), which computes a theoretical value from the
 * clock-tree configuration, this function measures the real signal with the
 * FREQME instance of the subsystem the root belongs to. This matters while the
 * internal FROs are untrimmed (e.g. FRO192M configured as 192 MHz may actually
 * run near 220 MHz). INPUTMUX routing, FREQME instance selection, and the
 * reference-clock chain are handled internally:
 *   - CGU and WAKE roots measure against the 24 MHz crystal (SXOSC) directly.
 *   - Roots in the CMPT/MAIN/COMM/AUDIO/MEDIA subsystems are measured by that
 *     subsystem's FREQME; its reference clock is itself first measured against
 *     SXOSC by the SYSCON FREQME, so accuracy always derives from the crystal.
 *
 * @note Preconditions: the clock under test must be enabled/running (this
 *       function never enables the measured clock; a gated target reads as a
 *       failure). The FREQME/INPUTMUX access clocks are enabled internally and
 *       restored afterwards. OSC_24M must be sourced from the SXOSC crystal
 *       (see CLOCK_SetOsc24mSource()); if it is sourced from the untrimmed
 *       FRO_24M the returned values are only as accurate as that FRO.
 * @note Blocking: one measurement takes 2^FSL_CLOCK_FREQME_REF_SCALE reference
 *       cycles (~2.73 ms at the 24 MHz reference with the default scale of 16;
 *       a two-level measurement roughly doubles that). If the target is too
 *       slow (or gated) the measurement is automatically retried with a larger
 *       scale, up to 2^24 cycles (~0.7 s) worst case before returning 0. A
 *       dead *reference* clock is detected by a bounded polling loop whose
 *       worst-case detection time at the maximum scale can reach several
 *       seconds (CPU-speed dependent) -- this only occurs in the double-fault
 *       case of an escalated retry with a dead reference.
 * @note Not ISR-safe and not reentrant: the FREQME and INPUTMUX FREQMEAS
 *       muxes of the involved subsystems are reprogrammed (those muxes serve
 *       only the FREQME and are not restored), and the FREQME access gate
 *       save/restore is a non-atomic read-modify-write.
 *
 * @param root Clock root defined in clock_root_t.
 * @return Measured frequency in hertz, or 0 on failure: root out of range,
 *         measurement timeout (reference dead), or result under/overflow
 *         (target dead/gated, or outside the 2 GHz ceiling).
 */
uint32_t CLOCK_MeasureRootClockFreq(clock_root_t root);

/*!
 * @brief Measures the actual frequency of a clock source using the FREQME hardware.
 *
 * Companion of CLOCK_GetClockSrcFreq() that returns a measured value instead
 * of a computed one; see CLOCK_MeasureRootClockFreq() for the measurement
 * chain, preconditions, and blocking behavior.
 *
 * Supported are the in-map sources (below kCLOCK_SRC_BOUNDARY): each resolves
 * to its owning clock root and is measured there, with the MODCON /2 of the
 * six kCLOCK_SRC_*_DIV2 sources applied afterwards (the /2 is a deterministic
 * divider, so halving the measured parent is exact). kCLOCK_SRC_CPU is
 * measured at its dedicated hardware tap (SYSCON tar cpu_rootclk) rather than
 * derived from the MAIN tap.
 *
 * @note Terminal analog sources (kCLOCK_SRC_FRO_192M, PLL taps, external SAI
 *       MCLKs, ...) have no FREQME tap and return 0; measure the corresponding
 *       root alias instead. Beware the one-underscore difference:
 *       kCLOCK_SRC_FRO_192M (raw analog source, returns 0) vs
 *       kCLOCK_SRC_FRO192M (CGU root alias, measurable) -- use the latter, or
 *       kCLOCK_Root_CGU_FRO192M_ROOTCLK, for the FRO 192 MHz output. The same
 *       applies to the FRO_96M/FRO_48M/FRO_24M vs FRO96M/FRO48M/FRO24M pairs.
 * @note To measure the CPU clock, kCLOCK_SRC_CPU is the most direct choice
 *       (dedicated hardware tap).
 *
 * @param name Source name, see clock_name_t.
 * @return Measured frequency in hertz, or 0 if the source is not measurable,
 *         the measurement times out, or the result is out of range.
 */
uint32_t CLOCK_MeasureClockSrcFreq(clock_name_t name);

/*!
 * @brief Set the mux source for a clock root.
 * @param root  Clock root, see \ref clock_root_t.
 * @param src   Mux selection, see \ref clock_root_mux_source_t. Range 0..3.
 */
void CLOCK_SetRootClockMux(clock_root_t root, clock_root_mux_source_t src);

/*!
 * @brief Get the current mux source value of a clock root.
 * @param root  Clock root, see \ref clock_root_t.
 * @return mux selection value (0..3).
 */
uint32_t CLOCK_GetRootClockMux(clock_root_t root);

/*!
 * @brief Resolve the clock_name_t source feeding a root for the given mux selection.
 * @param root  Clock root, see \ref clock_root_t.
 * @param src   Mux selection value (0..3).
 * @return Upstream clock_name_t for that root/mux pair.
 */
clock_name_t CLOCK_GetRootClockSource(clock_root_t root, uint32_t src);

/*!
 * @brief Set the integer post-divider for a clock root.
 * @param root  Clock root, see \ref clock_root_t.
 * @param div   Divider value (1-based; must be >= 1).
 */
void CLOCK_SetRootClockDiv(clock_root_t root, uint32_t div);

/*!
 * @brief Get the current post-divider for a clock root.
 * @param root  Clock root, see \ref clock_root_t.
 * @return Divider value (1-based).
 */
uint32_t CLOCK_GetRootClockDiv(clock_root_t root);

/*!
 * @brief Power off a clock root (clockShutdown=1).
 * @param root  Clock root, see \ref clock_root_t.
 */
void CLOCK_PowerOffRootClock(clock_root_t root);

/*!
 * @brief Power on a clock root (clockShutdown=0).
 * @param root  Clock root, see \ref clock_root_t.
 */
void CLOCK_PowerOnRootClock(clock_root_t root);

/*!
 * @brief Program a clock root's mux, divider and (optional) second divider in one call.
 * @param root    Clock root, see \ref clock_root_t.
 * @param config  Pointer to the root configuration (mux/div/sndDiv/clockShutdown).
 */
void CLOCK_SetRootClock(clock_root_t root, const clock_root_config_t *config);

/* =========================================================================
 * MODCON-controlled clock-tree muxes (MCUX-88602)
 *
 * Seven L0/L2 clock-tree muxes are controlled by MODCON registers rather than
 * by CCM SLICE_CONTROL. CLOCK_GetClockSrcFreq already consumes them on the
 * Get side; the APIs below are the matching Set side so callers do not need
 * to poke MODCON_SetCFG with raw bit masks.
 * ========================================================================= */

/*!
 * @brief CLK24M_SEL MODCON selection for the OSC_24M (L0) clock.
 *
 * Maps to MAIN MODCON CLK24M_SEL_CFG.SEL (offset 0x8810).
 */
typedef enum _clock_osc_24m_src
{
    kCLOCK_Osc24mSrc_FRO_24M = 0U, /*!< OSC_24M driven by FRO 24 MHz */
    kCLOCK_Osc24mSrc_SXOSC   = 1U, /*!< OSC_24M driven by SXOSC crystal */
} clock_osc_24m_src_t;

/*!
 * @brief Select the source driving the OSC_24M L0 clock.
 *
 * @param src Source selection, see ::clock_osc_24m_src_t.
 */
void CLOCK_SetOsc24mSource(clock_osc_24m_src_t src);

/*!
 * @brief Get the current source driving the OSC_24M L0 clock.
 *
 * @return Current selection, see ::clock_osc_24m_src_t.
 */
clock_osc_24m_src_t CLOCK_GetOsc24mSource(void);

/*!
 * @brief Program one of the six MODCON-controlled /2 clock selects (Mx).
 *
 * Selects pass-through or divide-by-two for the L2 Mx sources defined in the
 * MCUX-88602 MODCON control table:
 *   - kCLOCK_SRC_MAIN_PERI0_DIV2 : MAIN  XSPI0 MODCON.CFG[PERI_ROOTCLK0]
 *   - kCLOCK_SRC_MAIN_PERI1_DIV2 : MAIN  XSPI1 MODCON.CFG[PERI_ROOTCLK1]
 *   - kCLOCK_SRC_MAINPFDX_DIV2   : MAIN  XSPI0 MODCON.CFG[MAINPFDX_ROOTCLK]
 *   - kCLOCK_SRC_COMM_PERI1_DIV2 : COMM  USDHC0 MODCON.CFG[PERI_ROOTCLK1_SEL_DIV2]
 *   - kCLOCK_SRC_COMM_PERI2_DIV2 : COMM  USDHC1 MODCON.CFG[PERI_ROOTCLK2_SEL_DIV2]
 *   - kCLOCK_SRC_COMMPFDX_DIV2   : COMM  USDHC0 MODCON.CFG[COMMPFDX_ROOTCLK_SEL_DIV2]
 *
 * SW invariant: all consumers of the same Mx source program identical /2
 * selections. CLOCK_GetClockSrcFreq reads from one canonical MODCON instance
 * per Mx; CLOCK_SetClockSrcDiv2 writes to the same instance.
 *
 * No-op for any other ::clock_name_t value.
 *
 * @param src     One of the six kCLOCK_SRC_*_DIV2 sources above.
 * @param useDiv2 false = pass-through (/1); true = divide by 2 (/2).
 */
void CLOCK_SetClockSrcDiv2(clock_name_t src, bool useDiv2);

/*!
 * @brief Read the current /2 selection of a MODCON-controlled Mx source.
 *
 * @param src One of the six kCLOCK_SRC_*_DIV2 sources accepted by
 *            ::CLOCK_SetClockSrcDiv2.
 * @return false = pass-through (/1); true = divide by 2 (/2). Returns false
 *         for sources that are not MODCON-controlled.
 */
bool CLOCK_GetClockSrcDiv2(clock_name_t src);

/* =========================================================================
 * CGUANA clock source APIs
 * ========================================================================= */

/*!
 * @brief Initialize the SXOSC crystal oscillator.
 *
 * Configures SXOSC analog parameters and requests the CGUANA FSM to power on
 * and enable SXOSC. Blocks until the FSM reports SXOSC ready.
 *
 * @param config  Pointer to SXOSC configuration; must not be NULL.
 */
void CLOCK_InitSxosc(const clock_cguana_sxosc_config_t *config);

/*!
 * @brief De-initialize the SXOSC crystal oscillator.
 *
 * Requests the CGUANA FSM to power off SXOSC.
 */
void CLOCK_DeinitSxosc(void);

/*!
 * @brief Initialize the FRO 192 MHz oscillator.
 *
 * Configures the oscillator band and requests FSM enable. Blocks until ready.
 *
 * @param config  Pointer to FRO192M configuration; must not be NULL.
 */
void CLOCK_InitFro192M(const clock_cguana_fro192m_config_t *config);

/*!
 * @brief De-initialize the FRO 192 MHz oscillator.
 */
void CLOCK_DeinitFro192M(void);

/*!
 * @brief Initialize the FRO 12 MHz oscillator.
 *
 * @param config  Pointer to FRO12M configuration; must not be NULL.
 */
void CLOCK_InitFro12M(const clock_cguana_fro12m_config_t *config);

/*!
 * @brief De-initialize the FRO 12 MHz oscillator.
 */
void CLOCK_DeinitFro12M(void);

/* =========================================================================
 * CGUANA PLL APIs
 * ========================================================================= */

/*!
 * @brief Initialize the Core PLL.
 *
 * Configures Core PLL registers and requests FSM enable. Blocks until ready.
 *
 * @param config  Pointer to Core PLL configuration; must not be NULL.
 */
void CLOCK_InitCorePll(const clock_cguana_core_pll_config_t *config);

/*!
 * @brief De-initialize the Core PLL.
 */
void CLOCK_DeinitCorePll(void);

/*!
 * @brief Get the Core PLL output frequency.
 *
 * Reads the current FREF, LOOPDIV_NINT, and POSTDIV register settings.
 *
 * @return Core PLL output frequency in Hz, or 0 if PLL is not ready.
 */
uint32_t CLOCK_GetCorePllFreq(void);

/*!
 * @brief Initialize the Main PLL.
 *
 * Configures Main PLL fractional-N registers and requests FSM enable. Blocks until ready.
 *
 * @param config  Pointer to Main PLL configuration; must not be NULL.
 */
void CLOCK_InitMainPll(const clock_cguana_frac_pll_config_t *config);

/*!
 * @brief De-initialize the Main PLL.
 */
void CLOCK_DeinitMainPll(void);

/*!
 * @brief Get the Main PLL VCO frequency.
 *
 * Reads the LOWFREQ band-select field and returns the base VCO frequency,
 * one of 2 GHz / 1.95 GHz / 1.90 GHz / 1.85 GHz. The integer-divider outputs
 * DIV4/DIV5/DIV8/DIV10/DIV20 are simply VCO / N at the call site.
 *
 * @return VCO frequency in Hz.
 */
uint32_t CLOCK_GetMainPllVcoFreq(void);

/*!
 * @brief Get the Main PLL fractional output frequency (DIVOUT0 / DIVOUT1 / DIVOUT2).
 *
 * @param fracIdx  Fractional output index: 0 = DIVOUT0, 1 = DIVOUT1, 2 = DIVOUT2.
 * @return Output frequency in Hz, or 0 if the output is disabled.
 */
uint32_t CLOCK_GetMainPllFreq(uint8_t fracIdx);

/*!
 * @brief Initialize the System PLL.
 *
 * @param config  Pointer to System PLL configuration; must not be NULL.
 */
void CLOCK_InitSysPll(const clock_cguana_frac_pll_config_t *config);

/*!
 * @brief De-initialize the System PLL.
 */
void CLOCK_DeinitSysPll(void);

/*!
 * @brief Get the System PLL VCO frequency.
 *
 * See CLOCK_GetMainPllVcoFreq -- same VCO/integer-divider relationship.
 *
 * @return VCO frequency in Hz.
 */
uint32_t CLOCK_GetSysPllVcoFreq(void);

/*!
 * @brief Get the System PLL fractional output frequency (DIVOUT0 / DIVOUT1 / DIVOUT2).
 *
 * @param fracIdx  Fractional output index: 0 = DIVOUT0, 1 = DIVOUT1, 2 = DIVOUT2.
 * @return Output frequency in Hz, or 0 if disabled.
 */
uint32_t CLOCK_GetSysPllFreq(uint8_t fracIdx);

/*!
 * @brief Initialize the Audio PLL.
 *
 * Configures Audio PLL registers and performs the direct enable sequence
 * (PWREN -> PWRACK -> RSTN -> PLL_EN -> READY -> CLKOUT_EN).
 *
 * @param config  Pointer to Audio PLL configuration; must not be NULL.
 */
void CLOCK_InitAudioPll(const clock_cguana_avpll_config_t *config);

/*!
 * @brief De-initialize the Audio PLL.
 */
void CLOCK_DeinitAudioPll(void);

/*!
 * @brief Get the Audio PLL output frequency.
 *
 * @return Audio PLL output frequency in Hz. Uses DNUM as 6.24 fixed-point
 *         (F_VCO = F_REF * DNUM / 2^24) divided by POSTDIV.
 */
uint32_t CLOCK_GetAudioPllFreq(void);

/*!
 * @brief Update the Audio PLL output frequency via DNUM.
 *
 * Issues a DNUM update request and waits for the acknowledgement.
 *
 * @param dnum  New 30-bit DNUM value [29:0].
 */
void CLOCK_UpdateAudioPllDnum(uint32_t dnum);

/*!
 * @brief Initialize the Video PLL.
 *
 * @param config  Pointer to Video PLL configuration; must not be NULL.
 */
void CLOCK_InitVideoPll(const clock_cguana_avpll_config_t *config);

/*!
 * @brief De-initialize the Video PLL.
 */
void CLOCK_DeinitVideoPll(void);

/*!
 * @brief Get the Video PLL output frequency.
 *
 * @return Video PLL output frequency in Hz.
 */
uint32_t CLOCK_GetVideoPllFreq(void);

/*!
 * @brief Update the Video PLL output frequency via DNUM.
 *
 * @param dnum  New 30-bit DNUM value [29:0].
 */
void CLOCK_UpdateVideoPllDnum(uint32_t dnum);

/*!
 * @brief Select the reference clock source feeding the Core, Main and System PLLs.
 *
 * Writes CGUANA CGUA_CTRL_REG.CGUA_CLKGEN_CMS_PLL_CKIN_SEL (bit 22).
 *
 * @param src Source selection, see ::clock_pll_ref_src_t.
 */
void CLOCK_SetCmsPllRefSource(clock_pll_ref_src_t src);

/*!
 * @brief Get the current reference clock source feeding the Core, Main and System PLLs.
 *
 * @return Current selection, see ::clock_pll_ref_src_t.
 */
clock_pll_ref_src_t CLOCK_GetCmsPllRefSource(void);

/*!
 * @brief Select the reference clock source feeding the Audio and Video PLLs.
 *
 * Writes CGUANA CGUA_CTRL_REG.CGUA_CLKGEN_AV_PLL_CKIN_SEL (bit 23).
 *
 * @param src Source selection, see ::clock_pll_ref_src_t.
 */
void CLOCK_SetAvPllRefSource(clock_pll_ref_src_t src);

/*!
 * @brief Get the current reference clock source feeding the Audio and Video PLLs.
 *
 * @return Current selection, see ::clock_pll_ref_src_t.
 */
clock_pll_ref_src_t CLOCK_GetAvPllRefSource(void);

/*!
 * @brief Fractional-N PLL identifier (Main or System PLL).
 *
 * The two fractional-N PLLs on RT2660 (Main and System) share an identical
 * register layout in PERI_CGUANA.h: PLLn_PLL1_REG holds the integer divider
 * enables (DIV5/8/10/20 at bits 3/5/7/9) and PLLn_PLL2_REG holds the
 * fractional divider enables (DIVFRAC0/1/2 at bits 0/8/16). The identical
 * layout is exploited by CLOCK_EnableMainSysPllOutput and peers to keep the
 * per-output mapping table single-copy.
 */
typedef enum _clock_main_sys_pll
{
    kCLOCK_MainSysPll_Main = 0U, /*!< Main PLL   (CGUA_MAINPLL_PLL1_REG / CGUA_MAINPLL_PLL2_REG). */
    kCLOCK_MainSysPll_Sys  = 1U, /*!< System PLL (CGUA_SYSPLL_PLL1_REG  / CGUA_SYSPLL_PLL2_REG).  */

