zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_clock.h
    kCLOCK_MainSysPll_Count      /*!< Sentinel — not a valid PLL identifier. */
} clock_main_sys_pll_t;

/*!
 * @brief Fractional-N PLL divider output identifier.
 *
 * Each enumerator names one divider output tap of a Main/System PLL. The
 * physical bit position in the PLL's PLL1_REG / PLL2_REG is documented in
 * the trailing comment. Because Main and System PLLs share the same bit
 * layout, one enumerator value is valid for either PLL — the target PLL
 * is selected by the ::clock_main_sys_pll_t argument to the API.
 */
typedef enum _clock_main_sys_pll_output
{
    /* PLL1_REG divider outputs */
    kCLOCK_MainSysPllOutput_Div5,     /*!< PLL1_REG bit 3  — MAINPLL_DIV5_EN / SYSPLL_DIV5_EN. */
    kCLOCK_MainSysPllOutput_Div8,     /*!< PLL1_REG bit 5  — MAINPLL_DIV8_EN / SYSPLL_DIV8_EN. */
    kCLOCK_MainSysPllOutput_Div10,    /*!< PLL1_REG bit 7  — MAINPLL_DIV10_EN / SYSPLL_DIV10_EN. */
    kCLOCK_MainSysPllOutput_Div20,    /*!< PLL1_REG bit 9  — MAINPLL_DIV20_EN / SYSPLL_DIV20_EN. */
    /* PLL2_REG fractional divider outputs */
    kCLOCK_MainSysPllOutput_Divfrac0, /*!< PLL2_REG bit 0  — MAINPLL_DIVFRAC0_EN / SYSPLL_DIVFRAC0_EN. */
    kCLOCK_MainSysPllOutput_Divfrac1, /*!< PLL2_REG bit 8  — MAINPLL_DIVFRAC1_EN / SYSPLL_DIVFRAC1_EN. */
    kCLOCK_MainSysPllOutput_Divfrac2, /*!< PLL2_REG bit 16 — MAINPLL_DIVFRAC2_EN / SYSPLL_DIVFRAC2_EN. */

    kCLOCK_MainSysPllOutput_All,      /*!< All 7 outputs at once — see the Enable/Disable/IsEnabled contracts. */

    kCLOCK_MainSysPllOutput_Count     /*!< Sentinel — not a valid output identifier. */
} clock_main_sys_pll_output_t;

/*!
 * @brief Enable one or all divider outputs of a Main/System PLL.
 *
 * If @p out names a single output (Div5/8/10/20/Divfrac0/1/2), sets the
 * single bit that gates it in the selected @p pll; every other bit of the
 * containing register is preserved. If @p out is ::kCLOCK_MainSysPllOutput_All,
 * sets all seven output-enable bits in one pass — Div5/8/10/20 in PLL1_REG
 * and Divfrac0/1/2 in PLL2_REG; every other bit of PLL1_REG and PLL2_REG is
 * preserved.
 *
 * @note This function does not poll a "ready" status bit — the caller is
 *       responsible for waiting on CGUA_MAINPLL_STS / CGUA_SYSPLL_STS if
 *       the downstream consumer needs the output to be settled.
 * @note This function does not run PLL bring-up. Use CLOCK_InitMainPll /
 *       CLOCK_InitSysPll to bring the PLL up for the first time.
 *
 * @param pll One of ::kCLOCK_MainSysPll_Main or ::kCLOCK_MainSysPll_Sys.
 * @param out One of the ::clock_main_sys_pll_output_t values, or
 *            ::kCLOCK_MainSysPllOutput_All to enable every output at once.
 */
void CLOCK_EnableMainSysPllOutput(clock_main_sys_pll_t pll, clock_main_sys_pll_output_t out);

/*!
 * @brief Disable one or all divider outputs of a Main/System PLL.
 *
 * Symmetric with CLOCK_EnableMainSysPllOutput: clears the single bit for a
 * named output, or clears all seven output-enable bits across PLL1_REG and
 * PLL2_REG when @p out is ::kCLOCK_MainSysPllOutput_All.
 *
 * @note This function does not poll a "ready" status bit.
 *
 * @param pll One of ::kCLOCK_MainSysPll_Main or ::kCLOCK_MainSysPll_Sys.
 * @param out One of the ::clock_main_sys_pll_output_t values, or
 *            ::kCLOCK_MainSysPllOutput_All to disable every output at once.
 */
void CLOCK_DisableMainSysPllOutput(clock_main_sys_pll_t pll, clock_main_sys_pll_output_t out);

/*!
 * @brief Query whether Main/System PLL divider outputs are enabled.
 *
 * If @p out names a single output, reads the corresponding PLL1_REG or
 * PLL2_REG bit and returns whether it is set. If @p out is
 * ::kCLOCK_MainSysPllOutput_All, returns @c true only when every one of
 * the seven output-enable bits is currently set (AND semantics — "are all
 * enabled?").
 *
 * @param pll One of ::kCLOCK_MainSysPll_Main or ::kCLOCK_MainSysPll_Sys.
 * @param out One of the ::clock_main_sys_pll_output_t values, or
 *            ::kCLOCK_MainSysPllOutput_All to query "all outputs enabled".
 * @return true  for a single output: its enable bit is currently 1.
 * @return true  for ::kCLOCK_MainSysPllOutput_All: all seven output-enable
 *               bits are currently 1.
 * @return false the enable bit(s) not fully set, or an argument is out of range.
 */
bool CLOCK_IsMainSysPllOutputEnabled(clock_main_sys_pll_t pll, clock_main_sys_pll_output_t out);

/*!
 * @brief Audio/Video PLL identifier.
 *
 * The two AV PLLs on RT2660 (Audio and Video) share an identical CLKOUT_EN
 * bit layout in PERI_CGUANA.h — both at bit 3 of PLLn_PLL1_REG.
 */
typedef enum _clock_av_pll
{
    kCLOCK_AvPll_Audio = 0U, /*!< Audio PLL (CGUA_AUDIOPLL_PLL1_REG bit 3). */
    kCLOCK_AvPll_Video = 1U, /*!< Video PLL (CGUA_VIDEOPLL_PLL1_REG bit 3). */

    kCLOCK_AvPll_Count       /*!< Sentinel — not a valid PLL identifier. */
} clock_av_pll_t;

/*!
 * @brief Enable the CLKOUT output of an Audio or Video PLL.
 *
 * Sets AUDIOPLL_CLKOUT_EN (or VIDEOPLL_CLKOUT_EN) in the selected PLL's
 * PLL1_REG. Every other bit of the register is preserved.
 *
 * @note This function does not poll a "ready" status bit.
 * @note This function does not run PLL bring-up. Use CLOCK_InitAudioPll /
 *       CLOCK_InitVideoPll to bring the PLL up for the first time.
 *
 * @param pll One of ::kCLOCK_AvPll_Audio or ::kCLOCK_AvPll_Video.
 */
void CLOCK_EnableAvPllClkout(clock_av_pll_t pll);

/*!
 * @brief Disable the CLKOUT output of an Audio or Video PLL.
 *
 * Clears AUDIOPLL_CLKOUT_EN (or VIDEOPLL_CLKOUT_EN) in the selected PLL's
 * PLL1_REG.
 *
 * @param pll One of ::kCLOCK_AvPll_Audio or ::kCLOCK_AvPll_Video.
 */
void CLOCK_DisableAvPllClkout(clock_av_pll_t pll);

/*!
 * @brief Query whether the CLKOUT output of an Audio or Video PLL is enabled.
 *
 * @param pll One of ::kCLOCK_AvPll_Audio or ::kCLOCK_AvPll_Video.
 * @return true  if the CLKOUT_EN bit is currently 1.
 * @return false if it is 0 or @p pll is out of range.
 */
bool CLOCK_IsAvPllClkoutEnabled(clock_av_pll_t pll);

/*!
 * @brief Enable and select the USB FS (USBFS/KHCI) functional clock source.
 *
 * Configures the USB FS SIE clock from the requested source. For PLL-based
 * sources this powers up and locks the shared USB PHY PLL (480 MHz), which also
 * ungates the USB PHY (COMM usb0) internally. The usb1_fclk clock root is
 * expected to be pre-configured in clock_config.
 *
 * For crystal-less operation (trimming an FRO from the USB frame timing), call
 * CLOCK_EnableFroTuner with ::kCLOCK_FroTunerRefUsbFsSof1kHz as the reference
 * source after this function.
 *
 * @param src One of ::clock_usb_fs_src_t selecting the USB FS clocking path.
 * @retval true  USB FS clock configured (PHY PLL locked for PLL-based sources).
 * @retval false The USB PHY PLL failed to lock (invalid reference/multiplier).
 */
bool CLOCK_EnableUsbFsClock(clock_usb_fs_src_t src);

/*!
 * @brief Disable the USB FS (USBFS/KHCI) functional clock.
 *
 * Powers down the shared USB PHY PLL (which also gates the USB PHY, COMM usb0)
 * and powers off the usb1_fclk clock root. Call this only after all USB HS
 * consumers of the shared PHY PLL have been disabled.
 */
void CLOCK_DisableUsbFsClock(void);

/*!
 * @brief Enable and configure the USB HS (USBHS/EHCI) clocks.
 *
 * Selects FRO48M on the usb0_fro48m root as the HS reference, powers up and
 * locks the shared USB PHY PLL (480 MHz), then releases the USB HS controller
 * from reset and issues the controller-level soft reset. The USB PHY (COMM
 * usb0) is ungated inside CLOCK_EnableUsbPhyPllClock.
 *
 * For crystal-less operation (trimming an FRO from the USB frame timing), call
 * CLOCK_EnableFroTuner with ::kCLOCK_FroTunerRefUsbHsSof8kHz as the reference
 * source after this function.
 *
 * @retval true  USB HS clocks configured and the PHY PLL locked.
 * @retval false The USB PHY PLL failed to lock; the controller is left in reset.
 */
bool CLOCK_EnableUsbHsClock(void);

/*!
 * @brief Disable the USB HS (USBHS/EHCI) clocks.
 *
 * Reverses CLOCK_EnableUsbHsClock: powers down the shared USB PHY PLL (which
 * also gates the USB PHY, COMM usb0) and powers off the usb0_fro48m clock root.
 */
void CLOCK_DisableUsbHsClock(void);

/*!
 * @brief Power up and lock the USB PHY PLL (shared by USB FS and USB HS).
 *
 * The single COMM USB PHY PLL produces the 480MHz output (and its /10 = 48MHz
 * tap) that feeds both the USB HS PHY and the USB FS SIE (via the USBPLL_OUT /
 * USBPLL_48M clock roots). The reference frequency is read internally from the
 * usb0_phyclk clock root; the multiplier (480MHz / reference) must be one of the
 * hardware-supported values (15, 16, 20, 22, 24, 25, 30, 40). This function
 * blocks until the PLL reports lock.
 *
 * @retval true  USB PHY PLL powered up and locked.
 * @retval false The reference is zero or yields an unsupported multiplier.
 */
bool CLOCK_EnableUsbPhyPllClock(void);

/*!
 * @brief Power down the USB PHY PLL (shared by USB FS and USB HS).
 *
 * Reverses CLOCK_EnableUsbPhyPllClock: gates the PHY clocks, stops the USB
 * clock taps (the 480MHz output and its /10 = 48MHz tap), then powers down the
 * PLL and its regulator. Call this only after all USB FS / USB HS consumers of
 * the PLL have been disabled, as the PLL is shared between them.
 */
void CLOCK_DisableUsbPhyPllClock(void);

/*!
 * @brief Enable the FRO tuner (FLL) of the selected FRO against a reference source.
 *
 * Configures and enables the CGUANA FLL that tunes either the 12 MHz FRO or the
 * 192 MHz FRO (selected by @p target ) against the chosen reference window.
 *
 * @param target Which FRO to tune, see \ref clock_fro_tuner_target_t.
 * @param src Which reference source tunes the FRO, see \ref clock_fro_tuner_src_t.
 * @param lockCriteria Number of consecutive in-window results required to declare
 *                     lock (FROxxM_LOCK_CRITERIA field, 2 bits, range 0..3). A
 *                     larger value is more robust to jitter but slower to lock; 2
 *                     is the typical default.
 *
 * @note The selected reference source must already be running before the tuner
 *       is enabled. TUNE_EN is asserted last, after all configuration fields are
 *       programmed. Call ::CLOCK_DisableFroTuner to stop tuning.
 * @note The FRO12M and FRO192M tuners share the reference-source selection
 *       (CKREF_SOURCE_SEL and SXOSC_FREF_SEL are common fields), so enabling one
 *       reprograms the reference selection for both. The two FROs can therefore
 *       only be tuned against the same reference source at the same time.
 */
void CLOCK_EnableFroTuner(clock_fro_tuner_target_t target, clock_fro_tuner_src_t src, uint16_t lockCriteria);

/*!
 * @brief Disable the FRO tuner (FLL) of the selected FRO.
 *
 * Clears the selected FRO's TUNE_EN to stop tuning; the other tuner
 * configuration fields are left untouched so a subsequent ::CLOCK_EnableFroTuner
 * can re-enable with the same or a new reference source.
 *
 * @param target Which FRO tuner to disable, see \ref clock_fro_tuner_target_t.
 */
void CLOCK_DisableFroTuner(clock_fro_tuner_target_t target);

/*!
 * @brief Dump a clock-root capability table to the debug console.
 *
 * Iterates every CCM clock root from kCLOCK_Root_CGU_START to
 * kCLOCK_Root_MEDIA_END, reads STATUS1, and prints a formatted table with
 * one row per valid root.  Each row contains:
 *   - id            : numeric clock_root_t value
 *   - name          : human-readable root name string
 *   - glitch_free   : 1 if the root supports glitch-free mux switching (STATUS1.GLITCH_FREE)
 *   - divPresent    : 1 if a primary post-divider field is present (STATUS1.DIV_PRESENT)
 *   - divWidth      : bit width of the primary divider field
 *   - sndDivPresent : 1 if a secondary post-divider is available (STATUS1.SECOND_DIVIDER_PRESENT)
 *   - sndDivWidth   : bit width of the secondary divider field
 *
 * @note Compiled only when BOARD_ENABLE_CLOCK_INFO_DUMP is defined and non-zero.
 *       Requires the debug console (PRINTF) to be initialized before calling.
 */
#if defined(CLOCK_ENABLE_INFO_DUMP) && CLOCK_ENABLE_INFO_DUMP
void CLOCK_InfoDump(void);
#endif

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/*! @} */

#endif /* _FSL_CLOCK_H_ */
